[
  {
    "id": "asg_nidhogg",
    "source": "ASG",
    "name": "NIDHOGG",
    "mechtype": ["Artillery", "Support"],
    "y_pos": 57,
    "license": "NIDHOGG",
    "license_level": 2,
    "description": "<p>A prototype compact version of ASGARD's intimidating Nidhogg-class Autonomous Dreadnought, the \"Nidhogg Junior\" was created by engineers working at the Kykrfjall foundry on Niflheim. While the reduction in size makes it far more viable for widespread use, concessions to the mech's internal architecture ensured that the frame never saw an actual commercial release. Nonetheless, plans for the mech made their way to the public after a crew of pilots returned to the abandoned foundry and found the hitherto unused schematics buried in a dusty server deep within the bowels of the facility.</p>",
    "mounts": ["Heavy"],
    "stats": {
      "size": 3,
      "stress": 4,
      "structure": 4,
      "armor": 3,
      "hp": 10,
      "evasion": 6,
      "edef": 6,
      "heatcap": 8,
      "repcap": 6,
      "sensor_range": 10,
      "tech_attack": -2,
      "save": 10,
      "speed": 3,
      "sp": 6
    },
    "traits": [
      {
        "name": "Heavy Frame",
        "description": "The Nidhogg can’t be pushed, pulled, knocked Prone, or knocked back by smaller characters."
      },
      {
        "name": "\"Nastrond\" Point Defense Subsystem",
        "description": "Adjacent allied characters gain soft cover, even in the open."
      },
      {
        "name": "Thermal Engine Recycling",
        "description": "Once per mission, when taking Stress damage, you may choose to not make a Overheat roll. This does not prevent the damage, and all Heat is cleared as though you Overheated normally."
      },
      {
        "name": "Slow",
        "description": "The Nidhogg receives +1 Difficulty on AGILITY checks and saves.",
        "synergies": [
          {
            "locations": ["agility", "skill_check"],
            "detail": "The Nidhogg gains +1 Difficulty on AGILITY checks and saves."
          }
        ]
      }
    ],
    "core_system": {
      "name": "Roots of Yggdrasil V2.07",
      "description": "Rather than being a single weapon, the Roots of Yggdrasil are a suite of autonomous cannons and turrets mounted around the entire body of the Nidhogg, capable of suppressing a large area or focusing down a single high priority target. Though this variant suite is far less powerful than the original, the redesign doesn't require the same access to a dedicated foundry that the original relied upon to keep all two-hundred and fourteen of its turrets supplied.",
      "active_name": "Ragnarok",
      "active_effect": "Activate the Roots of Yggdrasil's Annihilation Mode.",
      "activation": "Protocol",
      "integrated": ["mw_nidhogg_integrated"]
    },
    "data_type": "frame",
    "image_url": "https://lh4.googleusercontent.com/ycLNhoJrL_7eBw6d9RgCS1L4X5_vgOQDzUAkMFVawyU_Ujc4QUnA-DebcdFokmtgY6s=w2400"
  },
  {
    "id": "asg_fenrir",
    "license_level": 2,
    "source": "ASG",
    "name": "FENRIR",
    "mechtype": ["Striker"],
    "y_pos": 23,
    "description": "The utility of ASGARD's Fenrir model has always been in question. A mech designed in such a way that the pilot puts themself in maximum danger to eke out a tiny extra bit of effectiveness in combat doesn't seem, on its surface, that it would appeal to many pilots. Indeed, it doesn't. However, to a specific kind of pilot, with just enough bravery and a touch of insanity, the Fenrir's integrated battlesuit offers enough utility and safety to be incredibly appealing. As such, despite many, many attempts by the Outer Arm Frontier Sector Administration to discourage the production of the Fenrir, it has remained in steady, if limited, production since it was first conceived.<br/><i>\"It's like ASGARD read stories about the stupid shit Lancers pull and designed a Mech based on that.\"</i>",
    "mounts": ["Heavy", "Main"],
    "stats": {
      "size": 1,
      "structure": 4,
      "stress": 4,
      "armor": 1,
      "hp": 9,
      "evasion": 8,
      "edef": 6,
      "heatcap": 4,
      "repcap": 6,
      "sensor_range": 5,
      "tech_attack": -2,
      "save": 10,
      "speed": 6,
      "sp": 4
    },
    "traits": [
      {
        "name": "Call of the Wild",
        "description": "Pilots may mount and dismount from the Fenrir as a quick action instead of a full action."
      },
      {
        "name": "Fenriswolf-Class Integrated NHP",
        "description": "The Fenrir gains the AI tag, if it doesn't already have it from its systems.<br>While you are wearing the Tyr Battlesuit, as long as it is not in Emergency Standby, any NHP that pilots your mech benefits from your talents."
      },
      {
        "name": "Underspec Computer",
        "description": "The Fenrir receives +1 Difficulty on all SYSTEM saves and checks.",
        "synergies": [
          {
            "locations": ["systems"],
            "detail": "The Fenrir receives +1 Difficulty on all SYSTEM saves and checks."
          }
        ]
      }
    ],
    "core_system": {
      "name": "WARWOLVES",
      "description": "The Revision Two ASG-BERSERK system is a complex network of neural jacks and chemical injectors within the Tyr Battlesuit that allows the pilot of the mech to control and communicate with it at the speed of thought, effectively allowing the pilot to control the mech in the same way as an NHP. Pilots who use the system have reported feeling a strong connection to the NHPs installed on their mech, and have more than once referred to them as their \"pack\". Medical and psychological analysis of said pilots show no significant or unexpected divergance from a typical pilot's neural patterns, and so the phenOMENon is largely attributed to the eccentricity of mech pilots and the name of the frame, itself.",
      "active_name": "Beasts of Slaughter",
      "active_effect": "Immediately recharge ASG-BERSERK Stimulant Injection. For the rest of the scene, whenever you attack with the Wolfstooth, the Fenrir may Overwatch your target.",
      "activation": "Protocol",
      "use": "Encounter",
      "passive_name": "Tyr Battlesuit",
      "passive_effect": "When you dismount from the Fenrir for any reason, you may choose to exit while wearing the linked Tyr Battlesuit, instead of your normal Hardsuit. Doing so offers several benefits as long as the Battlesuit is worn:<ul><li>Your speed is increased to match the Fenrir's.</li><li>You gain an HP boost of 5.<li>You gain 2 Armor.</li><li>Your Evasion and E-Defense are increased to 11.</li><li>You have Resistance to damage and Burn from attacks that target more than one character.</li><li>You gain access to the ASG-BERSERK Stimulant Injection Reaction and the Wolfstooth weapon.</li></ul>However, the Battlesuit needs to draw power from the Fenrir at the end of each of your turns to function. If you are more than range 8 away from the Fenrir or if the Fenrir is destroyed when you end your turn, your Battlesuit enters Emergency Standby: you are Immobilized and Jammed until the Fenrir comes back into range or until you exit the Battlesuit as a Full Action. In addition, any Tech Actions that affect the Fenrir affect the Tyr Battlesuit, as well.",
      "passive_actions": [
        {
          "activation": "Reaction",
          "name": "ASG-BERSERK Stimulant Injection",
          "trigger": "You would be reduced to 0 HP while wearing the Tyr Battlesuit.",
          "detail": "You regain all HP and clear any Burn affecting you.<br>If you have already used this reaction during this scene, you may mark a repair when you Stabilize while directly piloting the Fenrir to \"recharge\" it, allowing you to use it again in the same scene.",
          "frequency": "1/Scene"
        }
      ],
      "integrated": ["asg_tyr_sword"]
    },
    "data_type": "frame",
    "image_url": "https://lh3.googleusercontent.com/GX86BK7hKHwzEgXGSxrmZcfLhqID6yiee7UvsjKARo5mVMM7w0P_Ye9hYWLzx8PG_wA=w2400"
  },
  {
    "id": "asg_jormungandr",
    "license_level": 2,
    "source": "ASG",
    "name": "JORMUNGANDR",
    "mechtype": ["Controller", "Striker"],
    "y_pos": 25,
    "description": "ASGARD developed the Jormungandr frame on technology recovered from damaged HORUS Hydra pattern group mechs. While the utility of the Hydra's suite of drones was appealing to ASGARD's engineers, ASGARD insisted that they design its variation to meet the needs of defense enterprises that wanted a more straightforward mech. The resulting frame far exceeded ASGARD's typical technical specifications, and ASGARD began to heavily push it as their primary frontline mech in an attempt to recover from their disastrous investment in their Niflheim Mining and Research Initiative. Still reeling from their financial losses, ASGARD is relying on the Jormungandr's success to snatch them from the jaws of bankruptcy and obsolecence.",
    "mounts": ["Main", "Main"],
    "stats": {
      "size": 1,
      "structure": 4,
      "stress": 4,
      "armor": 1,
      "hp": 10,
      "evasion": 8,
      "edef": 7,
      "heatcap": 5,
      "repcap": 4,
      "sensor_range": 10,
      "tech_attack": 0,
      "save": 10,
      "speed": 4,
      "sp": 6
    },
    "traits": [
      {
        "name": "Ouroboros",
        "description": "1/Round the Jormungandr may swap places with one of its Deployables or Drones.",
        "actions": [
          {
            "activation": "Quick Tech",
            "name": "Ouroboros",
            "detail": "As long as you aren't Immobilized or Slowed, choose one of your Deployables or Drones within Range 10. You teleport to its location, and it simultaneously teleports to your original location. If the chosen Deployable was an armed Mine, it immediately triggers.",
            "frequency": "1/Round"
          }
        ]
      },
      {
        "name": "Ophidian Rage",
        "description": "1/Scene, when a Deployable or Drone placed by the Jormungandr is destroyed, it can deploy a Deployable or Drone as a Reaction."
      },
      {
        "name": "Amputation",
        "description": "While the Jormungandr has no undestroyed and undeployed weapons installed on it, it is considered size 1/2."
      },
      {
        "name": "Specialized Weapon Mounts",
        "description": "The Jormungandr cannot install Superheavy weapons for any reason. No rule supercedes this."
      }
    ],
    "core_system": {
      "name": "\"Serpent's Head\" Remote Weapons Platform",
      "description": "<i>When you alone are not enough, Jormungandr is there to help you encircle and protect what matters to you.</i> - ASGARD Promotional Material",
      "active_name": "Kraken Duplicate Deployment",
      "active_effect": "Deploy a Serpent's Head turret for one weapon on each of your mounts. These Serpent's Heads do not disable the mount they are deployed from and have no negative effects when they are destroyed.",
      "activation": "Full",
      "passive_name": "Autotomize",
      "passive_effect": "As a quick action, you can separate a weapon from the Jormungandr, deploying it as a Serpent's Head turret.<br>When you deploy a Serpent's Head choose one of your weapons. As long as the Serpent's Head is deployed, you cannot use the mount that weapon was mounted on for normal attacks or to deploy other Serpent's Heads. Instead, that weapon is mounted on the Serpent's Head for use with the Snakebite reaction, which can be taken once per Round for each deployed Serpent's Head. Your Serpent's Heads share your E-Defense and Evasion, and reload weapons mounted on them when you do. When a Serpent's Head is destroyed, destroy the mount that its weapon was taken from.",
      "deployables": [
        {
          "type": "Drone",
          "name": "Serpent's Head",
          "activation": "Quick",
          "evasion": "Special",
          "detail": "Gain the Snakebite reaction, which can be taken 1/round per deployed Serpent's Head.",
          "edef": "Special",
          "size": 0.5,
          "hp": "15 + {grit}",
          "actions": [
            {
              "name": "Snakebite",
              "activation": "Reaction",
              "trigger": "You or an ally make an attack against an enemy within range of the weapon on this Serpent's Head.",
              "frequency": "1/Round",
              "detail": "Make an attack with the weapon mounted on this Serpent's Head, originating from its location, against the targeted enemy."
            },
            {
              "activation": "Free",
              "name": "Recombine",
              "detail": "Reclaim an adjacent Serpent's Head into your mech, undeploying it and regaining normal use of the mount. If you reclaim a damaged Serpent's Head, you may not use that mount to deploy a new Serpent's Head until you Stabilize."
            }
          ]
        }
      ]
    },
    "data_type": "frame",
    "image_url": "https://lh3.googleusercontent.com/DQ5vccdX2L4U-EGqR0utXa4o_GmMOt4iiXXmQIPgCE7qF3R3TZo_JoA1Olj-6hx0nn4=w2400"
  },
  {
    "id": "asg_draugr",
    "license_level": 2,
    "source": "ASG",
    "name": "DRAUGR",
    "mechtype": ["Striker"],
    "y_pos": 25,
    "description": "<i>To anyone who reads this: the Draugr was not intended for release. If you want the benefits of ASGARD's work on the ASG-BERSERK system to make it safe long-term, get a Fenrir, instead. It doesn't have the same side effects as this thing's version. The patterns here were only ever prototypes, and while they do work, in a sense, the whole project was shadowed by mechanical failure, injury, and death. If that's not enough to dissuade you, so be it. I only maintain these licenses as a matter of personal pride as the former director of the project and as a monument to the things we accomplished, good and bad. Whatever happens from here is your own damn fault.</i>",
    "mounts": ["Main", "Aux/Aux"],
    "stats": {
      "size": 1,
      "structure": 4,
      "stress": 4,
      "armor": 0,
      "hp": 8,
      "evasion": 9,
      "edef": 6,
      "heatcap": 7,
      "repcap": 4,
      "sensor_range": 5,
      "tech_attack": -2,
      "save": 11,
      "speed": 4,
      "sp": 6
    },
    "traits": [
      {
        "name": "Martial Subroutines",
        "description": "The Draugr may make an Improvised Attack as a quick action, instead of a full action. The Draugr's Improvised Attacks deal 3d3 Kinetic damage instead of 1d6. If you have a talent or system that also changes the damage and effects of Improvised Attacks, you may choose which profile to use."
      },
      {
        "name": "Walking Dead",
        "description": "If the Draugr takes damage that would reduce it to 0 HP on any turn except its own, it instead falls to 1 HP and any excess damage is prevented. Until the end of the Draugr's next turn, any further damage it would take (after reductions like Armor or Resistance) is stored. At the end of the Draugr's next turn, it loses 1 Structure (and makes a Structure roll) and fully heals, then immediately takes all stored damage."
      },
      {
        "name": "Unstable Targeting System",
        "description": "The Draugr gets -2 to all Ranged attack rolls."
      }
    ],
    "core_system": {
      "name": "ASG-BERSERK REVISION ZERO",
      "description": "<i>I warned you.</i>",
      "active_name": "GIVE IN",
      "active_effect": "This ability is <b>Efficient</b> and will refund 1 Core Point at the end of any scene in which this ability was used.<br/><br/>This action may only be taken if you are physically present in the Draugr. Until the end of the scene:<ul><li>You cannot make Ranged attacks.</li><li>You cannot take or be affected by tech actions, friendly or hostile, and any AIs installed on the Draugr deactivate, falling inactive until this effect ends.</li><li>Your Improvised Attacks gain +1 Accuracy, deal 1d3 bonus Kinetic damage and cannot have their damage reduced in any way.</li><li>You ignore the normal restrictions on duplicate actions for Inprovised Attacks.</li><li>At the end of each of your turns, the Draugr's Pilot loses 3 HP if they are alive and conscious.</li></ul>If you, the pilot, are killed or knocked Down and Out, the Draugr begins to pilot itself, as though it was controlled by a cascading NHP.<br/><br/>It is, however, <i>not</i> controlled by an NHP: just the echoes of the pilot's last, panicked thoughts.",
      "activation": "Protocol",
      "use": "Encounter"
    },
    "data_type": "frame",
    "image_url": "https://lh4.googleusercontent.com/ORDbkIe3DkPfl1jYexxC_Z_hlrmRXVoqEuvkmMB6XLoLGr396CrTSp5-Ro_vBcndUw0=w2400"
  },
  {
    "id": "asg_muninn",
    "source": "ASG",
    "name": "MUNINN",
    "mechtype": ["Artillery"],
    "y_pos": 57,
    "license": "MUNINN",
    "license_level": 2,
    "description": "<p>ASGARD's oldest and most venerated mech design, the MUNINN is more of a more of a mobile artillery command center than a mech. Slow and fragile, the goal of the average MUNINN pilot is to remain as far from combat as possible, raining hellfire upon its foes from a safe distance. Each revision of the mech has improved its computing capabilities, which, when coupled with its respectable arsenal, allows it to field the most cutting edge artillery available. This includes a connection to ASGARD's proprietary HUGINN siege satellite, allowing for remote strikes anywhere and everywhere in sight.</p>",
    "mounts": ["Heavy", "Flex", "Main"],
    "stats": {
      "size": 2,
      "stress": 4,
      "structure": 4,
      "armor": 0,
      "hp": 4,
      "evasion": 6,
      "edef": 12,
      "heatcap": 6,
      "repcap": 4,
      "sensor_range": 15,
      "tech_attack": 0,
      "save": 12,
      "speed": 3,
      "sp": 6
    },
    "traits": [
      {
        "name": "High-Sensitivity Thermoscope",
        "description": "When attacking Invisible characters, the Muninn may choose to receive +1 Difficulty. If it does, the Muninn treats the target as though it isn't Invisible for that attack."
      },
      {
        "name": "Raven's Eyes",
        "description": "Seeking and Guided weapons installed on the Muninn have their range increased by 5 and gain an additional +1 Accuracy when consuming Lock On. Integrated weapons do not benefit from this effect.",
        "synergies": [
          {
            "locations": [
              "weapon"
            ],
            "weapon_types": [
              "Rifle",
              "Cannon",
              "Launcher",
              "CQB",
              "Nexus",
              "Melee"
            ],
            "weapon_sizes": [
              "any"
            ],
            "detail": "The range of the Muninn's Seeking and Guided weapons is increased by one and these weapons gain an additional +1 Accuracy when consuming Lock On."
          }
        ]
      }
    ],
    "core_system": {
      "name": "Linked Seige Weapon \"HUGINN\"",
      "description": "Each Muninn frame is built with an onboard virtual tunnel connection to a linked Huginn-Class satellite capable of delivering electromagnetic pulse strikes and deploying space-to-surface ballistic weaponry. While the official version of the Huginn weapons platform is distributed with a conventional missile battery, a version capable of housing tactical fusion weaponry was also leaked. Though ASGARD claims to have no connection to the leak, they still provide full support for the NEVERMORE missile system anyway, provided that the user is discreet when they ask.",
      "passive_effect": "At the start of every combat scene, your Muninn automatically connects to its paired Huginn orbital satellite weapon, which can be fired as a Full Tech Action if it is charged.",
      "active_name": "NEVERMORE",
      "active_effect": "Call for the delivery of a NEVERMORE air burst payload from HUGINN. Upon launch, the point defense systems of most mechs and vehicles will alert their operators to an impending nuclear strike.<br/><br/>At the end of the round, after all characters have acted, NEVERMORE will detonate somewhere above the battlefield, releasing a massive thermonuclear shockwave that causes all of the following effects immediately:<ul><li>All characters in the scene, including yourself, take 2d6 AP Explosive damage and 6 Burn from the detonation. Affected characters may attempt a Systems save to prevent the Burn damage. You and your allies gain +2 Accuracy on this save.<br></li><li>All mechs Shut Down immediately, though their systems trigger an emergency restart that allows them to Boot Up as a protocol. Biological targets are Stunned until the start of their next turn, instead. Unprotected individuals in the scene (i.e. Humans that aren't part of a Squad or in a Mech) are Stunned until they receive medical attention or a Corrective.</li><li>Until an affected Mech takes a Full Action to hard reboot their computers:<ul><li>Their Guided, Seeking and Smart weapons always miss when used for an attack.</li><li>They cannot take or be affected by Tech actions.</li><li>Their systems with the AI tag cannot be Activated.</li><li>Their NHPs and Comp/Con units cannot take any actions. If an NHP was in control of their Mech when NEVERMORE detonated, that mech is Stunned until a human pilot takes control of it.</li></ul></li><li>One of the following may occur, depending on the location of the battle:<ul><li>On an artificial structure such as a starbase or spaceship, the artificial gravity generation of the structure is disabled and the battlefield becomes zero-g until the end of combat.</li><li>On the surface of a planet with an atmosphere, the blast triggers a cloudburst that causes a short bout of heavy rain. All characters gain soft cover until the end of combat.</li></ul></li></ul>",
      "activation": "Full Tech",
      "use": "Encounter",
      "integrated": ["mw_muninn_integrated"]
    },
    "data_type": "frame",
    "image_url": ""
  },
  {
    "id": "asg_fafnir",
    "license_level": 2,
    "source": "ASG",
    "name": "FAFNIR",
    "mechtype": ["Striker"],
    "y_pos": 35,
    "description": "",
    "mounts": ["Heavy", "Aux/Aux"],
    "stats": {
      "size": 1,
      "structure": 4,
      "stress": 4,
      "armor": 1,
      "hp": 6,
      "evasion": 12,
      "edef": 6,
      "heatcap": 9,
      "repcap": 5,
      "sensor_range": 2,
      "tech_attack": 0,
      "save": 10,
      "speed": 14,
      "sp": 5
    },
    "traits": [
      {
        "name": "MOMENtum",
        "description": "Due to the speed with which it moves, the Fafnir has limited mobility.<ul><li>When taking any movement action or reaction (such as a Boost) and when taking its standard move, the Fafnir can only move in a straight line.</li><li>The Fafnir cannot split its standard move. Once it stops during a standard move, it loses all unused movement.</li></ul>"
      },
      {
        "name": "Blast Brakes",
        "description": "Whenever the Fafnir ends any movement or takes the Boost action, it deals 3 AP Explosive damage to all characters adjacent to it."
      },
      {
        "name": "Jetskate",
        "description": "The Fafnir is immune to Slow and Immobilization caused by other characters."
      }
    ],
    "core_system": {
      "name": "Dragonfire Jets",
      "description": "At a certain speed, movement becomes difficult for the human eye to track. At a higher speed, movement becomes difficult for computer systems to track. Beyond this point, movement may become so rapid that it is imperceptible to vision, human or digital, entirely. By overcharging its engines, the Fafnir can exceed this threshold, its movements indistinguishable from teleportation. The resulting sonic booms may be mistaken for gunfire at a distance.",
      "active_name": "Dragonflight",
      "active_effect": "Until the end of combat: <ul><li>Whenever the Fafnir takes its standard move or Boosts, instead of its normal movement, it teleports to a space within Range 30. This teleportation triggers Blast Brakes as normal.</li><li>When the Fafnir deals damage with Blast Brakes, it may apply Lock On to one of the characters it damaged.</li></ul>",
      "activation": "Protocol",
      "use": "Encounter"
    },
    "data_type": "frame",
    "image_url": ""
  },
  {
    "id": "lumico_virtuoso",
    "license_level": 2,
    "source": "LUMICO",
    "name": "VIRTUOSO",
    "mechtype": ["Controller", "Artillery"],
    "y_pos": 22,
    "description": "The Virtuoso is the only mech frame that Lumiera Corporation has produced for widespread release, if you can consider a release to a hand-vetted waitlist of pilots 'widespread'. It's gaudy, over-engineered, and ludicrously expensive, and yet, hordes of pilots clamber over one another to wait on a list for access to its license. Merely possessing this mech tells a potential employer, \"If I couldn't do everything I claim, Lumiera would have never let me pilot one of their precious mechs.\" After all, Lumiera's standards are astronomical, both for the capabilities of their own mechs and of the pilots that use them.<br><i>Note: Wings are for display purposes only. Lumiera Corporation requests that pilots disconnect the Virtuoso's wings before combat use.</i>",
    "mounts": ["Heavy", "Flex"],
    "stats": {
      "size": 1,
      "structure": 4,
      "stress": 4,
      "armor": 0,
      "hp": 6,
      "evasion": 10,
      "edef": 10,
      "heatcap": 5,
      "repcap": 2,
      "sensor_range": 15,
      "tech_attack": 1,
      "save": 10,
      "speed": 5,
      "sp": 6
    },
    "traits": [
      {
        "name": "Dissonance",
        "description": "When the Virtuoso successfully Invades an enemy, it gains +1 Accuracy on all Ranged attacks against that target until the end of its turn."
      },
      {
        "name": "Harmony",
        "description": "The Virtuoso still benefits from and can take tech actions while Jammed."
      }
    ],
    "core_system": {
      "name": "\"CURTAIN CALL\" Weapons System",
      "description": "The body of the Virtuoso conceals a massive integrated cannon that can pierce through most armor, its parts hidden within the right arm of the mech. Deploying this cannon converts the other limbs of the mech into stabilizers that lock it in place while it aims, providing incredible accuracy and power. This, of course, comes at the expense of leaving the Virtuoso vulnerable to enemy fire.",
      "active_name": "Third Act",
      "active_effect": "Activates the integrated weapon system, converting the Virtuoso into a massive cannon emplacement. Gain an Act die, 1d6 starting at 3. While you have the Act die: you are Immobilized, and you cannot attack with any weapon except the Third Act integrated weapon. Each attack with the Third Act reduces the Act die by 1, and the final attack is exceptionally strong. If you are moved from your location by any effect while you possess the Act die, the Act die is discarded. You may also discard the Act die as a free action.",
      "activation": "Protocol",
      "integrated": ["mw_virtuoso_integrated"]
    },
    "data_type": "frame",
    "image_url": "https://lh3.googleusercontent.com/yZN_o-F39Y8M_J5hPrSL9Ylz9KHmhpWdi972JtEOE-2GwDHKSZH5ExykxnYjkF5JT8I=w2400"
  },
  {
    "id": "lumico_philosopher",
    "license_level": 2,
    "source": "LUMICO",
    "name": "PHILOSOPHER",
    "mechtype": ["Support"],
    "y_pos": 25,
    "description": "START BOOT SEQUENCE... -&gt;<br>USING LUMIERA CORPORATION MECH FRAMEWORK 209.1 \"PHILOSOPHER\"... -&gt;<br>NOTE: THIS IS PROPRIETARY EXPERIMENTAL TECHNOLOGY... -&gt;<br>IMPROPER USE OF CAUSALITY ENGINE MAY RESULT IN TEMPORAL ERASURE... -&gt;<br>IF YOU BELIEVE YOU SHOULD NOT HAVE ACCESS TO THIS SYSTEM, PLEASE CONTACT AN ADMINISTRATOR... -&gt;<br>ACTIVATING CAUSALITY ENGINE NOVA... -&gt;<br>CAUSALITY RECORDER ACTIVE... -&gt;<br>TIMELINE ALTERATION READY... -&gt;<br>GO. -&gt;",
    "mounts": ["Main/Aux"],
    "stats": {
      "size": 3,
      "structure": 4,
      "stress": 4,
      "armor": 0,
      "hp": 4,
      "evasion": 6,
      "edef": 12,
      "heatcap": 6,
      "repcap": 2,
      "sensor_range": 20,
      "tech_attack": 2,
      "save": 10,
      "speed": 3,
      "sp": 8
    },
    "traits": [
      {
        "name": "DISPLAYING MESSAGE FROM ADMINISTRATOR... ->",
        "description": "<code class='horus'>DON'T LET NOVA FOOL YOU. YOU ARE NOT IN CONTROL.</code>"
      },
      {
        "name": "Subjective Selection",
        "description": "Gain the Subjective Selection reaction.",
        "actions": [
          {
            "activation": "Reaction",
            "name": "Subjective Selection",
            "trigger": "The Philosopher is affected by an enemy's action.",
            "detail": "Time is altered to a more favorable timeline, negating all effects of that action (including damage, heat, conditions, or forced movement) that would apply to the Philosopher. The Philosopher may take this action even if it would not normally be able to, such as if it is Stunned.",
            "frequency": "2/Scene"
          }
        ]
      },
      {
        "name": "Slow",
        "description": "The Philosopher gets +1 Difficulty on Agility checks and saves.",
        "synergies": [
          {
            "locations": ["agility", "skill_check"],
            "detail": "The Philosopher gains +1 Difficulty on Agility checks and saves."
          }
        ]
      }
    ],
    "core_system": {
      "name": "\"NOVA\" Perfect Causality Engine",
      "description": "READY -&gt;<br>I WILL GRANT YOU ONE WISH... -&gt;",
      "passive_name": "Causality Micro-Fracture",
      "passive_effect": "The Philosopher always has access to the <i>REQUEST: REPEAT SQUENCE</i> Reaction.",
      "passive_actions": [
        {
          "activation": "Reaction",
          "name": "REQUEST: REPEAT SEQUENCE",
          "trigger": "Any other character within Sensors takes one of the following actions:<ul><li>Makes a weapon attack that does not use a Superheavy weapon.</li><li>Takes a Quick Tech action, either on its own or as a part of a Full Tech action.</li><li>Boosts, Rams, or Grapples.</li><li>Activates a System as a Quick Action.</il></ul>",
          "detail": "That character immediately takes the same action again as a free action. They do not need to choose the same target, but they must use the same systems/weapons and use the same profile, if applicable. If an attack was made with a Loading weapon, the target may attack with it even with the weapon unloaded. Limited systems and weapons act as though they expended a single charge without actually doing so.<br><br>On your next turn after using this action, you may only take 1 Quick Action and you may not take Full Actions, though you may still move and take Free Actions as normal. If <i>Forge of Hours</i> is active, this penalty does not apply.",
          "frequency": "1/Round"
        }
      ],
      "active_name": "Forge of Hours",
      "active_effect": "NOVA prepares to alter the passage of time on a larger scale. At the start of your next turn gain a Miracle die, 1d6 starting at 3, and enter a transcendent state: you gain Immunity to all effects, hostile and friendy, and access to a suite of powerful actions. During your turn, you may take no movement or actions except ones provided by the Philosopher's Core System. Each time you use one of the actions granted by this action, reduce the Miracle die by 1. When the Miracle die's value would be reduced to 0, this effect ends.",
      "activation": "Full",
      "active_actions": [
        {
          "activation": "Full",
          "name": "REQUEST: AVERT SEQUENCE",
          "detail": "Restore an ally in Sensors to full HP and clear all Heat, Burn and conditions affecting them, or restore a destroyed ally Mech to a functioning state with full HP, no Heat, 1 STRUCTURE and 1 STRESS. The pilot of that mech is returned to the cockpit, alive, even if they died."
        },
        {
          "activation": "Reaction",
          "name": "REQUEST: ALTER SEQUENCE",
          "trigger": "An ally within Sensors is damaged by an attack.",
          "detail": "The damage and any secondary effects from the attack is prevented. That ally teleports to any space where they could validly attack the attacker, then immediately attacks the target with a valid weapon. You may not take actions on your next turn."
        },
        {
          "activation": "Full",
          "name": "REQUEST: ENHANCE SEQUENCE",
          "detail": "Target hostile character within Sensors is Stunned and Shredded until the end of your next turn."
        }
      ]
    },
    "data_type": "frame",
    "image_url": "https://lh6.googleusercontent.com/Ey44B0eFSxc2VYLye67Sa6TxgrWWE34xfo3TirOtaxJ2AZ5WW8Ji6yBsc5GIZL_52fQ=w2400"
  },
  {
    "id": "lumico_trailblazer",
    "license_level": 2,
    "source": "LUMICO",
    "name": "TRAILBLAZER",
    "mechtype": ["Striker"],
    "y_pos": 35,
    "description": "The colonists of the Outer Arm are practical people, with no need or patience for the typical theatrical flair of the Lumiera Corporation. This proved to be an issue for the company, who had built their reputation on the idea that the greatest adventurers and pilots sought out their mechs as a prize. In an effort to convice the pioneers of the Outer Arm of their value, Lumiera Corporation developed the Trailblazer, released to specific individuals that the company deemed \"of interest\", built using practical designs that lacked some of the usual flair of Lumiera's other mechs. Whether its reception will lead to further release, only time will tell.",
    "mounts": ["Heavy", "Main", "Flex"],
    "stats": {
      "size": 1,
      "structure": 4,
      "stress": 4,
      "armor": 1,
      "hp": 7,
      "evasion": 9,
      "edef": 8,
      "heatcap": 7,
      "repcap": 3,
      "sensor_range": 5,
      "tech_attack": 0,
      "save": 10,
      "speed": 5,
      "sp": 6
    },
    "traits": [
      {
        "name": "Manifest Destiny",
        "description": "1/Round as a free action, as long as the Trailblazer isn't Immobilized or Slowed, it may move up to its Speed towards an enemy.",
        "actions": [
          {
            "activation": "Free",
            "name": "Manifest Destiny",
            "detail": "As long as you aren't Immobilized or Slowed, move up to your Speed towards an enemy of your choice. You must move as directly as possible and get as close to the chosen enemy as possible.",
            "frequency": "1/Round"
          }
        ]
      },
      {
        "name": "Burning Heart",
        "description": "1/Round, when the Trailblazer gains Heat from any source other than Overcharging, it deals 2 bonus Burn damage on its next successful non-Tech attack that turn. The action that generated the Heat does not benefit from this effect (e.g. if a Skirmish taken by the Trailblazer causes it to gain Heat from one of the weapons used, it does not benefit from this effect until all attacks made during that Skirmish completely resolve.)"
      },
      {
        "name": "Bloody Flux",
        "description": "Whenever the Trailblazer begins a movement, if it was not part of the Trailblazer's standard movement, it gains 2 Heat. This cannot be reduced or prevented by any means."
      }
    ],
    "core_system": {
      "name": "\"PIONEER\" Combat Engine",
      "description": "<i>\"Go west, Pioneer, go west,<br>With your gun in hand,<br>Go west, Pioneer, go west,<br>And take the Promised Land.\"</i>",
      "passive_name": "Work Song",
      "passive_effect": "Gain a Verse die, 1d6 beginning at 3.<br>1/Turn, when the Trailblazer deals damage with a melee or ranged attack, the value of the Verse die decreases by 1 if either:<ul><li>The Trailblazer already dealt damage with with the opposite type this round (e.g., if the Trailblazer deals damage with a melee attack after it dealt damage with a ranged attack.)</li><li>Or, the Trailblazer deals bonus damage with <i>Burning Heart</i>.</li></ul> When the die would be reduced to 0, the Trailblazer immediately makes a special attack with a single weapon against an enemy within Range 3. This attack does not count as an action or reaction and ignores Difficulty from all sources. If this attack would damage multiple characters, all characters beyond the first take a maximum of 1 damage from the attack. Then, reset the Verse Die to 3.",
      "active_name": "Call & Response",
      "active_effect": "Until the end of the scene, the Verse die is reset to 2 instead of 3 when it is reduced to 0, and whenever the Trailblazer makes a special attack through to the effect of <i>Work Song</i>, the Trailblazer nominates an allied character within Range 15. That character may immediately make an attack following the conditions of <i>Work Song.</i> The Trailblazer may not nominate the same character to receive this effect twice in a row.",
      "activation": "Protocol",
      "use": "Encounter"
    },
    "data_type": "frame",
    "image_url": "https://lh5.googleusercontent.com/HKgB0oT0l5ZybXSDdTI4PBC61RclF29QqIdqNG1N1UL1QtnwHt9txwfsFJnsZVi1ZS4=w2400"
  },
  {
    "id": "lumico_savant",
    "license_level": 2,
    "source": "LUMICO",
    "name": "SAVANT",
    "mechtype": ["Striker"],
    "y_pos": 35,
    "description": "",
    "mounts": ["Heavy", "Aux/Aux", "Flex"],
    "stats": {
      "size": 0.5,
      "structure": 4,
      "stress": 4,
      "armor": 0,
      "hp": 6,
      "evasion": 12,
      "edef": 6,
      "heatcap": 4,
      "repcap": 3,
      "sensor_range": 5,
      "tech_attack": 0,
      "save": 10,
      "speed": 5,
      "sp": 5
    },
    "traits": [
      {
        "name": "Impalement Arts",
        "description": "Aux and Main melee weapons installed on the Savant without the Thrown tag gain Thrown 3, while those with the Thrown property gain +3 Range on Thrown attacks. The Savant's Thrown attacks ignore cover granted by its target's allies.",
        "synergies": [
          {
            "locations": [
              "weapon"
            ],
            "weapon_types": [
              "Melee"
            ],
            "weapon_sizes": [
              "any"
            ],
            "detail": "Aux and Main weapons without the Thrown tag gain Thrown 3, while those that already had it gain +3 Range on Thrown attacks. The Savant's Thrown attacks ignore cover granted by its target's allies."
          }
        ]
      },
      {
        "name": "Eyebite",
        "description": "1/Scene, when an enemy within Range 3 would Overwatch the Savant, the Savant may make a melee attack against the attacker, throwing a hidden blade directly at their cockpit. If the Savant's attack lands, the enemy's attack fails entirely, completely negating all of the attack's effects and damage."
      }
    ],
    "core_system": {
      "name": "\"COVENANT\" Direct Service Engine",
      "description": "<i>Congratulations on your subscription to Lumiera Corporation's COVENANT Direct Service support system! An engineer has been assigned to your account and is on standby to provide personal support by blinking light weapons directly into your hands. Our system engineer is trained to ensure that you always have access to exactly what you need, right when you need it, as long as your subscription is maintained.</i>",
      "passive_name": "Divine Armory",
      "passive_effect": "At the start of each Scene, gain two Armory dice: 2d6, starting on random values, which are used to attack with the Divine Armory. All Armory Dice are lost at the end of each scene.<br/>1/Round when you target a character with a Thrown attack, you may open the Divine Armory to make an attack with it against the same target as a free action. This is the only way you may attack with the Divine Armory.",
      "active_name": "Seven Seals",
      "active_effect": "Gain an additional Armory Die starting on a value of your choice. Until the end of the scene, when you open the Divine Armory, you make two attacks with it instead of one.",
      "activation": "Protocol",
      "use": "Encounter",
      "integrated": ["mw_savant_integrated"]
    },
    "data_type": "frame",
    "image_url": ""
  },
  {
    "id": "lumico_paragon",
    "license_level": 2,
    "source": "LUMICO",
    "name": "PARAGON",
    "mechtype": ["Defender"],
    "y_pos": 22,
    "description": "IN PROGRESS",
    "mounts": ["Main/Aux", "Flex"],
    "stats": {
      "size": 2,
      "structure": 4,
      "stress": 4,
      "armor": 0,
      "hp": 9,
      "evasion": 6,
      "edef": 6,
      "heatcap": 6,
      "repcap": 5,
      "sensor_range": 10,
      "tech_attack": 0,
      "save": 10,
      "speed": 3,
      "sp": 6
    },
    "traits": [
      {
        "name": "Quest",
        "description": "If the Paragon has not activated its core power this scene, it may move an additional 2 spaces when it Boosts and its allies can use it for soft cover."
      },
      {
        "name": "Shining Armor",
        "description": "The Paragon can disrupt certain targeting systems through the Shining Armor reaction, which it can use 1/Round.",
        "actions": [
          {
            "activation": "Reaction",
            "name": "Shining Armor",
            "detail": "Redirect the attack or Lock On to the Paragon. You do not reduce the Bulwark die due to damage from attacks redirected in this way.",
            "trigger": "An adjacent allied character is targeted by a Seeking attack, an attack that targets multiple characters, or receives Lock On.",
            "frequency": "1/Round"
          }
        ]
      }
    ],
    "core_system": {
      "name": "\"PLATEMAIL\" Reactive Armor",
      "description": "Explosive reactive armor lines the outside of the Paragon's frame, covering it with hundreds of plates of metal containing rods of explosive material. When agitated by a heavy impact, these rods detonate and redirect some of the attack's force outward. The PLATEMAIL system improves upon this age-old technology by using an onboard printer to repair and recharge expended plates while deployed in an active combat scenario. Furthermore, if the situation demands, the armor plates can be jettisoned, sacrificing the Paragon's normal resilience for better agility and offensive flexibility.",
      "passive_name": "Platemail",
      "passive_effect": "Gain a Bulwark die, 1d6 beginning at 3. As long as you have the Bulwark die, you use its current value as your Armor, ignoring any other effects that might increase or decrease your Armor. Each time you take kinetic, energy, or explosive damage, including if the damage is reduced to 0 by your Armor, reduce the Bulwark die by 1, to a minimum of 1. Whenever you Overwatch or take the Shining Armor reaction, increase the Bulwark die by 1, to a maximum of 4.",
      "active_name": "Sword and Shield",
      "active_effect": "Sacrifice the Bulwark die to choose one of the following, which lasts until the end of the Scene:<ul><li><b>SWORD</b>: Your Armor is reduced to 0, but your Speed is increased by 3, your installed weapons gain +1 Threat, and you deal 1 bonus Kinetic damage when you land any weapon attack.</li><li><b>SHIELD</b>: You are permanently Slowed and you have +1 Difficulty on attacks made on your turn, but your Armor is increased to 4. Any attacks made against allied characters adjacent to you gain +1 Difficulty and deal 1 less damage to their target, reduced before resistances.</li></ul><br/>This ability is <b>Efficient</b> and will refund 1 Core Point at the end of any scene in which this ability was used.",
      "activation": "Quick"
    },
    "data_type": "frame"
  },
  {
    "id": "ice_icebreaker",
    "license_level": 2,
    "source": "ICE",
    "name": "ICEBREAKER",
    "mechtype": ["Balanced"],
    "y_pos": 15,
    "description": "What began as a personal project founded by Peter, ICEBREAKERS LLC, then PD&J, would begin to balloon in scale and in profit. While ASGARD and Lumiera Corporation had the benefit of an established company, PD&J had the strength of a true understanding of the needs and ethos of the Frontier Sector. Aided by their unusually friendly relationship with the OFSA and the Frontier’s factions of scrappers, PD&J would explode onto the market, hitting critical mass as a major mech manufacturer at a rate that was completely unexpected and left most other players in the region scrambling to catch up. While ASGARD had the fortune of existing establishment in the frontier and Lumico operated in a higher end market than what PD&J targeted, most other competitors struggled to become anything other than niche players in the region as PD&J expanded their reach. While they would eventually grow their mech lineup to include a number of specialized frames, none would ever sell better than their very first: the Icebreaker, a generalist mech that would come to rival the Everest model’s popularity, albeit only in the Frontier.",
    "mounts": ["Flex", "Heavy"],
    "stats": {
      "size": 1,
      "structure": 4,
      "stress": 4,
      "armor": 0,
      "hp": 10,
      "evasion": 8,
      "edef": 8,
      "heatcap": 8,
      "repcap": 4,
      "sensor_range": 10,
      "tech_attack": 0,
      "save": 10,
      "speed": 4,
      "sp": 6
    },
    "traits": [
      {
        "name": "Equilibrium",
        "description": "At the start of the Icebreaker's turn, if it is in the Danger Zone, it loses 1 Heat. Otherwise, it gains 1 Heat."
      },
      {
        "name": "Thermocycle",
        "description": "While the Icebreaker is in the Danger Zone, its Speed is increased by 1 and its Sensors are increased by 5."
      }
    ],
    "core_system": {
      "name": "Regenerative Thermal Engine",
      "description": "The Regenerative Thermal Engine installed on the Icebreaker is able to use a portion of the heat lost by through normal Mech operation to slowly charge its core battery. By saving this power for later, the Icebreaker is able to operate as though it was fresh out of the foundry.",
      "active_name": "New Frontier",
      "active_effect": "Reset your Overcharge counter. You must be in the Danger Zone to use this ability, and cannot use this ability outside of combat.",
      "activation": "Quick"
    },
    "data_type": "frame",
    "image_url": ""
  },
  {
    "id": "ice_greenhorn",
    "license_level": 2,
    "source": "ICE",
    "name": "GREENHORN",
    "mechtype": ["Defender", "Striker"],
    "y_pos": 15,
    "description": "<i>The following information details ICEBREAKER LLC. proprietary research. If you are not entitled to this information, do not continue or you may be in violation of trade law.</i><br/><br/>Metavault Research Result - Stabilized Prototype 004 <i>'GREENHORN'</i><br/><br/>I think that this prototype all but proves that the contents of the Metavaults aren't completely random, as was the popular theory, but in fact may connect to entirely different stable realities. What we are shown may seem to be effectively nonsense, but it's in fact several parallel independent realities (<i>\"Variants\"</i>) blending together rapidly. What the existence of these variants actually implies is up to interpretation, however. My peers have a number of theories ranging from the existence of a 'multiverse' to the idea of that our emotions generate these potential timelines dynamically. I believe that it's even more complex, based on my experiences during the Siege of Niflheim: there seem to be meta-beings on a different level than us that control not only our actions but the very nature of our existence simply through their imagination, and these realities are simply their fantasies. Regardless of the cause of these variants, using the same technology that was used by NULL and BAYHOUND to stabilize the connection to Terminus in the Eljuthnir drilling station, we can force the Metavault to temporarily stabilize, allowing us to peek into one variant for a short time. We copied the structure of the Greenhorn from the frozen Metavault and despite all expectations, I can confirm: it's a living plant with no technological components whatsoever. It's made of normal wood. This may very well be <i>literal magic</i> from a variant where that isn't a ridiculous thing to say.",
    "mounts": ["Heavy", "Main"],
    "stats": {
      "size": 2,
      "structure": 5,
      "stress": 0,
      "armor": 0,
      "hp": 10,
      "evasion": 9,
      "edef": 5,
      "heatcap": 0,
      "repcap": 6,
      "sensor_range": 0,
      "tech_attack": 0,
      "save": 10,
      "speed": 3,
      "sp": 6
    },
    "traits": [
      {
        "name": "Organic",
        "description": "The Greenhorn is made entirely of organic matter and possesses no computer controls natively. While systems can be adapted to use on it, it has the Biological tag, cannot take Tech Actions, and cannot install systems with the AI tag.<br/><br/><i>Characters with the Biological tag have Immunity to all tech actions (even beneficial ones) except Lock On and Scan, although they can be targeted by electronic systems such as drones and smart weapons. If a Biological character would take heat, they instead take an equivalent amount of energy damage. Since the Greenhorn cannot gain Heat, it cannot Overheat and has no Stress.</i>"
      },
      {
        "name": "Rampant Growth",
        "description": "At the start of its turn, the Greenhorn regains 1/2 of its total HP. If it takes energy damage or gains Burn, it does not regain HP at the start of its next turn."
      },
      {
        "name": "Springleaf",
        "description": "The GREENHORN deploys its deployables (including mines and drones) to any space within Range 5 and line of sight instead of the normal deployment range."
      },
      {
        "name": "Rootseek",
        "description": "The Greenhorn can Search for HIDDEN characters and mines in within Range 5. When it does, it uses Hull instead of Systems when making its check."
      }
    ],
    "core_system": {
      "name": "Verdant Canopy",
      "description": "It's alive, it grows. It can produce vines that connect to systems as though they were wires. It runs on water, sunlight, and and whatever you can use as fertilizer. Honestly, it's much easier to maintain than a traditional mech, in terms of the amount of resources you have to put into it, but it does require some botanical knowledge that, frankly, doesn't overlap well with the skill set of most mech pilots. We're drafting up a manual to help potential pilots understand what they need to do to keep their Greenhorn alive, but frankly, I don't know how popular it'll be, as a design. Between the extra maintenance and the... general dislike of all things paracausal, I think this is going to be a hard sell. At least it's never shown any signs of like... spontaneously developing a hostile consciousness. We have that on HORUS, at least.",
      "passive_name": "Leafcoat",
      "passive_effect": "The Greenhorn can alter its appearance during a Full Repair or rest to better match the flora of a battlefield, allowing it to blend in with the natural environment. The Greenhorn can Hide on a turn where it has not moved, even if it would not normally be able to, though it loses the Hidden status upon moving. In particularly barren environments, like deserts, tundras, or the interior of ships or buildings, this ability has no effect.",
      "active_name": "Ingrain",
      "active_effect": "The Greenhorn triggers a massive growth surge, rooting into the ground and locking itself in place. Until you end this effect as a Protocol:<ul><li>The Greenhorn is IMMOBILIZED but has Immunity to all forced movement.</li><li>The Greenhorn gains resistance to Explosive and Kinetic Damage.</li><li>If the Greenhorn is rooted to an organic surface, such as dirt or rock, RAMPANT GROWTH heals for 100% of the Greenhorn's total HP instead of its normal amount.</li><li>The range of SPRINGLEAF and ROOTSEEK increase to 10.</li></ul>",
      "activation": "Protocol"
    },
    "data_type": "frame",
    "image_url": ""
  },
  {
    "id": "ice_angel",
    "license_level": 2,
    "source": "ICE",
    "name": "ANGEL",
    "mechtype": ["Controller", "Support"],
    "y_pos": 15,
    "description": "<i>This thing is a variant of the Vessels that we used during the Siege of Niflheim to house Caliph and Luke's minds when they passed through Terminus. Apparently, the original designs were based on anomalous entities that were appearing within the Metavault, according to the notes that the designer left behind. I used to think that these things were horrific, but after some of the things I've seen in the Vault, I'm realizing that these half-organic 'divine machines' aren't even below the water's surface on this iceberg.<br/>Ha ha...<br/><br/>- Dr. Lavender Briggs</i>",
    "mounts": ["Main/Aux"],
    "stats": {
      "size": 2,
      "structure": 4,
      "stress": 4,
      "armor": 0,
      "hp": 8,
      "evasion": 7,
      "edef": 12,
      "heatcap": 8,
      "repcap": 2,
      "sensor_range": 20,
      "tech_attack": 1,
      "save": 11,
      "speed": 4,
      "sp": 7
    },
    "traits": [
      {
        "name": "Guilt",
        "description": "Whenever the Angel is hit by an Attack, the attacker gains 1 Heat. This trait does not affect Biological targets and does not cause Heat if the affected character would be destroyed."
      },
      {
        "name": "Reality Meltdown",
        "description": "NHPs on the Angel can cascade even if they normally would not. When making Cascade checks, the NHP will begin to Cascade on a roll of 5 or lower. If any NHP installed on the Angel is cascading, all other NHPs installed on it will begin to Cascade at the start of the Angel's next turn. While an NHP on the Angel is cascading, the pilot still takes a limited turn after all cascading NHPs have rolled: they take one Quick Action and their standard movement, and may take Free Actions as normal.<br/><br/>Furthermore, cascading NHPs on the Angel will behave abnormally, even by the standards of cascading NHPs. At the start of each of the Angel's turns, roll a d20 for each Cascading NHP, which determines how it will act:<br/><ul><li><i>1</i> : Do not roll for any other NHPs. This NHP takes total control over the Angel and begins to Cascade normally, falling under the GM's control. If the Cascading NHP is normally immune to Cascade, their Cascade ends immediately and they may choose to end the Cascade of all other NHPs installed on the Angel as well.</li><li><i>2-5</i> : This NHP acts erratically, taking one Quick Action under the GM's control, following normal Cascade behavior and generating 1 Heat on the Angel.</li><li><i>6-10</i> : This NHP panics, having seen something it cannot understand. It forcibly teleports the Angel 3 Spaces away from a character of the pilot's choice.</li><li><i>11-15</i> : This NHP attempts to reveal secrets from another reality to another Mech's pilot or NHPs. It makes a Fragment Signal Invade against a mech of the Pilot's choice, generating 2 Heat on the Angel in the process.</li><li><i>16-20</i> : This NHP acts with clarity, taking one Quick Action under the player's control. If the pilot is the NHP that makes this roll, the limited turn they would normally take while NHPs are cascading is replaced by a normal full turn instead.</li></ul>"
      }
    ],
    "core_system": {
      "name": "Soulsync",
      "description": "<i>\"The longer someone pilots this thing, the more the delusions start to set in. Make sure to take <u>long</u> breaks. Don't stay in it too long. If the pilot says that damage to the Angel is hurting them, <u>get them out of it immediately.</u><br/><br/>Use any means necessary.\"</i>",
      "passive_name": "Transubstantiation",
      "passive_effect": "The Angel cannot be piloted normally. Instead, the pilot must transfer their consciousness into the mech, leaving their body catatonic at its current location. The pilot can transfer their consciousness between their body and the Angel as long as they remain in physical contact and the Angel is still functional.<br/><br/>While transferred to the Angel, the pilot is treated as an NHP, following all normal rules for NHPs, including the ability to Cascade. However, if the pilot is cascading, the GM never gains control of them: whenever they would take an action under the GM's control, the player takes that action instead.<br/><br/>The pilot's body can be killed while they are piloting the Angel. If this occurs, they become trapped as an NHP and attempts to perform a subjectivity override onto a clone will fail: they must install the <i>Severed Consciousness</i> system on any other frames they use.",
      "passive_actions": [
        {
          "activation": "Reaction",
          "name": "Conciousness Ejection",
          "trigger": "The Angel is destroyed.",
          "detail": "The Angel fires a small biocanister toward an empty space or friendly Mech within Range 15. If the target is a friendly mech, the Pilot installs themself as an NHP onto that mech until the end of combat. This can exceed the normal limit of NHPs for that mech. Otherwise, the canister falls on the ground as a size 1/2 object. The Pilot's consciousness can be transferred back to their body or to another Mech through physical contact with the biocanister.<br/><br/>If the biocanister is destroyed, the pilot is killed.",
          "frequency": "Unlimited"
        }
      ],
      "active_name": "Apotheosis",
      "active_effect": "All NHPs installed on the Angel, including the pilot, begin to cascade, temporarily collecting their minds into a single being. Until this cascade ends or combat ends, all NHPs installed on the Angel benefit from the protection normally offered to the pilot: whenever they would take an action under the GM's control, the player takes that action instead. Furthermore, all 1s rolled during a Reality Meltdown check become a 2 instead.",
      "activation": "Full Tech"
    },
    "data_type": "frame",
    "image_url": ""
  },
  {
    "id": "ice_catalyst",
    "license_level": 2,
    "source": "ICE",
    "name": "CATALYST",
    "mechtype": ["Controller"],
    "y_pos": 15,
    "description": "IN PROGRESS",
    "mounts": ["Heavy", "Main", "Main"],
    "stats": {
      "size": 2,
      "structure": 4,
      "stress": 4,
      "armor": 2,
      "hp": 10,
      "evasion": 8,
      "edef": 8,
      "heatcap": 6,
      "repcap": 4,
      "sensor_range": 5,
      "tech_attack": 0,
      "save": 10,
      "speed": 3,
      "sp": 7
    },
    "traits": [
      {
        "name": "Deconstruction",
        "description": "Whenever the Catalyst deals damage to terrain or an object, it deals an additional 5 AP Energy damage to its target. This can only affect a given object 1/Round, but the same piece of terrain can receive this damage multiple times in a single round."
      },
      {
        "name": "Heatproofing",
        "description": "The Catalyst's Armor also reduces Heat or Burn it receives that is not self-inflicted."
      },
      {
        "name": "Danger Close",
        "description": "The Catalyst has Immunity to damage originating from allied characters and objects deployed by allied characters."
      }
    ],
    "core_system": {
      "name": "Magma Chamber",
      "description": "IN PROGRESS",
      "active_name": "Eruption",
      "active_effect": "Gain an Criticality die until the end of the scene, 1d6 beginning at 4. While you have the Criticality die:<ul><li>You are always considered to be in the Danger Zone, regardless of how much Heat you have.</li><li>1/turn, you can reroll any attack you make. You must use the new result if you do.</li><li>You have Resistance to Kinetic, Energy, and Explosive damage.</li></ul>At the end of your turn, decrease the Criticality die by 1. If the Criticality die is already 1, the Catalyst Self-Destructs immediately, instead.<br/><br/>This ability is <b>Efficient</b> and will refund 1 Core Point at the end of any scene in which this ability was used. <br/>However, the starting value of the Criticality die decreases by 1 after each use of this ability, to a minimum of 1, only resetting after completing a Full Repair.",
      "activation": "Protocol"
    },
    "data_type": "frame",
    "image_url": ""
  },
  {
    "id": "ice_harbinger",
    "license_level": 2,
    "source": "ICE",
    "name": "HARBINGER",
    "mechtype": ["Striker"],
    "y_pos": 15,
    "description": "IN PROGRESS",
    "mounts": ["Flex", "Flex"],
    "stats": {
      "size": 0.5,
      "structure": 4,
      "stress": 4,
      "armor": 0,
      "hp": 6,
      "evasion": 7,
      "edef": 9,
      "heatcap": 7,
      "repcap": 3,
      "sensor_range": 7,
      "tech_attack": 1,
      "save": 10,
      "speed": 4,
      "sp": 7
    },
    "traits": [
      {
        "name": "Skulk",
        "description": "1/Round, if the Harbinger is Hidden or Invisible, it may teleport up to half its Speed as a free action.",
        "actions": [
          {
            "activation": "Free",
            "name": "Skulk",
            "detail": "Teleport a number of spaces up to half the Harbinger's speed. You may only take this action while Hidden or Invisible, and using this action does not remove Hidden.",
            "frequency": "1/Round"
          }
        ]
      },
      {
        "name": "Fade",
        "description": "At the end of its turn, if the Harbinger hasn't made any attacks or forced any saves, it becomes Invisible until it makes an attack or forces a save."
      },
      {
        "name": "Fragile",
        "description": "The Harbinger receives +1 difficulty on Hull checks and saves.",
        "synergies": [
          {
            "locations": ["hull", "skill_check"],
            "detail": "The Harbinger receives +1 difficulty on Hull checks and saves."
          }
        ]
      }

    ],
    "core_system": {
      "name": "Yukimochi's Haunting",
      "description": "<i>So, OMEN displays certain abilities that are a bit like an unshackled NHP. Reality warping powers. It's just much less powerful than an unshackled NHP. So... what is it, exactly? The shadow of a being from a different reality? A nascent NHP of the more traditional variety? A </i>real ghost<i>? R&D doesnt know. I certainly don't know.<br/><br/>This is the kind of stuff we keep finding in the metavault. Maybe we should stop.</i>",
      "passive_name": "Omen",
      "passive_effect": "The Harbinger plays host to a shadowy and protean entity known as OMEN that is bound to loyally serve the pilot. This grants the Harbinger the AI tag and counts against the number of AIs that the Harbinger may install. As OMEN isn't an AI at all, at least in the conventional sense of one, it cannot enter cascade.<br/><br/>As a quick action, the pilot can summon OMEN to the battlefield, forcing it to take a corporeal form temporarily.",
      "passive_actions": [
        {
          "activation": "Quick",
          "name": "Manifestation",
          "detail": "Choose one of the following forms for OMEN to take, summoning it to the battlefield. Each form has a unique appearance and summoning conditions. Once OMEN has been summoned, its form cannot be changed and it cannot be given control of the Harbinger until it is reabsorbed by the Harbinger as a quick action.<br/><br/><ul><li><b>WRAITH</b>: Choose a location within Burst 15. OMEN is summoned to that location in the form of a Raven (SIZE 1/2, Tags: DEPLOYABLE, IMMUNITY to all damage and effects). The area within Burst 5 of OMEN is considered to be within your Sensors. As a Protocol, you can move OMEN to any space within Sensors.</li><li><b>GRIM</b>: OMEN is summoned to that location in the form of a Hound (SIZE 1, Tags: DEPLOYABLE, IMMUNITY to all damage and effects). Any character adjacent to OMEN is considered to be within the Threat of your weapons for the purpose of Overwatch, regardless of their actual distance from you. As a Protocol, you can move OMEN up to 4 Spaces.</li><li><b>SHADE</b>: OMEN is summoned as a shadow that moves across and underneath the Harbinger, rendering it slightly intangible. While OMEN remains summoned, you have Resistance to damage from effects that require a Save and when you succeed on a Save to reduce the damage from an effect, you take no damage from that effect. Furthermore, you may use the Harbinger's SKULK action even if you aren't Invisible or Hidden.</li></ul><br/>",
          "frequency": "1/Round"
        },
        {
          "activation": "Quick",
          "name": "Exorcise",
          "detail": "Reabsorb OMEN into the Harbinger, ending its summoning."
        }
      ],
      "active_name": "Weirding",
      "active_effect": "OMEN is summoned to a location withing sensors in the form of a looming, beastly figure known as a HAUNT. While deployed in this way, OMEN takes its own set of actions on your turn, including a standard movement. You may summon this form of OMEN even if it is already summoned, without needing to reabsorb it first, changing it to this now form immediately at its current location. However, as long as OMEN is summoned in this way it saps the strength of the Harbinger. The Harbinger is Slowed, Exposed, does not benefit from its FADE trait, and has limited actions: it can still take its standard movement and free actions as normal, but it cannot Overcharge, may only take one quick action, and cannot take full actions. If the Harbinger Braces while in this state, it is Stunned during its next turn.",
      "deployables": [
        {
          "name": "HAUNT",
          "type": "Drone",
          "detail": "This form of OMEN takes a full turn simultaneously with the Harbinger's. It has the Biological tag, IMMUNITY to Jammed, and has a limited set of actions it can take: it can Barrage, Skirmish, Boost, Grapple, Ram, Self-Destruct, and Overwatch. It may only make attacks with the integrated CARVE weapon.<br/><br/>If OMEN is destroyed while in this form, it is forcefully banished back to the Harbinger, ending its summoning. For the rest of the scene, the Harbinger cannot use the MANIFESTATION action.",
          "activation": "Full",
          "size": 2,
          "evasion": 8,
          "edef": 14,
          "speed": 6,
          "armor": 2,
          "save": 12,
          "sensor_range": 5,
          "hp": "15 + {grit}"
        }
      ],
      "integrated": ["mw_harbinger_integrated"],
      "activation": "Full"
    },
    "data_type": "frame",
    "image_url": ""
  },
  {
    "id": "ind_slowpoke",
    "license_level": 2,
    "source": "IND",
    "name": "SLOWPOKE",
    "mechtype": ["Artillery"],
    "y_pos": 15,
    "description": "<i>Independent frames are not available as a part of any license and are only accessible as Exotic Gear.</i><br>Sam \"Poke\" Rodriguez never accepted half measures. As a member of ASGARD's Engineering Research department, he was largely focused on packing the most bang into the smallest frame possible. Though his designs never saw the open market after ASGARD's collapse as a major force in the Outer Arm Frontier sector, Poke went on to refine his designs, ensuring that they would be maximally functional in actual combat. He didn't have a choice after all: he either made his designs work or died trying to use them.",
    "mounts": ["Heavy", "Aux/Aux"],
    "stats": {
      "size": 2,
      "structure": 4,
      "stress": 4,
      "armor": 2,
      "hp": 10,
      "evasion": 6,
      "edef": 8,
      "heatcap": 4,
      "repcap": 4,
      "sensor_range": 10,
      "tech_attack": 0,
      "save": 10,
      "speed": 3,
      "sp": 5
    },
    "traits": [
      {
        "name": "Super Stabilizers",
        "description": "The Slowpoke cannot be pushed, pulled, or knocked Prone by other characters."
      },
      {
        "name": "Shockwave Disruption",
        "description": "1/Round, when the Slowpoke deals Explosive damage to a Mech, they also take 2 Heat."
      },
      {
        "name": "Weak Computer",
        "description": "The Slowpoke receives +1 Difficulty on all SYSTEM saves and checks.",
        "synergies": [
          {
            "locations": ["systems"],
            "detail": "The Slowpoke receives +1 Difficulty on all SYSTEM saves and checks."
          }
        ]
      }
    ],
    "core_system": {
      "name": "ASG-R44 \"Pneuma\" Howitzer and Feed System",
      "description": "The \"Pnuema\" Howitzer is an outsized weapon designed for use on the railways of frontier planets to defend them from bombardment from low-altitude spacecraft. Its raw power is enough to launch a round into orbit, albeit with greatly reduced stopping power, and more than enough to heavily damage any spacecraft within the atmosphere. It was, however, never designed for use on mechs, relying on the incredible mass of a full railway train (with stabilizers) to mitigate the weapon's earth-shattering recoil. Poke viewed this physical limitation not as a concept-killing impossibility, but as a challenge.",
      "passive_name": "Quickdraw",
      "passive_actions": [
        {
          "activation": "Quick Tech",
          "name": "Quickdraw",
          "detail": "Roll 1d6. On a roll of 6, all of your Loading weapons are immediately reloaded. Otherwise, you are Jammed until the end of your turn.<br/>You may also activate this system as a Protocol. This action may not be taken as a free action for any reason, excluding through its own effect."
        }
      ],
      "active_name": "High Noon",
      "active_effect": "Until the end of combat, whenever you attack with a ranged Loading weapon, roll 1d6. On a 6, the weapon reloads itself immediately.",
      "activation": "Protocol",
      "use": "Encounter",
      "integrated": ["mw_poke_integrated"]
    },
    "data_type": "frame",
    "image_url": "https://lh4.googleusercontent.com/LMT0-KbjJ0h9U8h00r-lGf9QLWyzhkMlBz4A2Z8eO7NNrt4wKgsONqIkfd88bIyLpJM=w2400"
  },
  {
    "id": "ind_bayhound",
    "license_level": 2,
    "source": "IND",
    "name": "BAYHOUND",
    "mechtype": ["Striker"],
    "y_pos": 30,
    "description": "<i>Independent frames are not available as a part of any license and are only accessible as Exotic Gear.</i><br>\"Bayhound\" Rikishi was an orphan, by its literal meaning, for longer than he could reasonably remember, but he never felt at a loss for family. He was taken in at a young age by the venerable scrapper \"Junk Dog\" Joe, founder of the Junkyard Dogs, alongside another young man, \"Killer Dog\" X, who alongside the rest of the scrapper crew, offered him more than enough family for his entire youth. Intent to not be upstaged by his more level-headed adoptive older brother, Rikishi developed a mech that was a brash and loud as him. Never one to rest on his laurels, Rikishi still continually tweaks his self-made Sonic Burst Driver, ever aspiring to reach a legendary status that would secure both his name and the Junkyard Dogs' in history.",
    "mounts": ["Heavy", "Main", "Main"],
    "stats": {
      "size": 1,
      "structure": 4,
      "stress": 4,
      "armor": 1,
      "hp": 6,
      "evasion": 8,
      "edef": 8,
      "heatcap": 5,
      "repcap": 6,
      "sensor_range": 5,
      "tech_attack": -1,
      "save": 10,
      "speed": 4,
      "sp": 5
    },
    "traits": [
      {
        "name": "Pulse Disruption Field",
        "description": "1/scene, when the Bayhound would take Kinetic or Explosive damage, it may gain Immunity to Kinetic and Explosive damage caused by the triggering action."
      },
      {
        "name": "Houndhunt",
        "description": "1/round, when a character becomes Shredded, the Bayhound may move and attack them with the Sonic Burst Driver.",
        "actions": [
          {
            "activation": "Reaction",
            "name": "Houndhunt",
            "trigger": "A character becomes Shredded.",
            "detail": "Move up to 3 spaces, then you may make an attack with the Sonic Burst Driver in its HOWL profile. The movement ignores engagement and doesn't provoke reactions, and the attack must target the character that triggered this reaction.",
            "frequency": "1/Round"
          }
        ]
      },
      {
        "name": "Exposed Reactor",
        "description": "The Bayhound has +1 Difficulty on Engineering checks and saves.",
        "synergies": [
          {
            "locations": ["engineering", "skill checks"],
            "detail": "The Bayhound has +1 Difficulty on Engineering checks and saves."
          }
        ]
      }
    ],
    "core_system": {
      "name": "Sonic Burst Driver",
      "description": "Rikishi's signature weapon, the Sonic Burst Driver, launches high frequency shockwaves from a set of purpose built speakers to damage hostile mechs by literally vibrating them apart with concussive force. A secondary set of high power speakers, the so-called \"Deadsteel Amplifiers\", dramatically boost the amplitude of the weapon's shockwaves, but cannot be used for long before the mech they're mounted on starts to literally fall to pieces from the intense vibrations.",
      "active_name": "Deadsteel Amplifiers",
      "active_effect": "Until the end of combat, the Sonic Burst Driver deals 3 bonus Energy damage on hit and Shreds any target hit until the end of the turn.",
      "activation": "Quick",
      "use": "Encounter",
      "integrated": ["mw_bayhound_integrated"]
    },
    "data_type": "frame",
    "image_url": "https://lh6.googleusercontent.com/6bP_qlii2xNgpKgSoly3Nx4yX-8FqzIg97AQYCQx1vVZKbv4RPRZimfz4-wZAJNaeMs=w2400"
  },
  {
    "id": "ind_dogma",
    "license_level": 2,
    "source": "IND",
    "name": "DOGMA",
    "mechtype": ["Defender", "Striker"],
    "y_pos": 15,
    "description": "<i>Independent frames are not available as a part of any license and are only accessible as Exotic Gear.</i><br>Markus \"Dogma\" Brynjar could not have been more different than his father. Though both of them worked for ASGARD, Hakon \"Odin\" Brynjar had experienced true horror in his life and had chosen a path of isolation to insulate himself from tragedy. Hakon's ability to make hard decisions in times of stress made him a valuable asset to the ASGARD company-as a leader who could be ensured to get results, no matter the situation. Markus too had experienced the horrors of corporate war, of massacres committed by criminal gangs, and of deaths brought about by the sheer hostility of the Outer Arm Frontier Sector. Tragedy, however, hardened his resolve to forgive those who hated him and to protect anyone he perceived to have even a flicker of innocence. To that end, he built this mech.",
    "mounts": ["Main"],
    "stats": {
      "size": 1,
      "structure": 4,
      "stress": 4,
      "armor": 0,
      "hp": 12,
      "evasion": 10,
      "edef": 8,
      "heatcap": 6,
      "repcap": 6,
      "sensor_range": 3,
      "tech_attack": 0,
      "save": 10,
      "speed": 6,
      "sp": 5
    },
    "traits": [
      {
        "name": "Intercession",
        "description": "1/round, the Dogma may take attacks in place of its allies.",
        "actions": [
          {
            "activation": "Reaction",
            "name": "Intercession",
            "trigger": "An allied character within Range 5 of you is hit by an attack, and you are not Immobilized or Slowed.",
            "detail": "Move to a space adjacent to the targeted character, and you are hit by the attack, instead. Then, you may make a melee attack against the triggering unit, if you are in range.",
            "frequency": "1/Round"
          }
        ]
      },
      {
        "name": "Righteous Indignation",
        "description": "1/turn, when an allied Mech is destroyed, the Dogma immediately takes a turn after this one. This does not count as a friendly or hostile activation. During that turn, the Dogma may only take one quick action, may not take full actions or protocols, and the Dogma gains <i>Avenging Wrath</i> during that turn.<br/>While affected by <i>Avenging Wrath</i>, the Dogma:<ul><li>Ignores the Fiery Revolving Sword's normal restrictions on attacks.</li><li>May Boost 1/turn as a free action.</li><li>Has immunity to Immobilized, Slowed, and Jammed.</li><li>Reduces all damage it takes to 1.</li>"
      }
    ],
    "core_system": {
      "name": "\"Absolution\" Offensive Thermal Routing System",
      "description": "<i>Defend the weak and the fatherless; uphold the cause of the poor and the oppressed. Rescue the weak and the needy; deliver them from the hand of the wicked.</i>",
      "active_name": "Abyssus Abyssum Invocat",
      "active_effect": "Immediately take a second turn after this one. This extra turn does not count as a friendly or hostile activation. During this turn and your next, you gain the effects of <i>Avenging Wrath</i> and may only attack with the Fiery Revolving Sword. If you Barrage, you may attack with the Fiery Revolving Sword twice. At the end of your second turn, you are Stunned until the end of your next turn, and then you are Impaired and Slowed until the end of your subsequent turn.",
      "activation": "Protocol",
      "integrated": ["mw_dogma_integrated"]
    },
    "data_type": "frame",
    "image_url": "https://lh4.googleusercontent.com/EOf3N8Uq5_BK4vho_veCBN3lAQ4_Cj_W0jwT-SS3NM_8brJb01FrVkeBxdsILnNLvoE=w2400"
  }
]
