[
    {
        "id": "ASG",
        "name": "ASGARD MINING AND MANUFACTURING",
        "light": "#92d6fc",
        "dark": "#5594fa",
        "description": "ASGARD Mining and Manufacturing (ASG) is not a name most commonly associated with mech design, but rather with large scale planetary exploitation and the production of emplaced defense systems for fortifications both military and civilian. Nonetheless, as a company built from the ground up to fuel the war machine, it was inevitable that ASGARD would eventually begin to develop mech frames of their own. Had it not been for the Niflheim disaster, wherein the company mysteriously abandoned all of their operations on the frozen planet, ASGARD might have been a much larger player on the intergalatic scale. As it stands however, they remain a niche company, teetering on the edge of oblivion, desperate to regain their former standing.<br/><br/>Nonetheless, few companies have shown any interest in the largely barren Outer Arm Frontier Sector, and even after ASGARD's partial collapse, a large number of their former employees remain in the sector, securing their reputation as a reliable and friendly manufacturer. In this frontier region, their mechs enjoy a deal of popularity, even if they haven't caught on elsewhere. From their position in the frontier, ASGARD has begun their attempts to rebuild.",
        "quote": "<i>Frost and Fortune</i>",
        "logo_url": "https://drive.google.com/uc?export=download&id=1zuNrOOhrUdelSxTmQ5i8bnl38FTFhMN8"
    },
    {
        "id": "LUMICO",
        "name": "LUMIERA CORPORATION",
        "light": "#ed6fc7",
        "dark": "#eb34b4",
        "description": "The Lumiera Corporation (Lumico) is not a manufacturer for the common man. Lumico hands out their licenses on a case by case basis based on direct applications that must all pass a hand review by a board of at least 4 of Lumico's \"Talent Experts.\" After all, Lumico doesn't see their mechs as tools for militaries, but instead for individuals: heroes and villains who, regardless of what they accomplish, will be remembered for decades, if not centuries, with their Lumico mech right behind them. Lumico wants its name to be synonymous with luxury and effectiveness, and the immense effort that they put into everything they produce has fostered that reputation.<br/><br/>Lumico seeks perfection in all things, according to their own standards, and as such, their standards can seem irrational or random, particularly to outsiders who have no insight into Lumico's decision making process. Active military generals with a hundred battles to their name might be rejected, while unknown pilots just beginning their journey may find themselves with a fast track acceptance to Lumico's licenses. Whatever their process, Lumico's judgment rarely seems to falter, as almost all of their chosen candidates achieve fame or infamy in short order. While many suggest that the unprecidented success of Lumico is a testiment to their absurdly low tolerances when producing their mechs, others suggest that they may have some occult way of detecting the major players of the future before they have even begun to rise.",
        "quote": "<i>Accept Nothing Less</i>",
        "logo_url": "https://drive.google.com/uc?export=download&id=1Jp5hGYj3o_Rw-8gW45OO4Ek_LrL7L556"
    },
    {
        "id": "IND",
        "name": "INDEPENDENT",
        "light": "#556B2F",
        "dark": "#556B2F",
        "description": "Independent frames represent the ingenuity of single individuals: these are mech chassis designed by lone pilots seeking to establish a unique identity and reputation rather than full companies. As such, no broad support surrounds these mech designs and they largely exist outside of the traditional licensing environment. In order to use these frames, an enthusiastic Lancer would need to seek out the designers directly and retrieve the plans from them, hopefully without the need for much force.",
        "quote": ""
    }
]
