[
  {
    "id": "ms_tyr_battlesuit",
    "name": "TYR Battlesuit",
    "type": "Armor",
    "description": "This battlesuit may not be taken as normal pilot gear and is instead granted by the ASG Fenrir chassis, which details its functionality.",
    "bonuses": [
      {
        "id": "pilot_hp",
        "val": "5"
      },
      {
        "id": "pilot_armor",
        "val": 2
      },
      {
        "id": "pilot_evasion",
        "val": 11,
        "replace": true
      },
      {
        "id": "pilot_edef",
        "val": 11,
        "replace": true
      },
      {
        "id": "pilot_speed",
        "val": 6,
        "replace": true
      }
    ]
  },
  {
    "id": "pg_quietus_revolver",
    "name": "QUIETUS REVOLVER NO. 27",
    "type": "Weapon",
    "description": "Eventually, the design for this weapon would be reworked into Lumiera Corporation's Breathtaker Revolver, ending the production of Quietus Revolvers altogether. While no more than 1,500 total were made, this individual instance's unusually low serial number makes it exceptionally desireable even among its peers.",
    "effect": "Energy damage dealt by this weapon is Armor-Piercing.",
    "tags": [
      {
        "id": "tg_exotic"
      },
      {
        "id": "tg_sidearm"
      },
      {
        "id": "tg_luxury",
        "val": 2
      },
      {
        "id": "tg_oneofakind"
      }
    ],
    "range": [
      {
        "type": "range",
        "val": 3
      }
    ],
    "damage": [
      {
        "type": "Kinetic",
        "val": "1d3"
      },
      {
        "type": "Energy",
        "val": "1"
      }
    ]
  },
  {
    "id": "pg_parasite_weed",
    "name": "Parasite Weed",
    "type": "Gear",
    "effect": "This gear has no effect unless you have the <u>SA 2-401 'PARASITE WEED' (Mech Stabilizer)</u> system installed on your active mech.<br/>When you choose this pilot gear during a Full Repair, choose one Skill Trigger and one Mech Skill. As long is your Mech isn't destroyed:<ul><li>You gain +1 Accuracy on checks with the chosen skill trigger.</li><li>As long as you are directly piloting your mech, you gain +1 Accuracy on Saves with the chosen Mech Skill. NHPs piloting your Mech never receive this bonus.</li><li>The Pilot regenerates 1 HP at the start of each of their turns, as long as they aren't Down and Out.</li><li>If you die, the Parasite Vine will revive you after your party takes a Rest. The first time you are revived this way, you gain the HERBACEATIC FUSION Quirk detailed below, which becomes more extreme with each revival.</li></ul><br/><b>Quirk: Herbaceatic Fusion</b><br/>Each time you are revived by the Parasite Weed, this Quirk advances to the next stage on this list, beginning at Stage 1 when you are first revived.<ol><li>After revival, any physical damage you received was patched by Parasite Weed, missing or heavily damaged parts of your body turning to plantlife. In the case that your body was not substantially visibly damaged, such as if you were killed by poison or radiation, the weed may have consumed and replaced limbs to revive you.</li><li>More of your body is replaced by plant matter. The weed begins to develop a simple personality, able to speak single words into your mind.</li><li>The majority of your body is turned to plant matter, and you find that you no longer need to eat or sleep. The weed becomes more intelligent, speaking longer phrases and having more coherent desires that may or may not align with your own.</li><li>Little if any of your original body remains. Occasionally, the weed is able to commandeer your body to speak for itself.</li><li>Fully converted to flora-fauna by your repeated deaths and resurrections, the line between your thoughts and the weed's is heavily blurred. Occasionally, you may go into a temporary trance, wherein the weed is in complete control and you are unaward of what is happening.</ol>",
    "description": "<i>ARTIFACT STABILIZATION LOG<br/>RECORD: 2-401a<br/><br/>WE'VE DONE PLENTY OF TESTS.<br/>EVEN WHEN THE PILOT USED THE WEED FOR MONTHS, IT NEVER AFFECTED THEM PSYCHOLOGICALLY.<br/>IT ACTED AS A SYMBIOTE, WEAVING INTO THEIR NERVOUS AND MUSCULAR SYSTEMS, ENHANCING THOUGHTS AND REACTION SPEED, BOOSTING PHYSICAL PROWESS.<br/>THE <u>ONLY</u> TIME THERE WERE ISSUES WERE WHEN THE PILOT WAS KIA, SO...<br/>JUST. DON'T. DIE.</i><br/><br/>I THOUGHT THAT WAS OBVIOUS.",
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_gear"
      }
    ]
  },
  {
    "id": "pg_cookies_sandwich",
    "name": "Cookie's Lunchbox",
    "type": "Gear",
    "description": "A lunchbox containing three sandwiches, the recipes for which are printed on the inside of the lid. Expend a charge to eat a sandwich and gain its effects, or to give it to an ally to grant them the effect. Each sandwich can only be eaten once per full repair, and you can re-prepare sandwiches during a full repair. Once all charges have been expended, you may still eat the third sandwich, but it will have no special effects.",
    "tags": [
      {
        "id": "tg_exotic"
      },
      {
        "id": "tg_limited",
        "val": 2
      },
      {
        "id": "tg_oneofakind"
      }
    ],
    "actions": [
      {
        "name": "Eat Mom's Homemade Pepper Pastrami",
        "activation": "Full",
        "detail": "You are filled with generational wisdom and may ask the GM how a course of action is likely to end, to which the GM must answer honestly with “very well,” “well,” “bad,” or “very bad.”",
        "pilot": true
      },
      {
        "name": "Eat Hot and Spicy Horseradish Roast Beef",
        "activation": "Full",
        "detail": "You are fueled on by the bitter spice and get +10 on one skill check not associated with a Downtime action. This only lasts for a few minutes immediately after eating the sandwich.",
        "pilot": true
      },
      {
        "name": "Eat Old-Fashioned Corned Beef Reuben",
        "activation": "Full",
        "detail": "The flavors of this sandwich will keep one's spirits high, ensuring that the next time you make a Down and Out roll, the result will be a 6.",
        "pilot": true
      }
    ]
  }
]
