[
  {
    "id": "asg_big_missile",
    "name": "BDM",
    "type": "System",
    "sp": 3,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_limited",
        "val": "2"
      }
    ],
    "source": "ASG",
    "license": "NIDHOGG",
    "license_level": 3,
    "effect": "The missiles provided by this system were not designed for use on a mech: they are launched from the exterior of the chassis and may be targeted as a deployable that shares a space with you while they are readying or primed. A missile shares your evasion, is immune to tech actions and has (10 + twice your Hull) HP, resistance to Kinetic and Energy damage, and immunity to Burn. If the missile is reduced to 0 HP, it detonates: you lose one charge and the missile deals damage as though you were the target of the strike.",
    "actions": [
      {
        "activation": "Quick",
        "name": "Prime Missile",
        "detail": "You prepare for a ballistic strike, warping a missile from remote storage onto a launch rack on your mech. When you begin readying a missile, you are Immobilized, and the missile becomes a valid target for attacks. These effects last until you cancel the launch as a free action or launch the missile. At the start of your next turn, you fully prime the missile, gaining access to the BALLISTIC LAUNCH action. You may not take this action more than 1/Turn."
      },
      {
        "activation": "Full",
        "name": "Ballistic Launch",
        "detail": "You may only use this action after a missile is fully primed and cannot take this action while Jammed. Expend a charge to launch a missile at a target affected by Lock On. Lock On is consumed, and the target and all characters and objects in a Burst 3 area around them take 2d6+6 AP Explosive damage, which ignores Resistance and Immunity to Explosive damage. All characters besides the primary target must attempt a Hull Save or be Impaired until the start of their next turn. The primary target is knocked Prone and Impaired until the end of their next turn, without the ability to make a Save."
      }
    ],
    "description": "An ASGARD Class-3 BDM (which stands for \"Ballistic Dispersion Missile\" and not \"Big Damn Missile\", contrary to what many believe), is actually a fairly small missile in the context it was originally designed for: space-based ship to ship combat. However, as large scale naval combat became less and less common, the commercial demand for batteries of missiles began to shrink. Rather than limit their manufacturing, ASGARD instead developed a novel orbital warehousing system which allows these missile to be deployed to ground vehicles and mechs via blinkspace teleportation. Simply load a friendly satellite with a few BDMs, then watch as your enemies flee in terror at the sight of an Everest carrying a 5 meter long missile on its back... at least until they realize that they can shoot at it."
  },
  {
    "id": "asg_dreadnought_engine",
    "name": "Dreadnought Thermal Engine",
    "type": "System",
    "sp": 1,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_danger_zone"
      }
    ],
    "source": "ASG",
    "license": "NIDHOGG",
    "license_level": 2,
    "effect": "Your speed is reduced by 3 minus your size, rounded up, as long as this system is installed. While you are in the Danger Zone, you may take 2 Heat to Boost as a free action 1/round. If you do, all adjacent allied Characters may move the same number of Spaces as a reaction.",
    "description": "A thermal engine used to provide some extra power for Dreadnoughts, <i>slightly</i> miniaturized."
  },
  {
    "id": "asg_ai_valkyrie",
    "type": "AI",
    "name": "VALKYRIE-Class NHP",
    "sp": 3,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_ai"
      },
      {
        "id": "tg_heat_self",
        "val": 2
      },
      {
        "id": "tg_aura",
        "val": 4
      }
    ],
    "source": "ASG",
    "license": "NIDHOGG",
    "license_level": 3,
    "effect": "Your Mech gains the AI tag. While this system's Aura is active, you are Immobilized, your Evasion is reduced to 5, your EDef is incresed to 10 if it is lower, and you and all allied Mechs within this system's Aura gain +1 Accuracy and +5 Range when attacking with Cannon, Launcher, or Ordnance weapons. On a critical hit with an affected weapon, the target takes 1d6 bonus Explosive damage.",
    "description": "VALKYRIE has been ASGARD's NHP of choice for siege platforms almost since the founding of the company. VALKYRIE-class NHPs are generally friendly and just a bit too enthusiastic about blowing things up, which makes them a perfect fit for ASGARD's preferred method of operation."
  },
  {
    "id": "asg_lockdown",
    "name": "Asgard Lockdown System",
    "type": "Drone",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_shield"
      },
      {
        "id": "tg_limited",
        "val": 3
      }
    ],
    "source": "ASG",
    "license": "NIDHOGG",
    "license_level": 1,
    "effect": "You may deploy a Lockdown System to a free adjacent space. Deploying the Lockdown System does not consume charges, and a new Lockdown System may be deployed without penalty if an active one is destroyed. Only one Lockdown System may be deployed at a time. While the Lockdown System is deployed, you gain the ACTIVE DEFENSE reaction.",
    "deployables": [
      {
        "type": "Drone",
        "name": "Lockdown System",
        "activation": "Quick",
        "detail": "This Drone has Resistance to explosive damage. Gain the Active Defense reaction.",
        "size": 0.5,
        "hp": "10",
        "actions": [
          {
            "name": "Active Defense",
            "activation": "Reaction",
            "trigger": "A Mech makes an attack with a Launcher, Cannon, Smart, or Seeking weapon that would pass through a Burst 1 area around the Lockdown System before reaching the targeted Mech or space.",
            "frequency": "1/Round",
            "detail": "Expend a charge to prevent the attack entirely. The action used to make the attack is still lost."
          }
        ]
      }
    ],
    "description": "The ASGARD Lockdown System provides hard kill protection in an area by releasing targeted electro-kinetic pulses to disrupt the targeting or disable the payload of many kinds of munitions. It won't stop bullets, but it can stop most anything else."
  },
  {
    "id": "asg_ai_fenrisii",
    "name": "Mark II FENRISWOLF-Class NHP",
    "type": "AI",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_ai"
      }
    ],
    "source": "ASG",
    "license": "FENRIR",
    "license_level": 3,
    "actions": [
      {
        "activation": "Quick",
        "name": "Jaws of the Wolf",
        "detail": "Scoop up an adjacent, willing, and friendly non-Mech character into your mech's arms. While held, the target gains hard cover while still being able to take actions as normal, though they can only FIGHT with ranged weapons. Furthermore, any time the held target would take damage, you may redirect that damage to your mech. The held character can jump free as a part of their movement."
      },
      {
        "activation": "Free",
        "name": "Down the River Ván",
        "detail": "Throw a held character up to Range 5. The thrown character can choose to enter a friendly mech or Jockey a hostile mech that they would pass through or adjacent to during the throw as a Reaction. They receive +1 Accuracy and the target receives +1 Difficulty if they attempt to Jockey. While being thrown, the character does not provoke reactions."
      }
    ],
    "effect": "Your mech gains the AI tag and the Jaws of the Wolf and Down the River Ván actions.",
    "description": "By separating the Fenriswolf NHP from the Fenrir's architecture, it gained increased awareness of the fragility of the pilots it interacted with. It did retain its reckless and aggressive nature, however, leading to the invention of some <i>unorthodox</i> techniques."
  },
  {
    "id": "asg_beasthunter_knife",
    "name": "Beasthunter Tactical Knife",
    "type": "System",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "ASG",
    "license": "FENRIR",
    "license_level": 1,
    "actions": [
      {
        "activation": "Free",
        "name": "Beasthunter",
        "frequency": "1/Round",
        "detail": "You may only take this action immediately after you make a melee attack against a target you are grappling. Make a melee weapon attack with the following profile:<br>Aux Melee, Reliable 1<br>Range 1, 1d3 Kinetic Damage.<br/>If your target is Biological or a larger Size than you, you may immediately make a second attack with this weapon against the same target."
      }
    ],
    "description": "The Beasthunter™ Tactical Knife was designed specifically as a backup weapon, to be used in close combat when all other options have failed. However, as its name suggests, it was often used by pilots hunting down large prey in the depths of space, and modifications were made to better enable this particular use."
  },
  {
    "id": "asg_reverse_beartrap",
    "name": "REVERSE BEARTRAP",
    "type": "System",
    "sp": 4,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_limited",
        "val": 1
      }
    ],
    "source": "ASG",
    "license": "FENRIR",
    "license_level": 2,
    "actions": [
      {
        "activation": "Full",
        "name": "The Game",
        "detail": "Choose an adjacent Mech. The target must succeed at an Agility save or have a Reverse Beartrap attached to them. A charge is only expended if the device is attached successfully.<br>Once a Beartrap is attached to a target, it will explode at the end of their next turn, ripping open their cockpit and allowing the pilot to be targeted by systems and attacks directly at +2 Difficulty. Enemies with the Ultra template can destroy the Beartrap as a Full Action, removing it safely and preventing further Beartraps from being attached to them."
      }
    ],
    "description": "A horrific device that attempts to rip a mech's cockpit open, apparently originally designed for use on humans and scaled up for use on mechs. ASGARD public relations has disavowed its use."
  },
  {
    "id": "asg_disposable_heatsink",
    "name": "Disposable Heatsinks",
    "type": "System",
    "tags": [
      {
        "id": "tg_limited",
        "val": 6
      },
      {
        "id": "tg_unique"
      }
    ],
    "effect": "When this System is reduced to 0 charges, it is destroyed. You may spend 2 Repairs to restore all of this System's charges. If you do, it is also fixed if it was destroyed.",
    "actions": [
      {
        "activation": "Reaction",
        "name": "Shunt Heat",
        "trigger": "You take Heat from any source, including yourself.",
        "detail": "Expend any number of charges. The Heat you would receive is reduced by 1 for each charge expended.",
        "frequency": "1/turn"
      }
    ]
  },
  {
    "id": "asg_command_system",
    "name": "HEIMDALL Nanobot Command System",
    "type": "Tech",
    "sp": 4,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_aura",
        "val": 15
      },
      {
        "id": "tg_overshield"
      }
    ],
    "source": "ASG",
    "license": "JORMUNGANDR",
    "license_level": 3,
    "effect": "While this system is active, you are Immobilized, your Evasion is reduced to 5 if it is greater, and you project a field of nanomachines that can influence the battlefield. All Drones and Deployables of your choice within this System's Aura regain 5 HP at the start of each of your turns and gain resistance to all damage, Heat and Burn while this System is active. In addition, you gain access to this system's actions, which may only be used while this System's Aura is active.",
    "actions": [
      {
        "activation": "Quick Tech",
        "name": "Defend Order",
        "detail": "An allied Mech, Drone, or object within this System's Aura gains 5 Overshield. Drones and Deployables gain twice this amount."
      },
      {
        "activation": "Quick Tech",
        "name": "Warp Order",
        "frequency": "1/Round",
        "detail": "An allied Mech, Drone, or object within this System's Aura is teleported up to 5 spaces in any direction of your choice."
      },
      {
        "activation": "Quick Tech",
        "name": "Dissolve Order",
        "detail": "A Drone or object within this System's Aura takes 10 AP kinetic damage. Each object or Drone may only be targeted 1/round."
      }
    ],
    "deployables": [
      {
        "type": "Mine",
        "name": "Nanite Mine",
        "activation": "Quick Tech",
        "detail": "This Mine may be placed anywhere within this System's Aura. Only one Nanite mine may be deployed per round. All characters within a Burst 1 area must pass a Hull Save or take 1d3+3 Explosive damage. On a success, they take half damage."
      }
    ],
    "description": "The Heimdall command system hijacks a mech's computers to generate a large nanite field that can directly control a large fleet of drones. While the mech's defensive routines will be largely disabled, it will be able to secure a large area through its capabilities as a command post."
  },
  {
    "id": "asg_spare_drone_parts",
    "name": "XS-Series Drone Parts",
    "type": "System",
    "sp": 2,
    "source": "ASG",
    "license": "JORMUNGANDR",
    "license_level": 2,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "actions": [
      {
        "name": "XS5 Sentry Microgun",
        "activation": "Reaction",
        "trigger": "A character begins a turn or enters a space within Range 7 of one of your deployed Drones.",
        "detail": "Make a ranged attack with the chosen Drone against the triggering character. If the attack hits, it deals 6 Kinetic damage to the target. If the target has at least 1 Armor and isn't Shredded, they gain Resistance to this damage."
      },
      {
        "name": "XS18 Thermal Micromissiles",
        "activation": "Reaction",
        "trigger": "A character gains Heat or Burn within Range 10 of one of your deployed Drones.",
        "detail": "Make a Smart ranged attack with the chosen Drone with +1 Accuracy against the triggering character. If the attack hits, it deals 3 Explosive damage to the target and they also gain 2 Heat."
      },
      {
        "name": "XS31 Miniature Napalm Gun",
        "activation": "Reaction",
        "trigger": "A character begins a turn or enters a space within Range 3 of one of your deployed Drones.",
        "detail": "Make a Line 3 ranged attack with the chosen Drone against the triggering character. Each character hit by the attack takes 2 Burn."
      }
    ],
    "effect": "When you deploy a drone, it is deployed with a special integrated weapon with limited ammunition. When you use one of the Reactions granted by this system, you consume all of the ammunition on that Drone and cannot use it for this System's reactions unless you undeploy and redeploy it. All attacks made with this System gain your Grit as a bonus to the roll.",
    "description": "The XS-Series is a mass-produciton kit provided by ASGARD to allow clever engineers to add concealed weaponry to drones that would not normally provide fire support in the field. ASGARD pilots familiar with this system tend to exercize caution around all drones, no matter how innocuous they may seem."
  },
  {
    "id": "asg_bomb_bag",
    "name": "Explosives Satchel",
    "type": "System",
    "sp": 2,
    "source": "ASG",
    "license": "JORMUNGANDR",
    "license_level": 1,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_limited",
        "val": "2"
      }
    ],
    "effect": "Whenever you would expend a charge from a system with the Mine or Grenade tag, you may expend a charge from this system instead.",
    "description": "It's a heat-proof bag meant to store extra components to make explosives. It's not complex, but it certainly has merit."
  },
  {
    "id": "asg_r1_concussion",
    "name": "R1 Concussion Charges",
    "type": "Deployable",
    "sp": 2,
    "source": "ASG",
    "license": "JORMUNGANDR",
    "license_level": 1,
    "actions": [
      {
        "activation": "Quick",
        "name": "R1 Concussion Grenade",
        "range": [
          {
            "type": "Range",
            "val": 5
          },
          {
            "type": "Blast",
            "val": 1
          }
        ],
        "damage": [
          {
            "type": "Explosive",
            "val": "3"
          }
        ],
        "detail": "Throw a Concussion Grenade within Range 5. All characters within a Burst 1 area must pass a Hull save or take 3 Explosive damage and be Impaired until the end of their next turn. On a success, they are not Impaired."
      }
    ],
    "deployables": [
      {
        "type": "Mine",
        "name": "R1 Concussion Mine",
        "activation": "Quick",
        "detail": "All characters in a Burst 1 area must pass a Hull save or take 1d3+3 Explosive damage and be Impaired and Shredded until the end of their next turn. On a success, they are not Shredded and take a maximum of 3 damage."
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_grenade"
      },
      {
        "id": "tg_limited",
        "val": 3
      }
    ],
    "description": "These shockwave generating charges deal limited direct damage compared to conventional explosives, but they are capable of damaging computer systems through dense mech armor."
  },
  {
    "id": "asg_laser_scan_grenades",
    "name": "Full Spectrum Hunt/Kill System",
    "type": "Drone",
    "sp": 3,
    "source": "ASG",
    "license": "JORMUNGANDR",
    "license_level": 3,
    "actions": [
      {
        "activation": "Quick",
        "name": "UV Recon Grenade",
        "range": [
          {
            "type": "Range",
            "val": 5
          },
          {
            "type": "Blast",
            "val": 3
          }
        ],
        "detail": "Throw a UV Recon Grenade within Range 5. All characters in a Burst 3 Area must pass a Systems save or suffer the following effects until the end of their next turn:<ul><li>Tech actions may target affected characters even without line of sight.</li><li>Affected characters cannot Hide or benefit from Invisible.</li><li>Drone, Seeking and Nexus weapons gain +1 Accuracy against affected characters.</li></ul>Targets affected by Lock On automatically fail this save. If at least one target is affected by this grenade, you may deploy your IR Seeker Drone or move it up to 3 spaces as a free action."
      }
    ],
    "deployables": [
      {
        "type": "Drone",
        "name": "IR Seeker Drone",
        "activation": "Quick",
        "evasion": "10",
        "detail": "Deploying this drone does not consume one of this system's charges, and it may be deployed to any free, adjacent space. Only one IR Seeker Drone may be deployed at a time. If the drone is destroyed, you may expend a charge to immediately recall and repair it.",
        "edef": "10",
        "size": 0.5,
        "hp": "10",
        "actions": [
          {
            "name": "Hunt/Kill",
            "activation": "Free",
            "frequency": "1/Round",
            "detail": "Move this drone up to 3 spaces, then make a Smart ranged attack against an enemy Mech within range 3 of it with it, gaining your Grit as a bonus to the roll. On a hit, it deals 1d3 Energy damage. Against targets currently affected by a UV Recon Grenade, it deals an additional 3 Energy damage and applies Lock On on hit."
          }
        ]
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_grenade"
      },
      {
        "id": "tg_limited",
        "val": 4
      }
    ],
    "description": "This high-end recon system was designed by ASGARD's software team as a tactical breaching suite that could be used to locate and neutralize threats before they even had a chance to respond. While it has not yet been heavily field tested, ASGARD has high hopes that it will be widely adopted."
  },
  {
    "id": "asg_martial_doctrine_3",
    "name": "Martial Doctrine III",
    "type": "System",
    "sp": 3,
    "source": "ASG",
    "license": "DRAUGR",
    "license_level": 3,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "effect": "Gain increasing benefits based on the number of Martial Doctrine systems installed:<ul><li>1+: You may make Improvised Attacks as a quick action as long as you aren't Jammed.</li><li>2+: Your Improvised Attacks deal 1d6 bonus Kinetic damage on a critical hit.</li><li>3: Your Improvised Attacks count as attacks with Main Melee weapons.</li></ul>This effect is shared between all Martial Doctrine systems and only applies once.",
    "actions": [
      {
        "name": "Martial Stance: Core Ripper",
        "activation": "Protocol",
        "detail": "Gain 2 heat. Until the end of the turn, if you hit a target you are Grappling with an Improvised Attack, the target must attempt a Hull Save. If they fail, you treat that target as Exposed until the end of the turn. This can only target a character 1/Scene.<br/><i>Only one Martial Stance Protocol may be activated on a turn.</i>"
      },
      {
        "name": "Combo: Suplex",
        "activation": "Free",
        "detail": "Make a melee attack against a character you are Grappling that is the same Size as you or smaller. If the attack lands, they take 2d6 Kinetic damage, are knocked Prone, and are moved to the space opposite you from their current position. You are also knocked prone on a successful attack. You may only take this action immediately after dealing damage with an Improvised Attack.",
        "frequency": "1/Round"
      }
    ],
    "description": "The \"Martial Doctrine\" are a set of emergency subroutines that improve a mech's capabilities in the situation that it is forced into disarmed combat. Though they were distributed by ASGARD in three different releases, they were clearly intended to form a greater whole, as each version has hidden code that only activates in the presence of the others."
  },
  {
    "id": "asg_martial_doctrine_2",
    "name": "Martial Doctrine II",
    "type": "System",
    "sp": 3,
    "source": "ASG",
    "license": "DRAUGR",
    "license_level": 2,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "effect": "Gain increasing benefits based on the number of Martial Doctrine systems installed:<ul><li>1+: You may make Improvised Attacks as a quick action as long as you aren't Jammed.</li><li>2+: Your Improvised Attacks deal 1d6 bonus Kinetic damage on a critical hit.</li><li>3: Your Improvised Attacks count as attacks with Main Melee weapons.</li></ul>This effect is shared between all Martial Doctrine systems and only applies once.",
    "actions": [
      {
        "name": "Martial Stance: Brutalizer",
        "activation": "Protocol",
        "detail": "Gain 1 heat. Until the end of the turn, your Improvised Attacks gain Knockback 3. 1/Round, after inflicting Knockback as part of any Melee Attack, you may move an equal number of spaces towards the same target by the most direct route possible.<br/><i>Only one Martial Stance Protocol may be activated on a turn.</i>"
      },
      {
        "name": "Combo: Hullbreaker",
        "activation": "Free",
        "detail": "Make a melee attack against a target you damaged with an Improvised Attack this turn. On a success, you slam them into an object or Mech adjacent to them, dealing 3 Kinetic damage to both targets. Objects take 10 AP Kinetic damage instead. You may only take this action immediately after dealing damage with an Improvised Attack.",
        "frequency": "1/Round"
      }
    ],
    "description": "The \"Martial Doctrine\" are a set of emergency subroutines that improve a mech's capabilities in the situation that it is forced into disarmed combat. Though they were distributed by ASGARD in three different releases, they were clearly intended to form a greater whole, as each version has hidden code that only activates in the presence of the others."
  },
  {
    "id": "asg_martial_doctrine_1",
    "name": "Martial Doctrine I",
    "type": "System",
    "sp": 3,
    "source": "ASG",
    "license": "DRAUGR",
    "license_level": 1,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "effect": "Gain increasing benefits based on the number of Martial Doctrine systems installed:<ul><li>1+: You may make Improvised Attacks as a quick action as long as you aren't Jammed.</li><li>2+: Your Improvised Attacks deal 1d6 bonus Kinetic damage on a critical hit.</li><li>3: Your Improvised Attacks count as attacks with Main Melee weapons.</li></ul>This effect is shared between all Martial Doctrine systems and only applies once.",
    "actions": [
      {
        "name": "Martial Stance: Hunter",
        "activation": "Protocol",
        "detail": "Gain 2 heat. Once this turn, you may move 3 Spaces towards a target as a part of an Improvised Attack. This movement does not provoke Reactions and ignores engagement. If you do, you gain +1 Accuracy on that attack.<br/><i>Only one Martial Stance Protocol may be activated on a turn.</i>"
      },
      {
        "name": "Combo: Haymaker",
        "activation": "Free",
        "detail": "Make a melee attack against a target you damaged with an Improvised Attack this turn. On a success, your target is Slowed and Impaired until the end of your next turn. You may only take this action immediately after dealing damage with an Improvised Attack.",
        "frequency": "1/Round"
      }
    ],
    "description": "The \"Martial Doctrine\" are a set of emergency subroutines that improve a mech's capabilities in the situation that it is forced into disarmed combat. Though they were distributed by ASGARD in three different releases, they were clearly intended to form a greater whole, as each version has hidden code that only activates in the presence of the others."
  },
  {
    "id": "asg_pyrokins",
    "name": "Pyrokins",
    "type": "System",
    "sp": 2,
    "source": "ASG",
    "license": "MUNINN",
    "license_level": 1,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_grenade"
      },
      {
        "id": "tg_limited",
        "val": 2
      }
    ],
    "actions": [
      {
        "activation": "Quick",
        "name": "Launch Pyrokins",
        "range": [
          {
            "type": "Cone",
            "val": 3
          }
        ],
        "damage": [
          {
            "type": "Explosive",
            "val": 2
          },
          {
            "type": "Heat",
            "val": 1
          }
        ],
        "detail": "Launch a barrage of pyrokins, dealing 2 Explosive and 1 Heat damage to all characters in a cone."
      },
      {
        "activation": "Reaction",
        "name": "Reactive Pyrokins",
        "frequency": "1/turn",
        "trigger": "A character makes a melee attack against you.",
        "range": [
          {
            "type": "Cone",
            "val": 3
          }
        ],
        "damage": [
          {
            "type": "Explosive",
            "val": 2
          },
          {
            "type": "Heat",
            "val": 1
          }
        ],
        "detail": "After the attack resolves, hit or miss, launch a barrage of pyrokins, dealing 2 Explosive and 1 Heat damage to all characters in a cone. This cone must target the character who attacked you."
      }
    ],
    "effect": "Whenever you take Structure or Stress damage, you regain up to 2 uses of this system. ",
    "description": "Pyrokins themselves are a type of sharp disk-like metal projectile coated in a basic explosive powder. The pyrokin launcher contains a basic forge manned by tiny microbots, akin to a nexus, that can process damaged scrap severed from a mech's hull into more pyrokins during the middle of a battle."
  },
  {
    "id": "asg_skadi_nhp",
    "name": "SKADI-Class NHP",
    "type": "AI",
    "sp": 3,
    "source": "ASG",
    "license": "MUNINN",
    "license_level": 3,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_ai"
      },
      {
        "id": "tg_aura",
        "val": 15
      },
      {
        "id": "tg_heat_self",
        "val": 2
      }
    ],
    "effect": "Your Mech gains the AI tag. While this system's Aura is active: whenever Lock-On is consumed on a hostile character within this system's Aura and line of sight, you gain 1 Heat and immediately reapply Lock On to them.",
    "description": "The SKADI-class NHP is unusually focused on, in her words, 'the hunt'. Once locked on to a target, SKADI will not lose sight of them. This predilication extends to SKADI's interactions with humans, who can find her behavior obsessive and unnerving."
  },
  {
    "id": "asg_boost_buddy",
    "name": "\"Boost Buddy\" Exhaust Addon",
    "type": "System",
    "sp": 2,
    "source": "ASG",
    "license": "FAFNIR",
    "license_level": 1,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "effect": "Whenever you Boost, you clear 1 Heat. Clearing Heat in this way does not trigger the effects of your own weapons, systems, core bonuses, or frame traits.",
    "description": "Mech boosters generate a noticeable amount of heat which are mitigated by sophisticated heatsinks which use the motion of air around the boosting Mech to reduce the chance of overheating. By routing some of the coolant of a mech's other systems through these air coolers, one achieves a tiny bit of additional passive cooling."
  },
  {
    "id": "asg_solid_fuel_booster",
    "name": "Solid Fuel Auxiliary Boosters",
    "type": "System",
    "sp": 3,
    "source": "ASG",
    "license": "FAFNIR",
    "license_level": 2,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_limited",
        "val": 2
      },
      {
        "id": "tg_heat_self",
        "val": 3
      }
    ],
    "actions": [
      {
        "activation": "Free",
        "name": "Ignite Booster",
        "detail": "Move up to 10 Spaces in a straight line, stopping early only if you collide with an object or another character. If you stop early, you and the character or object you collided with take 1 Kinetic damage for every two spaces you moved. The movement provided by this system ignores engagement and does not provoke reactions.",
        "frequency": "1/Round"
      }
    ],
    "description": "Solid rocket boosters have been in use since humanities earliest endeavours in spaceflight. Though they have been entirely phased out for space launches in favor of more efficient and reusable systems, smaller modules can be used to give a mech a one time boost just when they need it."
  },
  {
    "id": "asg_firewatch",
    "name": "Firewatch Emergency System",
    "type": "System",
    "sp": 2,
    "source": "ASG",
    "license": "FAFNIR",
    "license_level": 2,
    "actions": [
      {
        "activation": "Protocol",
        "name": "Explosive Fire Suppression",
        "detail": "Trigger an explosive deployment of flame-retardant foam that saturates your mech both inside and out, clearing all Heat and Burn affecting you. Until the start of your next turn: you have resistance to Explosive and Energy damage and immunity to Burn and Heat, but your Speed is reduced to 4 and you are Slowed. Furthermore, on this turn you may only move and take one Quick Action: you may not Overcharge, take Free Actions, or take Full Actions. The negative effects of this system cannot be prevented and bypass immunity.",
        "frequency": "1/Combat"
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_limited",
        "val": 1
      }
    ],
    "description": "The Firewatch Emergency System is designed to put out the fire <i>now</i>, regardless of any lingering consequences. The foam will evaporate after a delay to help with cleanup, but it <i>will</i> get in the way until then, or your money back."
  },
  {
    "id": "asg_dragonfly",
    "name": "DRAGONFLY Atmospheric Repositioning System",
    "type": "Flight System",
    "sp": 3,
    "source": "ASG",
    "license": "FAFNIR",
    "license_level": 3,
    "actions": [
      {
        "activation": "Full Tech",
        "name": "Atmospheric Launch",
        "detail": "You gain 8 Heat and launch 30 Spaces directly upward before beginning to hover. After launching in this way, you cannot take any actions other than the Dragonfly protocol granted by this system, but you cannot be targeted or affected by any other mech's actions. At the start of your turn, if you choose not to use the Dragonfly protocol, you remain hovering and gain 2 Heat. If your mech has the ability to fly, you can choose to drop to a height of 10 Spaces an begin flying normally, instead.<br/><br/>Activating this system indoors causes the mech to collide with the ceiling, Stunning them until the start of their next turn and causing them to immediately fall to the ground where they launched from. When colliding with thin barriers, the mech may punch through instead of falling back to the ground, which can cause disastrous explosive decompression on space vessels."
      },
      {
        "activation": "Protocol",
        "name": "Dragonfly",
        "detail": "You rocket towards the ground, landing in any space on the battlefield. You deal 1d6 Explosive damage to and knock Prone all characters within Burst 2 of your landing spot.<br/><br/><i>You may only use this Protocol while hovering from the effect of Atmospheric Launch.</i>",
        "frequency": "1/Round"
      }
    ],    
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "effect": "All actions granted by this system are considered movement and cannot be taken while Slowed or Immobilized.",
    "description": "The DRAGONFLY is similar in construction to other flight systems, albiet much bulkier and less flexibile. What it sacrifices in general utility it makes up for with vertical launch power, allowing for mechs to reposition themselves on the battlefield with explosive speed."
  },
  {
    "id": "lumico_accessory_case",
    "name": "Accessory Case",
    "type": "System",
    "tags": [
      {
        "id": "tg_limited",
        "val": 3
      },
      {
        "id": "tg_unique"
      }
    ],
    "actions": [
      {
        "activation": "Protocol",
        "name": "Attach Accessories",
        "detail": "Choose a weapon installed on your Mech and a single weapon mod that could be applied to it, even if you do not possess the license for that mod. For the rest of the turn, treat that weapon as though that mod was applied to it. If the chosen mod would cost 3 or more SP to install, it consumes 2 of this system's charges.<br><i>If the chosen mod has limited uses, you may always use it as though it still had charges remaining. If the chosen mod has multiple states (e.g. the Caliban's Supermassive Mod), the mod can be activated in the state of your choice.</i>"
      }
    ]
  },
  {
    "id": "lumico_fugue_system",
    "name": "Fugue System",
    "type": "Tech",
    "sp": 3,
    "source": "LUMICO",
    "license": "VIRTUOSO",
    "license_level": 2,
    "actions": [
      {
        "activation": "Invade",
        "name": "Fugue Polyphony",
        "detail": "Weapon attacks against the target have +1 Accuracy, ignore Invisibility and gain the Seeking tag. This effect lasts until the target is hit by a weapon attack."
      },
      {
        "activation": "Invade",
        "name": "Fugue Harmony",
        "detail": "Weapon attacks against the target cannot gain Accuracy, but the next weapon attack that hits the target deals 1d6 bonus Energy damage and is AP. If the attack was a Critical Hit, the bonus damage is doubled. This effect lasts until the target is hit by a weapon attack."
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_luxury",
        "val": 1
      }
    ],
    "description": "The Lumiera Corporation Fugue System synchronizes the target's active defenses and evasive algorithms into operating at a harmonized frequency, causing gaps to appear in the target's defenses at regular intervals."
  },
  {
    "id": "lumico_choreograph_system",
    "name": "Choreograph System",
    "type": "Tech",
    "sp": 2,
    "source": "LUMICO",
    "license": "VIRTUOSO",
    "license_level": 1,
    "actions": [
      {
        "activation": "Invade",
        "name": "Closed Position: Waltz",
        "detail": "When any character makes an attack that affects an area (i.e., a Line, Cone, Burst, or Blast), you may force the target to move up to 3 spaces toward the affected area as a Reaction. If they would become a target of the attack, the attack gets +1 Accuracy against them, and they get +1 Difficulty on any Saves they must make as a result of the attack. This effect remains on a target until it is used."
      },
      {
        "activation": "Invade",
        "name": "Closed Position: Tango",
        "detail": "The target is pulled adjacent to their nearest ally within Range 6, then must attempt to Grapple that ally with +1 Accuracy. If successful, the target's ally also gains 2 Heat. This Grapple cannot be ended by either party until the end of your next turn."
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_luxury",
        "val": 1
      }
    ],
    "description": "Anything can be art, claims Lumiera Corporation, even battle. If hostile actors introduce chaos, take control and show them where they are <i>supposed</i> to be."
  },
  {
    "id": "lumico_nova_recorder",
    "name": "NOVA Fragment: Record",
    "type": "Tech",
    "sp": 3,
    "source": "LUMICO",
    "license": "PHILOSOPHER",
    "license_level": 2,
    "actions": [
      {
        "activation": "Invade",
        "name": "REQUEST: RECORD SEQUENCE",
        "detail": "You may use this Invade on Biological targets, but it does not generate Heat when used in this way. Mark the current position of the target. Gain access to the REQUEST: ERASE SEQUENCE reaction, until that reaction is used. Only one target may be under this effect at a time: using this action on another target ends this effect on the original."
      },
      {
        "activation": "Reaction",
        "trigger": "Immediately after any character takes any action or movement, while the target of REQUEST: RECORD SEQUENCE is within Sensors.",
        "name": "REQUEST: ERASE SEQUENCE",
        "detail": "Gain 4 Heat. The target of REQUEST: RECORD SEQUENCE is returned to the marked position and the effect of the triggering action or movement is undone."
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "description": "<i>\"NOVA is barely real, in a way we can understand. It operates in a different frame of reference. The physical device we see within the Philosopher is merely a shadow of the full mechanism, projected from a higher plane of existence. Even these fragments: they seem like they're seperate entities, but in reality, they're all part of the same machine, completely connected to NOVA in ways we can't see.\"</i>"
  },
  {
    "id": "lumico_nova_wish",
    "name": "NOVA Fragment: Wish",
    "type": "System",
    "sp": 3,
    "source": "LUMICO",
    "license": "PHILOSOPHER",
    "license_level": 3,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_limited",
        "val": "1"
      }
    ],
    "effect": "You may not regain uses of this system, except during a Full Repair.",
    "actions": [
      {
        "activation": "Full",
        "name": "REQUEST: WISH GRANTED",
        "detail": "Expend a charge to take an action granted by any System without the Exotic Gear tag as a free action, even if you do not have the License for that system.<br>The GM has final say on how to interpret how the action will resolve in a given situation, but in general the player should be allowed to activate the chosen system in a way that is meaningful and as consistent with its normal use as possible."
      }
    ],
    "description": "<i>\"Have you ever wondered what things would be like if you were someone else—if you had chosen differently?\"</i>"
  },
  {
    "id": "lumico_pocket_star",
    "name": "Pocket Star",
    "type": "System",
    "sp": 4,
    "source": "LUMICO",
    "license": "PHILOSOPHER",
    "license_level": 3,
    "tags": [
      {
        "id": "tg_indestructible"
      },
      {
        "id": "tg_unique"
      }
    ],
    "effect": "During a rest, you may activate this system to grant 1 Core Point to yourself and an ally of your choice. This system only has one use, regained when you make a Full Repair.",
    "description": "Lumico's Near-Zero-Mass Fusion Reactor, internally dubbed the \"Pocket Star\", provides an ingenious method of storing energy. Originally intented to fulfill a similar role to a mech's standard reactor, technical issues related to effectively extracting the energy produced by the Pocket Star meant that it was deemed more valuable as a store of reserve energy rather than as a primary power source."
  },
  {
    "id": "lumico_nova_predict",
    "name": "NOVA Fragment: Predict",
    "type": "System",
    "sp": 2,
    "source": "LUMICO",
    "license": "PHILOSOPHER",
    "license_level": 1,
    "actions": [
      {
        "activation": "Invade",
        "name": "REQUEST: AVOID SEQUENCE",
        "detail": "Choose a character. Until the end of your target's next turn, each instance of damage dealt by your target to the chosen character is reduced to 1."
      },
      {
        "activation": "Invade",
        "name": "REQUEST: PREFER SEQUENCE",
        "detail": "Choose an unobstructed space within your line of sight and Range 6 of the target's current location. If your target does not end their turn on that spacee, they gain 2 Heat and are Impaired and Immobilized until the end of your next turn."
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_luxury",
        "val": "1"
      }
    ],
    "description": "<i>\"How does NOVA predict the future? It doesn't, really. It travels to a point in time in the near future, records what it sees, then returns so that the user can review its logs. Nothing as arcane as 'prediction.'\"</i>"
  },
  {
    "id": "lumico_black_hole",
    "name": "Nanoscopic Black Hole Projector",
    "type": "Tech",
    "sp": 3,
    "source": "LUMICO",
    "license": "PHILOSOPHER",
    "license_level": 2,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_aura",
        "val": 3
      },
      {
        "id": "tg_limited",
        "val": 3
      }
    ],
    "actions": [
      {
        "activation": "Quick Tech",
        "name": "Gravitational Crush",
        "detail": "You may only take this action if this system's Aura is active. All characters within the Aura must make a Hull save or take 1d6 Energy damage and be pulled up to 2 spaces toward the center of the Aura. On a success, they are not pulled. Characters within the <i>Event Horizon</i> take 2d6 AP Energy damage, instead. All objects within the Aura take 20 AP Energy damage. Using this action does not consume charges from this system, and this action affects Biological targets.",
        "frequency": "1/Round"
      }
    ],
    "effect": "When this Aura is activated, choose a point within Sensors. This system's Aura is centered on that point, rather than the user.<br>Any character adjacent to or on the same space as the center of the Aura is within this system's <i>Event Horizon</i>. Characters within the Aura are Slowed.",
    "description": "By generating an extremely small but superdense mass, one can harness and direct gravitational waves to directly affect ambient energy. At this scale, Hawking radiation causes the object to degrade at a high speed and it will quickly evaporate if it is not actively maintained by the generator."
  },
  {
    "id": "lumico_babel",
    "name": "Babel System",
    "type": "System",
    "sp": 2,
    "source": "LUMICO",
    "license": "PHILOSOPHER",
    "license_level": 1,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "actions": [
      {
        "activation": "Reaction",
        "trigger": "An ally within Sensors is targeted by a hostile tech action, before any Invade rolls are made.",
        "name": "Activate Babel System",
        "detail": "You redirect the effect of the action to yourself. You may only use this effect on each ally once per scene.",
        "frequency": "1/Round"
      }
    ],
    "description": "In the event of an emergency, the \"Babel\" System generates a cypher that causes an enemy to mistakenly target the system's user, instead. The system is somewhat basic by Lumiera Corporation's standards, and will generally only confuse a hostile system while it isn't actively correcting for the interference."
  },
  {
    "id": "lumico_lullaby",
    "name": "The Lullaby",
    "type": "System",
    "sp": 3,
    "source": "LUMICO",
    "license": "TRAILBLAZER",
    "license_level": 3,
    "effect": "While this system's Aura is active:<ul><li>You cannot take tech actions.</li><li>You are immune to the effect of tech actions that originate from within this system's Aura.</li><li>After a character within this system's Aura attacks you, they are Jammed until the end of the current turn.</li></ul>",
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_aura",
        "val": 5
      },
      {
        "id": "tg_heat_self",
        "val": 3
      }
    ],
    "description": "Lumiera Corporation's \"Lullaby\" system projects a chaotic signal that disrupts the operation of mech systems, preventing them from accurately targeting the source of the signal. During testing, pilots of mechs targeted by the Lullaby's signal reported extreme distress, citing phantom sounds produced within the cockpit. Lumiera Corporation intended to delay the system's release, but an error caused the system to be released to the public anyway."
  },
  {
    "id": "lumico_lamplighter",
    "name": "Lamplight Chemical Charges",
    "type": "Deployable",
    "sp": 2,
    "source": "LUMICO",
    "license": "TRAILBLAZER",
    "license_level": 1,
    "actions": [
      {
        "activation": "Quick",
        "name": "Lamplight Oil Grenade",
        "range": [
          {
            "type": "Range",
            "val": 5
          }
        ],
        "detail": "Throw a Lamplight Grenade within Range 5. The target must succeed on an Agility save or become coated in an unstable substance. Coated targets are Slowed and do not benefit from Invisibility unless the substance is removed, which affected characters may do as a quick action. When a coated target receives any Heat or Burn, the substance degrades explosively: the coating is removed and the affected target takes 1d6 AP Explosive damage."
      }
    ],
    "deployables": [
      {
        "type": "Mine",
        "name": "Lamplight Tar Mine",
        "activation": "Quick",
        "detail": "All characters in a Burst 1 area must succeed on an Agility save or become coated, as above. However, the substance Immobilizes affected characters instead of Slowing them and requires a Full Action to remove."
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_grenade"
      },
      {
        "id": "tg_limited",
        "val": 4
      }
    ],
    "description": "Inspired by olden tales of tar bombs used by pioneers in the pre-spaceflight era, the Lamplight Grenade deploys a volatile chemical payload that detonates after receiving a small amount of sustained agitation."
  },
  {
    "id": "lumico_fastball",
    "name": "Fastball Charges",
    "type": "System",
    "sp": 2,
    "source": "LUMICO",
    "license": "SAVANT",
    "license_level": 1,
    "actions": [
      {
        "activation": "Quick",
        "name": "Heater",
        "range": [
          {
            "type": "Range",
            "val": 5
          }
        ],
        "damage": [
          {
            "type": "Explosive",
            "val": 3
          }
        ],
        "detail": "Choose a target within Range. They take 3 AP Explosive damage and are knocked Prone."
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_grenade"
      },
      {
        "id": "tg_limited",
        "val": 3
      }
    ],
    "description": "These charges are small, easy to throw, and reliably detonate on impact. Sometimes, simple is best: <i>Give 'em the heater.</i>"
  },
  {
    "id": "lumico_heroic_aura",
    "name": "HEROIC AURA",
    "type": "System",
    "sp": 3,
    "source": "LUMICO",
    "license": "PARAGON",
    "license_level": 2,
    "effect": "While this system's Aura is active, all allies within the Aura have soft cover and you can take the FLASH OF LIGHT reaction to redirect damage to yourself.",
    "actions": [
      {
        "activation": "Reaction",
        "name": "Flash of Light",
        "frequency": "1/Round",
        "trigger": "A friendly character within this system's Aura Braces.",
        "detail": "You redirect any damage the affected ally would take after reductions to yourself as Energy damage. You cannot reduce this redirected damage in any way."
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_aura",
        "val": 4
      },
      {
        "id": "tg_heat_self",
        "val": 3
      }
    ],
    "description": "The Heroic Aura projects a field of disruptive hardlight fragments around the user, making most targeting systems less effective. What attacks still land can be mitigated through the effect of a reactive hardlight projector that paints a lightscreen over an ally. However, this projector must be hardwired into the mech's reactor to support the needed power draw, and its sudden load on a mech can be exceptionally damaging—enough so that it often damages the user proportionately to the harm it prevents."
  },
  {
    "id": "ice_silent_running",
    "name": "Silent Running Mode",
    "type": "System",
    "sp": 1,
    "source": "ICE",
    "license": "ICEBREAKER",
    "license_level": 1,
    "actions": [
      {
        "activation": "Protocol",
        "name": "Silent Running",
        "detail": "You activate your mech's silent running mode, suppressing your exhaust and powering down many systems to hide it from enemy sensors. You can end this mode as a free action.<br/>While in silent running, you are also Jammed and Slowed, and cannot lose Heat by any means. If you would Overheat with silent running active, the effect ends automatically. However, you gain the following benefits:<ul><li>You are immune to SCAN and LOCK ON.</li><li>If you become Invisible or if you are Invisible at the start of your turn, you also become Hidden automatically.</li><li>Smart weapons, tech attacks, and Drones always treat you as though you were Invisible.</li><li>Autonomous systems and scanners that rely entirely on Sensors rather than visual recognition will not be able to detect you. Systems that use both cannot detect you unless you are visible to cameras or other visual detectors.</li></ul>"
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "description": "Silent running mode is a simple modification to a vehicle's operation that closes all exhaust vents and massively reduces the output of any onboard systems. Originally, this was mainly used by space smugglers hiding their ships from system-wide scans that would potentially reveal their activities as they slowly snuck into spaceports. While more useful in the vast, empty darkness of space, where is it nigh impossible to see objects from a distance, disguising one's mech in this way can be useful, provided it can be hidden from sight as well."
  },
  {
    "id": "ice_regen_brake",
    "name": "Regenerative Heat Shield",
    "type": "Shield",
    "sp": 3,
    "source": "ICE",
    "license": "ICEBREAKER",
    "license_level": 3,
    "effect": "If you BRACE while in the Danger Zone, on your next turn you may take your Standard Movement and up to 1 Free Action in addition to the Quick Action you would normally receive.",
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_danger_zone"
      },
      {
        "id": "tg_shield"
      }
    ],
    "description": "This shielding system can project a temporary, powerful energy shield around a mech, powered by a miniature thermal engine that runs off the heat generated by a mech's systems. The barrier it projects consumes all the power it has generated in a matter of seconds, making it ineffective for long term point defense, but it can take a great deal of the load off of a mech bracing for a more intense hit."
  },
  {
    "id": "ice_baba",
    "name": "BABA-Class Comp/Con",
    "type": "Drone",
    "sp": 4,
    "source": "ICE",
    "license": "ICEBREAKER",
    "license_level": 3,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_ai"
      },
      {
        "id": "tg_overshield"
      }
    ],
    "deployables": [
      {
        "type": "Drone",
        "name": "BABA",
        "activation": "Quick",
        "detail": "BABA may only be deployed to or recalled from adjacent spaces.<br/><br/>At the start of each your turns while it is deployed, after you have taken any Protocols, BABA will determine the first procedure below whose conditions are met, then move up to 6 spaces in an attempt to follow that procedure.<ol><li>BOOM: If BABA is prioritizing BOOM or has 5 or less HP, it will move towards the nearest hostile character and explode upon reaching a an adjacent space to its target, dealing 2d6 AP Explosive damage to and knocking Prone all characters within Burst 1, destroying itself in the process.</li><li>HIDE: If BABA took damage since your previous turn and is not currenty Hidden, it will become Invisible and Hidden until it triggers the effect of one of its other procedures by moving adjacent to its target. However, it does not move this turn.</li><li>POWER: If any allied Mech is Stunned, BABA will move toward the nearest Stunned allied Mech and clear the condition upon reaching an adjacent space.</li><li>PET: If an allied Mech is missing HP and has no Overshield, BABA will move toward the nearest allied Mech that meets that criteria and grant them 3 Overshield upon reaching an allied space.</li><li>PUSH: BABA will move toward the nearest hostile character and attempt to Ram them from an adjacent space, gaining your Grit as a bonus to its roll.</li></ol>",
        "size": 0.5,
        "hp": "20",
        "actions": [
          {
            "name": "BABA IS DONE",
            "activation": "Protocol",
            "frequency": "1/Scene",
            "detail": "BABA is ordered to prioritize the BOOM procedure."
          },
          {
            "name": "BABA IS MOVE",
            "activation": "Reaction",
            "frequency": "1/Round",
            "trigger": "Another character starts their turn.",
            "detail": "BABA acts, moving and following procedures as though it were the start of your turn."
          }
        ]
      }
    ],
    "effect": "Your Mech can deploy BABA and gains the AI tag as long as BABA is not deployed. BABA isn't a full NHP and cannot Cascade.<br/>While BABA is deployed, the AI is present on the drone and cannot be given control of a mech.",
    "description": "The BABA-class COMP/CON unit is a pleasant little autonomous helper that is doing its very best."
  },
  {
    "id": "ice_bloomcoat",
    "name": "SA 0-363 'BLOOMCOAT'",
    "type": "System",
    "sp": 2,
    "source": "ICE",
    "license": "GREENHORN",
    "license_level": 1,
    "actions": [
      {
        "activation": "Protocol",
        "name": "Magnabloom",
        "detail": "Trigger a sudden bloom of heavy, colorful flowers in the plants surrounding your mech, granting the following effects until the flowers are dislodged:<ul><li>You gain Soft Cover, even in the open.</li><li>All spaces adjacent to you are considered Difficult Terrain.</li><li>If an adjacent character is targeted by a Smart, Seeking or Guided weapon attack, roll 1d6. On a 4-6, the colors of the flowers disrupt that attack's targeting, redirecting the attack to you.</li></ul>If you take any movement other than your Standard Move, the flowers are knocked free of your mech and this effect ends."
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_heat_self",
        "val": 2
      }
    ],
    "description": "<i>ARTIFACT STABILIZATION LOG<br/>RECORD: 0-363<br/><br/>THIS VINEY FLORA IS GROWN IN AQUACULTURE VATS ON THE SURFACE OF THE MECH.<br/>MUCH LIKE MOST OF THE OTHER PLANTS WE'VE PULLED OUT OF THE VAULT, THESE BLOOM <u>VERY</u> FAST.<br/>ADD A LITTLE BIT OF HEAT, AND YOU'LL BE DAZZLED BY THE COLORS.</i>"
  },
  {
    "id": "ice_chloropaint",
    "name": "SA 0-009 'CHLOROPAINT'",
    "type": "System",
    "sp": 1,
    "source": "ICE",
    "license": "GREENHORN",
    "license_level": 1,
    "effect": "When using a system or making an attack would cause you to gain Heat or to expend at least one charge of a Limited system, roll 1d6. On a roll of 6, that action does not cause you to gain heat and you expend one less charge than you would have. This system's effect is then disabled until your next Rest or Full Repair.",
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_indestructible"
      }
    ],
    "description": "<i>ARTIFACT STABILIZATION LOG<br/>RECORD: 0-009<br/><br/>THIS PAINT CONTAINS THE SEEDS FOR A KIND OF MOSS THAT BUILDS UP LITTLE ELECTRICAL CHARGES OVER TIME.<br/>THE MECH CAN DRAW FROM THAT, AND USE IT FOR A TINY BURST OF ENERGY FOR COMPUTERS OR ONBOARD PRINTERS.<br/>OBVIOUSLY, YOU HAD BETTER LIKE THE COLOR GREEN.</i>"
  },
  {
    "id": "ice_seedbed",
    "name": "SA 1-886 'Maliflora GENUS SEEDBED'",
    "type": "System",
    "sp": 3,
    "source": "ICE",
    "license": "GREENHORN",
    "license_level": 2,
    "actions": [
      {
        "activation": "Protocol",
        "name": "Epigenetic Hypergrowth",
        "detail": "Gain 6 Heat to activate the growbeds within this system. You can take the SPROUTSEED actions granted by this system 2 times this scene before you must take this action again."
      },
      {
        "activation": "Quick",
        "name": "M. solimani Sproutseed",
        "range": [
          {
            "type": "Range",
            "val": 5
          }
        ],
        "detail": "Throws a fast blooming Heatseeker Vine seed at a target, which begins to rapidly grow and strangle the target: the Vine will clear 2 heat from all  characters within Burst 3 of the target and deal Kinetic damage to the target equal to the total heat cleared. The target may attempt a Hull save to reduce the radius of the heat drain to Burst 1."
      }
    ],
    "deployables": [
      {
        "type": "Mine",
        "name": "M. terranguis Sproutseed",
        "activation": "Quick",
        "detail": "This Sproutseed immediately 'detonates' when it initially arms, covering all terrain within Burst 3 of the mine's location with throttling Earthsnake Vines, converting it into Dangerous and Difficult Terrain until the end of the scene."
      },
      {
        "type": "Mine",
        "name": "M. agilis Sproutseed",
        "activation": "Quick",
        "detail": "After this Sproutseed arms, it covers a Burst 2 area in sensitive Shockwave Vines. When a character in this area, friendly or enemy, would take damage, the vines will react to the impact and energy, 'detonating' to shroud the damaged character and grant them 8 Overshield before they are damaged."
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_grenade"
      },
      {
        "id": "tg_overshield"
      }
    ],
    "effect":"The SPROUTSEED actions granted by this system cannot be used until you have taken the EPIGENETIC HYPERGROWTH Protocol to cause new sprouts to bloom.",
    "description": "<i>ARTIFACT STABILIZATION LOG<br/>RECORD: 1-886<br/><br/>WOW, THESE VINES GROW REALLY FAST.<br/>WE BROUGHT IN A BOTANIST TO TAKE A LOOK AT THEM, AND HE SAID THAT THEY'RE ALL PRETTY CLOSELY RELATED TO EACH OTHER.<br/>MAKES SENSE, THEY'RE RIDICULOUSLY FAST GROWING PARASITIC VINES THAT STRANGLE OUT OTHER PLANTS.<br/>THEY DIE QUICKLY, THOUGH, SO TO MAKE THEM USEFUL, WE KEEP HAVING TO GROW MORE.<br/>WHY ARE ALL THESE EXTRADIMENSIONAL PLANTS SO DIFFICULT TO KEEP ALIVE?</i>"
  },
  {
    "id": "ice_parasite_weed",
    "name": "SA 2-401 'PARASITE WEED' (Mech Stabilizer)",
    "type": "System",
    "sp": 1,
    "source": "ICE",
    "license": "GREENHORN",
    "license_level": 3,
    "effect": "While this System is installed on your Mech, you can benefit from the PARASITE WEED pilot gear.",
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "description": "<i>ARTIFACT STABILIZATION LOG<br/>RECORD: 2-401b<br/><br/>IT'S A SHAME THAT THESE DESIGNATIONS CAN'T BE CHANGED LATER.<br/>'STABILIZED ARTIFACT: PARASITE WEED' DOESN'T INSPIRE MUCH CONFIDENCE.<br/>I MEAN, IT'S AN ACCURATE NAME IN A SENSE, BUT IT'S MUTUALISTIC WITH THE PILOT.<br/>HELL, IT'S SO WEAK THAT WE EVEN HAVE TO INSTALL A SYSTEM ON THE MECH TO KEEP IT FROM JUST DYING OUTRIGHT ON THE HOST'S BODY.<br/>THE NAME MAKES IT SOUND LIKE A GODDAMN HORROR MOVIE.</i>"
  },
  {
    "id": "ice_wavesync",
    "name": "SA 0-919 'WAVESYNC'",
    "type": "Tech",
    "sp": 1,
    "source": "ICE",
    "license": "ANGEL",
    "license_level": 1,
    "effect": "Biological targets lose Immunity to your Tech Actions, including Invades. Invades used on Biological targets through the effect of this system do not inflict Heat.",
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "description": "<i>ARTIFACT STABILIZATION LOG<br/>RECORD: 0-919<br/><br/>IT'S A TINY BIT OF CODE WRITTEN IN SOME ESOTERIC LANGUAGE.<br/>IT CAN READ CODE FRAGMENTS AND PRODUCE HIGH FREQUENCY PULSES OF EM RADIATION THAT INTERFERE WITH NEUROLOGICAL ACTIVITY.<br/>BIZARRE...</br>HOW DOES IT KNOW WHAT THE INTENTION OF THE SOURCE CODE IS?</i>"
  },
  {
    "id": "ice_dropsy",
    "name": "SA 0-238 'WEAKNESS OF BODY'",
    "type": "Tech",
    "sp": 2,
    "source": "ICE",
    "license": "ANGEL",
    "license_level": 1,
    "actions": [
      {
        "activation": "Invade",
        "name": "DROPSY",
        "detail": "Until the end of your target's next turn, they take 1 AP Energy damage each time they gain Heat (regardless of the amount of Heat they gained), including the Heat they gained from this Invade action."
      },
      {
        "activation": "Invade",
        "name": "CONSUMPTION",
        "detail": "Until the end of your target's next turn, if they take any action that causes them to gain Heat, they are STUNNED until the end of their next turn at the end of that action. This can only be used 1/scene on each character."
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "description": "<i>ARTIFACT STABILIZATION LOG<br/>RECORD: 0-238<br/><br/>IT'S A SIGNAL THAT CAUSES THE SECURITY SYSTEM OF A HOSTILE MECH TO MASSIVELY OVERREACT TO EXCEPTIONS.<br/>IT'S BASICALLY AN ALLERGIC REACTION.<br/>THE SYSTEM ENDS UP FLOODING ITSELF.</i>"
  },
  {
    "id": "ice_flagellation",
    "name": "SA 1-002 'FLAGELLATION'",
    "type": "System",
    "sp": 3,
    "source": "ICE",
    "license": "ANGEL",
    "license_level": 2,
    "actions": [
      {
        "activation": "Free",
        "frequency": "1/Round",
        "name": "MORTIFICATION",
        "detail": "Clear any amount of Heat. You lose HP equal to the amount of Heat cleared, and cannot recover HP by any means until the end of your next turn."
      }
    ],
    "tags": [
      {
        "id": "tg_limited",
        "val": 1
      },
      {
        "id": "tg_unique"
      }
    ],
    "description": "<i>ARTIFACT STABILIZATION LOG<br/>RECORD: 1-002<br/><br/>[AUDIO TRANSCRIPTION FOLLOWS]<br/><br/>IF YOUR RIGHT HAND CAUSES YOU TO SIN, CUT IT OFF<br/>IF YOUR RIGHT EYE CAUSES YOU TO SIN, GOUGE IT OUT<br/>BETTER TO SUFFER THE FLESH<br/>THAN ENDURE CONDEMNATION</i>"
  },
  {
    "id": "ice_angel_special",
    "name": "Severed Consciousness",
    "type": "AI",
    "sp": 0,
    "source": "ICE",
    "license": "ANGEL",
    "license_level": 2,
    "effect": "If a pilot's body is killed while they are piloting the Angel, their consciousness becomes locked in a state of limbo. This system contains what remains of their entire being. If it is installed in a mech, that mech becomes their body, in a sense. This system's 'One of a Kind' tag applies to each character trapped in this way; if multiple pilots are trapped due to the Angel's effect, each pilot is One of a Kind.<br/><br/>This system must be installed for them to pilot any mech other than the Angel and grants that mech the AI tag. The pilot is not a normal NHP and cannot cascade.<br/><br/>This system should not be used under any other circumstances and can never be installed on the Angel.",
    "tags": [
      {
        "id": "tg_ai"
      },
      {
        "id":"tg_oneofakind"
      }
    ],
    "description": "<i>It's terrifying to know just what this thing is.</i>"
  },
  {
    "id": "ice_destinyfragment",
    "name": "SA 2-176 'SPEAR OF DESTINY'",
    "type": "Tech",
    "sp": 3,
    "source": "ICE",
    "license": "ANGEL",
    "license_level": 3,
    "effect": "While this system's Aura is activated, you can project a <i>Destiny Fragment</i>, an astral projection of yourself, to any space within the Aura. It remains as long as the Aura is active. The <i>Destiny Fragment</i> has the same Sensor range as you, and has IMMUNITY to all effects not caused by a Tech Action, and whenever it is affected by a Tech Action, the effects are applied to you, instead. This cannot cause you to be affected by a single Tech Action multiple times.<br/><br/>You can move the <i>Destiny Fragment</i> up to your Speed as a Protocol, but it must remain within the Aura.<br/><br/>Whenever you INVADE, the <i>Destiny Fragment</i> makes an INVADE using your Tech Attack bonus against a different target within its Sensors. It may choose a different INVADE option if it hits.",
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_aura",
        "val": 10
      },
      {
        "id": "tg_heat_self",
        "val": 3
      }
    ],
    "description": "<i>ARTIFACT STABILIZATION LOG<br/>RECORD: 2-176<br/><br/>[AUDIO TRANSCRIPTION FOLLOWS]<br/><br/>WHAT I HOLD IS MERELY AN IMITATION OF THE TRUE SPEAR<br/>ALONGSIDE WHAT I HAVE GIVEN YOU, YOU POSSESS ALL THE PIECES OF THE REAL THING<br/>YOU WILL ONLY HAVE A SINGLE CHANCE TO USE IT ON HIM<br/>MAKE SURE THAT YOU MAKE IT COUNT<br/>OR HOPE WILL DIE WITH YOU</i>"
  },
  {
    "id": "ice_redline",
    "name": "SA 2-095 'REDLINE'",
    "type": "System",
    "sp": 3,
    "source": "ICE",
    "license": "Catalyst",
    "license_level": 3,
    "effect": "While your current heat is equal to your maximum heat or if you have a pending Reactor Meltdown:<ul><li>You gain +1 Accuracy on all Attacks.</li><li>1/Round, you deal 1d6 bonus Energy damage when landing a weapon attack.</li><li>1/Round, when you fail a Save, you can reroll it. You must take the new result if you do.</li></ul>",
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id":"tg_danger_zone"
      }
    ],
    "description": "<i>ARTIFACT STABILIZATION LOG<br/>RECORD: 2-095<br/><br/>[AUDIO TRANSCRIPTION FOLLOWS]<br/><br/>FIIIIRE! AHAHAHA! FIIIIIIIIRE!</i>"
  },
  {
    "id": "ice_lay_hands",
    "name": "SA 1-016 'LAY ON HANDS'",
    "type": "System",
    "sp": 3,
    "source": "ICE",
    "license": "HARBINGER",
    "license_level": 2,
    "actions": [
      {
        "activation": "Quick",
        "name": "LAY ON HANDS",
        "detail": "Clear one of the following conditions from an ally in an adjacent space, expending the amount of charges indicated:<ul><li><i>1 Charge:</i> Slowed, Impaired, Lock On</li><li><i>2 Charges:</i> Immobilized, Shredded</li><li><i>4 Charges:</i> Jammed, Stunned</li>" 
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_limited",
        "val": 4
      }
    ],
    "description": "<i>ARTIFACT STABILIZATION LOG<br/>RECORD: 1-016<br/><br/>THEY SAY THAT THE TOUCH OF A HOLY PERSON CAN PROVIDE HEALING TO OTHERS.<br/>ONE OF THE INTERNS SAYS THAT THIS SYSTEM AWAKENS THE HOLY SPIRIT OF THE MACHINE.<br/>NONSENSE.</i>"
  },
  {
    "id": "ice_evil_eye",
    "name": "SA 0-585 'NAZAR'",
    "type": "Tech",
    "sp": 3,
    "source": "ICE",
    "license": "HARBINGER",
    "license_level": 1,
    "actions": [
      {
        "activation": "Quick Tech",
        "name": "EVIL EYE",
        "detail": "Gain 2 Heat. You Mark a hostile target within Sensors, removing any Mark placed by this system from all other characters." 
      },
      {
        "activation": "Reaction",
        "name": "CURSEWARD",
        "frequency": "1/Round",
        "trigger": "A character Marked by this system takes any action that affects one of your allies.",
        "detail": "Clear your Mark and choose one:<ul><li>Invade your target, gaining +2 Accuracy on your Tech Attack. If your invade causes the action taken by your target to become impossible (e.g. by jamming them while they are trying to attack), the action is prevented but your target become immunes to EVIL EYE for the rest of the scene.</li><li>OVERWATCH the marked target. On your first against them, you deal 1d6 bonus Energy damage.</li></ul>" 
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "description": "<i>ARTIFACT STABILIZATION LOG<br/>RECORD: 0-585<br/><br/>THE NAZAR IS A TRADITIONAL CURSEWARD, DESIGNED TO KEEP AWAY THE 'EVIL EYE'.<br/>I DON'T BELIEVE IN MAGIC, BUT THIS SYSTEM PROVIDES UNUSUALLY RAPID INSIGHT INTO A PARTICULAR TARGETS INTENDED ACTION, SO I CHOSE THE DESIGNATION.<br/>IT SEEMS APPROPRIATE.</i>"
  },
  {
    "id": "ice_angelic_aspect",
    "name": "SA 2-777 'CONSECRATION'",
    "type": "Flight System",
    "sp": 4,
    "source": "ICE",
    "license": "HARBINGER",
    "license_level": 3,
    "actions": [
      {
        "activation": "Full",
        "name": "HALLOW",
        "frequency": "1/Scene",
        "detail": "Until the end of combat:<ul><li>You can count any and all of your movement as Flying.</li><li>You gain resistance to one of Kinetic, Energy or Explosive damage.</li><li>Any Heat you would cause to other characters becomes AP Energy damage instead.</li><li>You gain +2 Accuracy on Hull, Agility, and Systems saves, but +2 Difficulty on Engineering saves.</li><li>You take 2 Burn at the start of each of your turns. Burn caused by this system cannot be reduced or prevented in any way.</li></ul>You may not deactivate this system manually: it may only be deactivated by combat ending." 
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_limited",
        "val": 1
      }
    ],
    "description": "<i>ARTIFACT STABILIZATION LOG<br/>RECORD: 2-777<br/><br/>YOU CAN SAVE THEM. YOU CAN SAVE THEM. YOU CAN SAVE THEM. YOU CAN SAVE THEM. YOU CAN SAVE THEM.</i>"
  }
]
