[
  {
    "id": "asg_big_missile",
    "name": "BDM",
    "type": "System",
    "sp": 3,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_limited",
        "val": "2"
      }
    ],
    "source": "ASG",
    "license": "NIDHOGG",
    "license_level": 3,
    "effect": "The missiles provided by this system were not designed for use on a mech: they are launched from the exterior of the chassis and may be targeted as a deployable that shares a space with you while they are primed. A primed missile shares your evasion, is immune to tech actions and has (10 + twice your Hull) HP, resistance to Kinetic and Energy damage, and immunity to Burn. If the missile is reduced to 0 HP, it detonates: you lose one charge and the missile deals damage as though you were the target of the strike. You can not use the actions provided by this system if you are Jammed.",
    "actions": [
      {
        "activation": "Quick",
        "name": "Prime Missile",
        "detail": "You prepare for a ballistic strike, readying a missile into its launch position. When you begin readying a missile, you are Immobilized, and the missile becomes a valid target for attacks. These effects last until you cancel the launch as a free action or launch the missile. At the start of your next turn, you fully prime the missile, gaining access to the <i>Ballistic Launch</i> action. You may not take this action more than 1/turn for any reason."
      },
      {
        "activation": "Full",
        "name": "Ballistic Launch",
        "detail": "You may only use this action after a missile is fully primed. Expend a charge to launch a missile at a target affected by Lock On. Lock On is consumed, and the target and all characters and objects in a Burst 3 area around them take 3d6+6 AP Explosive damage, which ignores Resistance and Immunity to Explosive damage. All characters besides the primary target must attempt a Hull Save or be Stunned until the start of their next turn. The primary target is Stunned until the end of their next turn, without the ability to make a Save."
      }
    ],
    "description": "An ASGARD Class-3 BDM (which stands for \"Ballistic Dispersion Missile\" and not \"Big Damn Missile\", contrary to what many believe), is actually a fairly small missile in the context it was originally designed for: space-based ship to ship combat. However, large scale naval combat became less and less common, the commercial demand for batteries of missiles began to shrink. Rather than limit their manufacturing, ASGARD instead developed a novel blinkspace storage system which allows them to be deployed from a remote location to ground vehicles and mechs. Simply load a friendly satellite with a few BDMs, then watch as your enemies flee in terror at the sight of an Everest preparing to launch a 5 meter long missile from its back—at least until they realize that they can shoot at it."
  },
  {
    "id": "asg_dreadnought_engine",
    "name": "Dreadnought Thermal Engine",
    "type": "System",
    "sp": 1,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_danger_zone"
      }
    ],
    "source": "ASG",
    "license": "NIDHOGG",
    "license_level": 2,
    "effect": "Your speed is reduced by 3 minus your size, rounded up, as long as this system is installed. While you are in the Danger Zone, you may take 1 Heat to Boost as a free action 1/round. If you do, all adjacent allied Characters may move the same number of Spaces as a reaction.",
    "description": "A thermal engine used to provide some extra power for Dreadnoughts, <i>slightly</i> miniaturized."
  },
  {
    "id": "asg_ai_valkyrie",
    "type": "AI",
    "name": "VALKYRIE-Class NHP",
    "sp": 3,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_ai"
      },
      {
        "id": "tg_heat_self",
        "val": 2
      },
      {
        "id": "tg_aura",
        "val": 4
      }
    ],
    "source": "ASG",
    "license": "NIDHOGG",
    "license_level": 3,
    "effect": "While this system's Aura is active, you are Immobilized, your Evasion is reduced to 5, your EDef is incresed to 10 if it is lower, and you and all allied Mechs within this system's Aura gain +1 Accuracy and +3 Range when attacking with Cannon, Launcher, or Ordnance weapons. On a critical hit with an affected weapon, the target takes 1d6 bonus Explosive damage.",
    "description": "VALKYRIE has been ASGARD's NHP of choice for siege platforms almost since the founding of the company. VALKYRIE-class NHPs are generally friendly and just a bit too enthusiastic about blowing things up, which makes them a perfect fit for ASGARD's preferred method of operation."
  },
  {
    "id": "asg_lockdown",
    "name": "Asgard Lockdown System",
    "type": "System",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_shield"
      },
      {
        "id": "tg_limited",
        "val": 3
      },
      {
        "id": "tg_indestructible"
      }
    ],
    "source": "ASG",
    "license": "NIDHOGG",
    "license_level": 1,
    "effect": "You may deploy a Lockdown System to a free adjacent space. Deploying the Lockdown System does not consume charges, and a new Lockdown System may be deployed without penalty if an active one is destroyed. Only one Lockdown System may be deployed at a time. While the Lockdown System is deployed, you gain the Active Defense reaction.",
    "deployables": [
      {
        "type": "Drone",
        "name": "Lockdown System",
        "activation": "Quick",
        "detail": "This Drone has Resistance to explosive damage. Gain the Active Defense reaction.",
        "size": 0.5,
        "hp": "10",
        "actions": [
          {
            "name": "Active Defense",
            "activation": "Reaction",
            "trigger": "A Mech makes an attack with a Launcher, Cannon, Smart, or Seeking weapon that would pass through a Burst 1 area around the Lockdown System before reaching the targeted Mech or space.",
            "frequency": "1/Round",
            "detail": "Expend a charge to prevent the attack entirely. The action used to make the attack is still lost."
          }
        ]
      }
    ],
    "description": "The ASGARD Lockdown System provides hard kill protection in an area by releasing targeted electro-kinetic pulses to disrupt the targeting or disable the payload of many kinds of munitions. It won't stop bullets, but it can stop most anything else."
  },
  {
    "id": "asg_ai_fenrisii",
    "name": "Mark II FENRISWOLF-Class NHP",
    "type": "AI",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_ai"
      }
    ],
    "source": "ASG",
    "license": "FENRIR",
    "license_level": 3,
    "actions": [
      {
        "activation": "Quick",
        "name": "Jaws of the Wolf",
        "detail": "Scoop up an adjacent, willing, and friendly non-Mech character into your mech's arms. While held, the target gains hard cover while still being able to take all actions as normal. Furthermore, any time the held target would take damage, you may redirect that damage to your mech. The held character can jump free as a part of their movement."
      },
      {
        "activation": "Free",
        "name": "Down the River Ván",
        "detail": "Throw a held character up to Range 5. If the target is friendly, they can choose to enter a friendly mech or Jockey a hostile mech that they would pass through or adjacent to during the throw as a Reaction. They receive +1 Accuracy and the target receives +1 Difficulty if they attempt to Jockey. While being thrown, the character does not provoke reactions."
      }
    ],
    "description": "By separating the Fenriswolf NHP from the Fenrir's architecture, it gained increased awareness of the fragility of the pilots it interacted with. It did retain its reckless and aggressive nature, however, leading to the invention of some <i>unorthodox</i> techniques."
  },
  {
    "id": "asg_beasthunter_knife",
    "name": "Beasthunter Tactical Knife",
    "type": "System",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "ASG",
    "license": "FENRIR",
    "license_level": 1,
    "actions": [
      {
        "activation": "Free",
        "name": "Beasthunter",
        "frequency": "1/Round",
        "detail": "You may only take this action immediately after you make a melee attack against a target you are grappling. Make a melee weapon attack with the following profile:<br>Aux Melee, Reliable 1<br>Range 1, 1d3 Kinetic Damage.<br/>If your target is Biological or a larger Size than you, you may immediately make a second attack with this weapon against the same target."
      }
    ],
    "description": "The Beasthunter™ Tactical Knife was designed specifically as a backup weapon, to be used in close combat when all other options have failed. However, as its name suggests, it was often used by pilots hunting down large prey in the depths of space, and modifications were made to better enable this particular use."
  },
  {
    "id": "asg_reverse_beartrap",
    "name": "REVERSE BEARTRAP",
    "type": "System",
    "sp": 4,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_limited",
        "val": 1
      }
    ],
    "source": "ASG",
    "license": "FENRIR",
    "license_level": 2,
    "actions": [
      {
        "activation": "Full",
        "name": "The Game",
        "detail": "Choose an adjacent Mech. The target must succeed at an Agility save or have a Reverse Beartrap attached to them. A charge is only expended if the device is attached successfully.<br>Once a Beartrap is attached to a target, it will explode at the end of their next turn, ripping open their cockpit and allowing the pilot to be targeted by systems and attacks directly at -2 Difficulty. Enemies with the Ultra template can destroy the Beartrap as a Full Action, removing it safely and preventing further Beartraps from being attached to them."
      }
    ],
    "description": "A horrific device that attempts to rip a mech's cockpit open, apparently originally designed for use on humans and scaled up for use on mechs. ASGARD public relations has disavowed its use."
  },
  {
    "id": "asg_disposable_heatsink",
    "name": "Disposable Heatsinks",
    "type": "System",
    "tags": [
      {
        "id": "tg_limited",
        "val": 6
      }
    ],
    "effect": "When this System is reduced to 0 charges, it is destroyed. You may spend 2 Repairs to restore all of this System's charges. If you do, it is also fixed if it was destroyed.",
    "actions": [
      {
        "activation": "Reaction",
        "name": "Shunt Heat",
        "trigger": "You take Heat from any source, including yourself.",
        "detail": "Expend any number of charges. The Heat you would receive is reduced by 1 for each charge expended.",
        "frequency": "1/turn"
      }
    ]
  },
  {
    "id": "asg_command_system",
    "name": "HEIMDALL Nanobot Command System",
    "type": "System",
    "sp": 4,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_aura",
        "val": 15
      }
    ],
    "source": "ASG",
    "license": "JORMUNGANDR",
    "license_level": 3,
    "effect": "While this system is active, you are Immobilized, your Evasion is reduced to 5 if it is greater, and you project a field of nanomachines that can influence the battlefield. All Drones and Deployables of your choice within this System's Aura regain 5 HP at the start of each of your turns and gain resistance to all damage, Heat and Burn while this System is active. In addition, you gain access to this system's actions, which may only be used while this System's Aura is active.",
    "actions": [
      {
        "activation": "Quick Tech",
        "name": "Defend Order",
        "detail": "An allied Mech, Drone, or object within this System's Aura gains 5 Overshield. Drones and Deployables gain twice this amount."
      },
      {
        "activation": "Quick Tech",
        "name": "Warp Order",
        "frequency": "1/Round",
        "detail": "An allied Mech, Drone, or object within this System's Aura is teleported up to 5 spaces in any direction of your choice."
      },
      {
        "activation": "Quick Tech",
        "name": "Dissolve Order",
        "detail": "A Drone or object within this System's Aura takes 10 AP kinetic damage. Each object or Drone may only be targeted 1/round."
      }
    ],
    "deployables": [
      {
        "type": "Mine",
        "name": "Nanite Mine",
        "activation": "Quick Tech",
        "detail": "This Mine may be placed anywhere within this System's Aura. Only one Nanite mine may be deployed per round. All characters within a Burst 1 area must pass a Hull Save or take 1d3+3 Explosive damage. On a success, they take half damage."
      }
    ],
    "description": "The Heimdall command system hijacks a mech's computers to generate a large nanite field that can directly control a large fleet of drones. While the mech's defensive routines will be largely disabled, it will be able to secure a large area through its capabilities as a command post."
  },
  {
    "id": "asg_spare_drone_parts",
    "name": "XS-Series Drone Parts",
    "type": "System",
    "sp": 2,
    "source": "ASG",
    "license": "JORMUNGANDR",
    "license_level": 2,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "actions": [
      {
        "name": "XS5 Sentry Microgun",
        "activation": "Reaction",
        "trigger": "A character begins a turn or enters a space within Range 7 of one of your deployed Drones.",
        "detail": "Make a ranged attack with the chosen Drone against the triggering character. If the attack hits, it deals 6 Kinetic damage to the target. If the target has at least 1 Armor and isn't Shredded, they gain Resistance to this damage."
      },
      {
        "name": "XS18 Thermal Micromissiles",
        "activation": "Reaction",
        "trigger": "A character gains Heat or Burn within Range 10 of one of your deployed Drones.",
        "detail": "Make a Smart ranged attack with the chosen Drone with +1 Accuracy against the triggering character. If the attack hits, it deals 3 Explosive damage to the target and they also gain 2 Heat."
      },
      {
        "name": "XS31 Miniature Napalm Gun",
        "activation": "Reaction",
        "trigger": "A character begins a turn or enters a space within Range 3 of one of your deployed Drones.",
        "detail": "Make a Line 3 ranged attack with the chosen Drone against the triggering character. Each character hit by the attack takes 2 Burn."
      }
    ],
    "effect": "When you deploy a drone, it is deployed with a special integrated weapon with limited ammunition. When you use one of the Reactions granted by this system, you consume all of the ammunition on that Drone and cannot use it for this System's reactions unless you undeploy and redeploy it. All attacks made with this System gain your Grit as a bonus to the roll.",
    "description": "The XS-Series is a mass-produciton kit provided by ASGARD to allow clever engineers to add concealed weaponry to drones that would not normally provide fire support in the field. ASGARD pilots familiar with this system tend to excersice caution around all drones, no matter how innocuous they may seem."
  },
  {
    "id": "asg_bomb_bag",
    "name": "Explosives Satchel",
    "type": "System",
    "sp": 2,
    "source": "ASG",
    "license": "JORMUNGANDR",
    "license_level": 1,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_limited",
        "val": "2"
      }
    ],
    "effect": "Whenever you would expend a charge from a system with the Mine or Grenade tag, you may expend a charge from this system instead.",
    "description": "It's a heat-proof bag meant to store extra components to make explosives. It's not complex, but it certainly has merit."
  },
  {
    "id": "asg_r1_concussion",
    "name": "R1 Concussion Charges",
    "type": "System",
    "sp": 2,
    "source": "ASG",
    "license": "JORMUNGANDR",
    "license_level": 1,
    "actions": [
      {
        "activation": "Quick",
        "name": "R1 Concussion Grenade",
        "range": [
          {
            "type": "Range",
            "val": 5
          },
          {
            "type": "Blast",
            "val": 1
          }
        ],
        "damage": [
          {
            "type": "Explosive",
            "val": "3"
          }
        ],
        "detail": "Throw a Concussion Grenade within Range 5. All characters within a Burst 1 area must pass a Hull save or take 3 Explosive damage and be Impaired until the end of their next turn. On a success, they are not Impaired."
      }
    ],
    "deployables": [
      {
        "type": "Mine",
        "name": "R1 Concussion Mine",
        "activation": "Quick",
        "detail": "All characters in a Burst 1 area must pass a Hull save or take 1d3+3 Explosive damage and be Impaired and Shredded until the end of their next turn. On a success, they are not Shredded and take a maximum of 3 damage."
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_grenade"
      },
      {
        "id": "tg_limited",
        "val": 3
      }
    ],
    "description": "These shockwave generating charges deal limited direct damage compared to conventional explosives, but they are capable of damaging computer systems through dense mech armor."
  },
  {
    "id": "asg_laser_scan_grenades",
    "name": "Full Spectrum Hunt/Kill System",
    "type": "System",
    "sp": 3,
    "source": "ASG",
    "license": "JORMUNGANDR",
    "license_level": 3,
    "actions": [
      {
        "activation": "Quick",
        "name": "UV Recon Grenade",
        "range": [
          {
            "type": "Range",
            "val": 5
          },
          {
            "type": "Blast",
            "val": 3
          }
        ],
        "detail": "Throw a UV Recon Grenade within Range 5. All characters in a Burst 3 Area must pass a Systems save or suffer the following effects until the end of their next turn:<ul><li>Tech actions may target affected characters even without line of sight.</li><li>Affected characters cannot Hide or benefit from Invisible.</li><li>Drone, Seeking and Nexus weapons gain +1 Accuracy against affected characters.</li></ul>Targets affected by Lock On automatically fail this save. If at least one target is affected by this grenade, you may deploy your IR Seeker Drone or move it up to 3 spaces as a free action."
      }
    ],
    "deployables": [
      {
        "type": "Drone",
        "name": "IR Seeker Drone",
        "activation": "Quick",
        "evasion": "10",
        "detail": "Deploying this drone does not consume one of this system's charges, and it may be deployed to any free, adjacent space. Only one IR Seeker Drone may be deployed at a time. If the drone is destroyed, you may expend a charge to immediately recall and repair it.",
        "edef": "10",
        "size": 0.5,
        "hp": "10",
        "actions": [
          {
            "name": "Hunt/Kill",
            "activation": "Free",
            "frequency": "1/Round",
            "detail": "Move this drone up to 3 spaces, then make a Smart ranged attack against an enemy Mech within range 3 of it with it, gaining your Grit as a bonus to the roll. On a hit, it deals 1d3 Energy damage. Against targets currently affected by a UV Recon Grenade, it deals an additional 3 Energy damage and applies Lock On on hit."
          }
        ]
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_grenade"
      },
      {
        "id": "tg_limited",
        "val": 4
      }
    ],
    "description": "This high-end recon system was designed by ASGARD's software team as a tactical breaching suite that could be used to locate and neutralize threats before they even had a chance to respond. While it has not yet been heavily field tested, ASGARD has high hopes that it will be widely adopted."
  },
  {
    "id": "asg_martial_doctrine_3",
    "name": "Martial Doctrine III",
    "type": "System",
    "sp": 4,
    "source": "ASG",
    "license": "DRAUGR",
    "license_level": 3,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "effect": "Gain increasing benefits based on the number of Martial Doctrine systems installed:<ul><li>1+: You may make Improvised Attacks as a quick action as long as you aren't Jammed.</li><li>2+: Your Improvised Attacks deal 1d6 bonus Kinetic damage on a critical hit.</li><li>3: Your Improvised Attacks count as attacks with Main Melee weapons.</li></ul>This effect is shared between all Martial Doctrine systems and only applies once.",
    "actions": [
      {
        "name": "Martial Stance: Core Ripper",
        "activation": "Protocol",
        "detail": "Gain 2 heat. Until the end of the turn, if you damage a target you are Grappling with an Improvised Attack, the target must succeed on a Hull Save or become Exposed. This can only target a character 1/Scene.<br/><i>Only one Martial Stance Protocol may be activated on a turn.</i>"
      },
      {
        "name": "Combo: Suplex",
        "activation": "Free",
        "detail": "Make a melee attack against a character you are Grappling that is the same Size as you or smaller. If the attack lands, they take 2d6 Kinetic damage, are knocked Prone, and are moved to the space opposite you from their current position. You are also knocked prone on a successful attack. You may only take this action immediately after dealing damage with an Improvised Attack.",
        "frequency": "1/Round"
      }
    ],
    "description": "The \"Martial Doctrine\" are a set of emergency subroutines that improve a mech's capabilities in the situation that it is forced into disarmed combat. Though they were distributed by ASGARD in three different releases, they were clearly intended to form a greater whole, as each version has hidden code that only activates in the presence of the others."
  },
  {
    "id": "asg_martial_doctrine_2",
    "name": "Martial Doctrine II",
    "type": "System",
    "sp": 3,
    "source": "ASG",
    "license": "DRAUGR",
    "license_level": 2,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "effect": "Gain increasing benefits based on the number of Martial Doctrine systems installed:<ul><li>1+: You may make Improvised Attacks as a quick action as long as you aren't Jammed.</li><li>2+: Your Improvised Attacks deal 1d6 bonus Kinetic damage on a critical hit.</li><li>3: Your Improvised Attacks count as attacks with Main Melee weapons.</li></ul>This effect is shared between all Martial Doctrine systems and only applies once.",
    "actions": [
      {
        "name": "Martial Stance: Brutalizer",
        "activation": "Protocol",
        "detail": "Gain 1 heat. Until the end of the turn, your Improvised Attacks gain Knockback 3. 1/Round, after inflicting Knockback as part of any Melee Attack, you may move an equal number of spaces towards the same target by the most direct route possible.<br/><i>Only one Martial Stance Protocol may be activated on a turn.</i>"
      },
      {
        "name": "Combo: Hullbreaker",
        "activation": "Free",
        "detail": "Make a melee attack against a target you damaged with an Improvised Attack this turn. On a success, you slam them into an object or Mech adjacent to them, dealing 3 Kinetic damage to both targets. Objects take 10 AP Kinetic damage instead. You may only take this action immediately after dealing damage with an Improvised Attack.",
        "frequency": "1/Round"
      }
    ],
    "description": "The \"Martial Doctrine\" are a set of emergency subroutines that improve a mech's capabilities in the situation that it is forced into disarmed combat. Though they were distributed by ASGARD in three different releases, they were clearly intended to form a greater whole, as each version has hidden code that only activates in the presence of the others."
  },
  {
    "id": "asg_martial_doctrine_1",
    "name": "Martial Doctrine I",
    "type": "System",
    "sp": 3,
    "source": "ASG",
    "license": "DRAUGR",
    "license_level": 1,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "effect": "Gain increasing benefits based on the number of Martial Doctrine systems installed:<ul><li>1+: You may make Improvised Attacks as a quick action as long as you aren't Jammed.</li><li>2+: Your Improvised Attacks deal 1d6 bonus Kinetic damage on a critical hit.</li><li>3: Your Improvised Attacks count as attacks with Main Melee weapons.</li></ul>This effect is shared between all Martial Doctrine systems and only applies once.",
    "actions": [
      {
        "name": "Martial Stance: Hunter",
        "activation": "Protocol",
        "detail": "Gain 2 heat. Once this turn, you may Boost towards a target as a part of an Improvised Attack. If you do, you gain +1 Accuracy on that attack.<br/><i>Only one Martial Stance Protocol may be activated on a turn.</i>"
      },
      {
        "name": "Combo: Haymaker",
        "activation": "Free",
        "detail": "Make a melee attack against a target you damaged with an Improvised Attack this turn. On a success, your target is Slowed and Impaired until the end of your next turn. You may only take this action immediately after dealing damage with an Improvised Attack.",
        "frequency": "1/Round"
      }
    ],
    "description": "The \"Martial Doctrine\" are a set of emergency subroutines that improve a mech's capabilities in the situation that it is forced into disarmed combat. Though they were distributed by ASGARD in three different releases, they were clearly intended to form a greater whole, as each version has hidden code that only activates in the presence of the others."
  },
  {
    "id": "asg_pyrokins",
    "name": "Pyrokins",
    "type": "System",
    "sp": 2,
    "source": "ASG",
    "license": "MUNINN",
    "license_level": 1,
    "tags": [
      {
        "id": "tg_grenade"
      },
      {
        "id": "tg_limited",
        "val": 2
      }
    ],
    "actions": [
      {
        "activation": "Quick",
        "name": "Launch Pyrokins",
        "range": [
          {
            "type": "Cone",
            "val": 3
          }
        ],
        "damage": [
          {
            "type": "Explosive",
            "val": 2
          },
          {
            "type": "Heat",
            "val": 1
          }
        ],
        "detail": "Launch a barrage of pyrokins, dealing 2 Explosive and 1 Heat damage to all characters in a cone."
      }
    ],
    "effect": "Whenever you take Structure or Stress damage, you regain up to 2 uses of this system.",
    "description": "Pyrokins themselves are a type of sharp disk-like metal projectile coated in a basic explosive powder. The pyrokin launcher contains a basic forge manned by tiny microbots, akin to a nexus, that can process damaged scrap severed from a mech's hull into more pyrokins during the middle of a battle."
  },
  {
    "id": "asg_skadi_nhp",
    "name": "SKADI-Class NHP",
    "type": "System",
    "sp": 3,
    "source": "ASG",
    "license": "MUNINN",
    "license_level": 3,
    "tags": [
      {
        "id": "tg_ai"
      },
      {
        "id": "tg_aura",
        "val": 15
      },
      {
        "id": "tg_heat_self",
        "val": 3
      }
    ],
    "effect": "Whenever Lock-On is consumed on a hostile character within this system's Aura and line of sight, you gain 1 Heat and immediately reapply Lock On to them.",
    "description": "The SKADI-class NHP is unusually focused on, in her words, 'the hunt'. Once locked on to a target, SKADI will not lose sight of them. This predilication extends to SKADI's interactions with humans, who can find her behavior obsessive and unnerving."
  },
  {
    "id": "asg_boost_buddy",
    "name": "\"Boost Buddy\" Exhaust Addon",
    "type": "System",
    "sp": 2,
    "source": "ASG",
    "license": "FAFNIR",
    "license_level": 1,
    "effect": "Whenever you Boost, you clear 1 Heat. Clearing Heat in this way does not trigger the effects of your own weapons, systems, core bonuses, or frame traits.",
    "description": "Mech boosters generate an noticeable amount of heat which are mitigated by sophisticated heatsinks which use the motion of air around the boosting Mech to reduce the chance of overheating. By routing some of the coolant of a mech's other systems through these air coolers, one achieves a tiny bit of additional passive cooling."
  },
  {
    "id": "asg_solid_fuel_booster",
    "name": "Solid Fuel Auxiliary Boosters",
    "type": "System",
    "sp": 3,
    "source": "ASG",
    "license": "FAFNIR",
    "license_level": 2,
    "tags": [
      {
        "id": "tg_limited",
        "val": 2
      },
      {
        "id": "tg_heat_self",
        "val": 3
      }
    ],
    "actions": [
      {
        "activation": "Free",
        "name": "Ignite Booster",
        "detail": "Move up to 10 Spaces in a straight line, stopping early only if you collide with an object or another character. If you stop early, you and the character or object you collided with take 1 Kinetic damage for every two spaces you moved.",
        "frequency": "1/Round"
      }
    ],
    "description": "Solid rocket boosters have been in use since humanities earliest endeavours in spaceflight. Though they have been entirely phased out for space launches in favor of more efficient and reusable systems, smaller modules can be used to give a mech a one time boost just when they need it."
  },
  {
    "id": "asg_firewatch",
    "name": "Firewatch Emergency System",
    "type": "System",
    "sp": 2,
    "source": "ASG",
    "license": "FAFNIR",
    "license_level": 2,
    "actions": [
      {
        "activation": "Protocol",
        "name": "Explosive Fire Suppression",
        "detail": "Trigger an explosive deployment of flame-retardant foam that saturates your mech both inside and out, clearing all Heat and Burn affecting you. Until the start of your next turn: you have resistance to Explosive and Energy damage and immunity to Burn and Heat, but your Speed is reduced to 4 and you are Slowed. Furthermore, on this turn you may only move and take one Quick Action: you may not Overcharge, take Free Actions, or take Full Actions. The negative effects of this system cannot be prevented and bypass immunity.",
        "frequency": "1/Combat"
      }
    ],
    "tags": [
      {
        "id": "tg_limited",
        "val": 1
      }
    ],
    "description": "The Firewatch Emergency System is designed to put out the fire <i>now</i>, regardless of any lingering consequences. The foam will evaporate after a delay to help with cleanup, but it <i>will</i> get in the way until then, or your money back."
  },
  {
    "id": "asg_dragonfly",
    "name": "DRAGONFLY Atmospheric Repositioning System",
    "type": "System",
    "sp": 3,
    "source": "ASG",
    "license": "FAFNIR",
    "license_level": 3,
    "actions": [
      {
        "activation": "Full Tech",
        "name": "Atmospheric Launch",
        "detail": "You gain 8 Heat and launch 30 Spaces directly upward before beginning to hover. After launching in this way, you cannot take any actions other than the Dragonfly protocol granted by this system, but you cannot be targeted or affected by any other mech's actions. At the start of your turn, if you choose not to use the Dragonfly protocol, you remain hovering and gain 2 Heat. If your mech has the ability to fly, you can choose to drop to a height of 10 Spaces an begin flying normally, instead.<br/><br/>Activating this system indoors causes the mech to collide with the ceiling, Stunning them until the start of their next turn and causing them to immediately fall to the ground where they launched from. When colliding with thin barriers, the mech may punch through instead of falling back to the ground, which can cause disastrous explosive decompression on space vessels."
      },
      {
        "activation": "Protocol",
        "name": "Dragonfly",
        "detail": "You rocket towards the ground, landing in any space on the battlefield. You deal 1d6 Explosive damage to and knock Prone all characters within Burst 2 of your landing spot.<br/><br/><i>You may only use this Protocol while hovering from the effect of Atmospheric Launch.</i>",
        "frequency": "1/Round"
      }
    ],
    "effect": "All actions granted by this system are considered movement and cannot be taken while Slowed or Immobilized.",
    "description": "The DRAGONFLY is similar in construction to other flight systems, albiet much bulkier and less flexibile. What it sacrifices in general utility it makes up for with vertical launch power, allowing for mechs to reposition themselves on the battlefield with explosive speed."
  },
  {
    "id": "lumico_fugue_system",
    "name": "Fugue System",
    "type": "Tech",
    "sp": 3,
    "source": "LUMICO",
    "license": "VIRTUOSO",
    "license_level": 2,
    "actions": [
      {
        "activation": "Invade",
        "name": "Fugue Polyphony",
        "detail": "This Invade option does not cause the target to take any Heat. All attacks against the target gain +1 Accuracy and a final attack roll against the target cannot be affected by difficulty. This effect lasts until the target is hit by an attack. The attack that consumes this effect deals 1d6 bonus Energy damage. Only one target may be under this effect at a time: using this action on a new target ends the effect on all others, even if the Invade misses."
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_luxury",
        "val": 1
      }
    ],
    "description": "The Lumiera Corporation Fugue System synchronizes the target's active defenses and evasive algorithms into operating at a synchronized frequency, causing gaps to appear in the target's defenses at regular intervals."
  },
  {
    "id": "lumico_choreograph_system",
    "name": "Choreograph System",
    "type": "Tech",
    "sp": 2,
    "source": "LUMICO",
    "license": "VIRTUOSO",
    "license_level": 1,
    "actions": [
      {
        "activation": "Invade",
        "name": "Closed Position: Waltz",
        "detail": "When any character makes an attack that affects an area (i.e., a Line, Cone, Burst, or Blast), you may force the target to move up to 3 spaces toward the affected area as a Reaction. If they would become a target of the attack, the attack gets +1 Accuracy against them, and they get +1 Difficulty on any Saves they must make as a result of the attack. This effect remains on a target until it is used."
      },
      {
        "activation": "Invade",
        "name": "Closed Position: Tango",
        "detail": "The target is pulled adjacent to their nearest ally within Range 6, then must attempt to Grapple that ally with +1 Accuracy. If successful, the target's ally also gains 2 Heat. This Grapple cannot be ended by either party until the end of your next turn."
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_luxury",
        "val": 1
      }
    ],
    "description": "Anything can be art, claims Lumiera Corporation, even battle. If hostile actors introduce chaos, take control and show them where they are <i>supposed</i> to be."
  },
  {
    "id": "lumico_nova_recorder",
    "name": "NOVA Fragment: Record",
    "type": "Tech",
    "sp": 4,
    "source": "LUMICO",
    "license": "PHILOSOPHER",
    "license_level": 2,
    "actions": [
      {
        "activation": "Invade",
        "name": "REQUEST: RECORD SEQUENCE",
        "detail": "You may use this Invade on Biological targets. Mark the current position of the target. Gain access to the REQUEST: ERASE SEQUENCE reaction, until that reaction is used. Only one target may be under this effect at a time: using this action on another target ends this effect on the original."
      },
      {
        "activation": "Reaction",
        "trigger": "Immediately before or after any character takes any action or movement, while the target of REQUEST: RECORD SEQUENCE is within Sensors.",
        "name": "REQUEST: ERASE SEQUENCE",
        "detail": "Gain 4 Heat. The target of REQUEST: RECORD SEQUENCE is returned to the marked position, and the effects of any actions they have taken this turn are undone."
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "description": "<i>\"NOVA is barely real, in a way we can understand. It operates in a different frame of reference. The physical device we see within the Philosopher is merely a shadow of the full mechanism, projected from a higher plane of existence. Even these fragments: they seem like they're seperate entities, but in reality, they're all part of the same machine, completely connected to NOVA in ways we can't see.\"</i>"
  },
  {
    "id": "lumico_nova_wish",
    "name": "NOVA Fragment: Wish",
    "type": "System",
    "sp": 3,
    "source": "LUMICO",
    "license": "PHILOSOPHER",
    "license_level": 3,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_limited",
        "val": "1"
      }
    ],
    "effect": "You may not regain uses of this systems, except during a Full Repair.",
    "actions": [
      {
        "activation": "Full",
        "name": "REQUEST: WISH GRANTED",
        "detail": "Expend a charge to take an action granted by any System without the Exotic Gear tag as a free action, even if you do not have the License for that system.<br>The GM has final say on how to interpret how the action will resolve in a given situation, but in general the player should be allowed to activate the chosen system in a way that is meaningful and as consistent with its normal use as possible."
      }
    ],
    "description": "<i>\"Have you ever wondered what things would be like if you were someone else—if you had chosen differently?\"</i>"
  },
  {
    "id": "lumico_pocket_star",
    "name": "Pocket Star",
    "type": "System",
    "sp": 4,
    "source": "LUMICO",
    "license": "PHILOSOPHER",
    "license_level": 3,
    "tags": [
      {
        "id": "tg_indestructible"
      },
      {
        "id": "tg_unique"
      }
    ],
    "effect": "During you a rest, you may activate this system to recharge your and one ally's core power. This system only has one use, regained when you make a Full Repair.",
    "description": "Lumico's Near-Zero-Mass Fusion Reactor, internally dubbed the \"Pocket Star\", provides an ingenious method of storing energy. Originally intented to fulfill a similar role to a mech's standard reactor, logistical issues related to actually <i>extracting</i> the energy produced by the Pocket Star meant that it was more valuable as an emergency reserve of energy rather than as a primary power source."
  },
  {
    "id": "lumico_nova_predict",
    "name": "NOVA Fragment: Predict",
    "type": "System",
    "sp": 2,
    "source": "LUMICO",
    "license": "PHILOSOPHER",
    "license_level": 1,
    "actions": [
      {
        "activation": "Invade",
        "name": "REQUEST: AVOID SEQUENCE",
        "detail": "Choose a character. Until the end of your target's next turn, each instance of damage dealt by your target to the chosen character is reduced to 1."
      },
      {
        "activation": "Invade",
        "name": "REQUEST: PREFER SEQUENCE",
        "detail": "Choose an unobstructed space within your line of sight and Range 6 of the target's current location. Your target takes 2 Heat at the end of each of their turns until they end a turn on that space. Your target does not gain any heat from this effect if the chosen space is totally inaccessible to them (e.g. if an object is obstructing the space or if a barrier, such as a bulkhead, entirely prevents them from reaching the space)."
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_luxury",
        "val": "1"
      }
    ],
    "description": "<i>\"How does NOVA predict the future? It doesn't, really. It travels to a point in time in the near future, records what it sees, then returns so that the user can review its logs. Nothing as arcane as 'prediction.'\"</i>"
  },
  {
    "id": "lumico_black_hole",
    "name": "Nanoscopic Black Hole Projector",
    "type": "System",
    "sp": 3,
    "source": "LUMICO",
    "license": "PHILOSOPHER",
    "license_level": 2,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_aura",
        "val": 3
      },
      {
        "id": "tg_limited",
        "val": 3
      }
    ],
    "actions": [
      {
        "activation": "Quick Tech",
        "name": "Gravitational Crush",
        "detail": "You may only take this action if this system's Aura is active. All characters within the Aura must make a Hull save or take 1d6 Energy damage and be pulled up to 2 spaces toward the center of the Aura and Immobilized until the end of their next turn. On a success, they only take the damage. Characters within the <i>Event Horizon</i> take 2d6 AP Energy damage, which cannot be reduced in any way, instead. Objects within the Aura take 20 AP Energy damage. Using this action does not consume charges from this system.",
        "frequency": "1/Round"
      }
    ],
    "effect": "When this Aura is activated, choose a point within sensors. This system's Aura is centered on that point, rather than the user.<br>Any character adjacent to or on the same space as the center of the Aura is within this system's <i>Event Horizon</i>. Characters within the Aura are Slowed and have resistance to all damage, Heat, and Burn from attacks.",
    "description": "By generating an extremely small but superdense mass, one can harness and direct gravitational waves to directly affect ambient energy. At this scale, Hawking radiation causes the object to degrade at a high speed and the object will evaporate if it is not actively maintained by the generator."
  },
  {
    "id": "lumico_babel",
    "name": "Babel System",
    "type": "System",
    "sp": 2,
    "source": "LUMICO",
    "license": "PHILOSOPHER",
    "license_level": 1,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "actions": [
      {
        "activation": "Reaction",
        "trigger": "An ally within Sensors is targeted by a hostile tech action, before any Invade rolls are made.",
        "name": "Activate Babel System",
        "detail": "You redirect the effect of the action to yourself. You may only use this effect on each ally once per scene.",
        "frequency": "1/Round"
      }
    ],
    "description": "In the event of an emergency, the \"Babel\" System generates a cypher that causes an enemy to mistakenly target the system's user, instead. The system is somewhat basic, by Lumiera Corporation's standards, and generally will only confuse a hostile system if it isn't actively correcting for the interference."
  },
  {
    "id": "lumico_lullaby",
    "name": "The Lullaby",
    "type": "System",
    "sp": 3,
    "source": "LUMICO",
    "license": "TRAILBLAZER",
    "license_level": 3,
    "effect": "While this system's Aura is active:<ul><li>You cannot take tech actions.</li><li>You are immune to the effect of tech actions.</li></ul>After a character within this system's Aura attacks you, they are Jammed until the end of the current turn.",
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_aura",
        "val": 5
      },
      {
        "id": "tg_heat_self",
        "val": 2
      }
    ],
    "description": "Lumiera Corporation's \"Lullaby\" system projects a chaotic signal that disrupts the operation of mech systems, preventing them from accurately targeting the source of the signal. During testing, however, pilots of mechs targeted by the Lullaby's signal reported extreme distress, citing phantom sounds produced within the cockpit. Lumiera Corporation intended to delay its release but an error caused the system to be released to the public anyway."
  },
  {
    "id": "lumico_lamplighter",
    "name": "Lamplight Chemical Charges",
    "type": "System",
    "sp": 2,
    "source": "LUMICO",
    "license": "TRAILBLAZER",
    "license_level": 1,
    "actions": [
      {
        "activation": "Quick",
        "name": "Lamplight Oil Grenade",
        "range": [
          {
            "type": "Range",
            "val": 5
          }
        ],
        "detail": "Throw a Lamplight Grenade within Range 5. The target must succeed on an Agility save or become coated in an unstable substance. Coated targets are Slowed and do not benefit from Invisibility unless the substance is removed, which affected characters may do as a quick action. When a coated target receives any Heat or Burn, the substance degrades explosively, removing the coating and causing the affected target to take 1d6 AP Explosive damage."
      }
    ],
    "deployables": [
      {
        "type": "Mine",
        "name": "Lamplight Tar Mine",
        "activation": "Quick",
        "detail": "All characters in a Burst 1 area must succeed on an Agility save or become coated, as above. However, the substance Immobilizes affected characters instead of Slowing them and requires a Full Action to remove."
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_grenade"
      },
      {
        "id": "tg_limited",
        "val": 4
      }
    ],
    "description": "Inspired by olden tales of tar bombs used by pioneers in the pre-spaceflight era, the Lamplight Grenade deploys a volatile chemical payload that detonates after receiving a small amount of sustained agitation."
  },
  {
    "id": "lumico_fastball",
    "name": "Fastball Charges",
    "type": "System",
    "sp": 2,
    "source": "LUMICO",
    "license": "SAVANT",
    "license_level": 1,
    "actions": [
      {
        "activation": "Quick",
        "name": "Heater",
        "range": [
          {
            "type": "Range",
            "val": 5
          }
        ],
        "damage": [
          {
            "type": "Explosive",
            "val": 3
          }
        ],
        "detail": "Choose a target within Range. They take 3 AP Explosive damage and are knocked Prone."
      }
    ],
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_grenade"
      },
      {
        "id": "tg_limited",
        "val": 3
      }
    ],
    "description": "<i>Give 'em the heater.</i>"
  }
]
