[
  {
    "id": "mw_nidhogg_integrated",
    "name": "Roots of Yggdrasil",
    "mount": "Superheavy",
    "type": "Cannon",
    "effect": "When using this weapon, choose three valid targets to attack. The same character can be chosen up to three times, in which case you roll an additional attack against that character for each additional time they were targeted. Reliable damage dealt by this weapon is always Kinetic damage.",
    "profiles": [
      {
        "name": "Recon Mode",
        "damage": [
          {
            "type": "Kinetic",
            "val": "1d3"
          }
        ],
        "range": [
          {
            "type": "Range",
            "val": 10
          }
        ],
        "actions": [
          {
            "activation": "Protocol",
            "name": "Activate Fortress Mode",
            "detail": "Activate this weapon's Fortress mode."
          }
        ],
        "tags": [
          {
            "id": "tg_reliable",
            "val": 1
          }
        ],
        "effect": "You may use this weapon with Skirmish and Overwatch in Recon Mode. If you do, you only make one attack. At the end of your turn, choose one target that was damaged by this weapon this turn and apply Lock On to them."
      },
      {
        "name": "Fortress Mode",
        "damage": [
          {
            "type": "Kinetic",
            "val": "1d6"
          }
        ],
        "range": [
          {
            "type": "Range",
            "val": 10
          }
        ],
        "actions": [
          {
            "activation": "Protocol",
            "name": "Activate Recon Mode",
            "detail": "Activate this weapon's Recon mode."
          }
        ],
        "effect": "Your speed is halved while in this mode.<br>Attacks made against targets affected by Lock On deal 1 bonus Explosive damage and are Armor Piercing and Accurate.",
        "tags": [
          {
            "id": "tg_ordnance"
          },
          {
            "id": "tg_reliable",
            "val": 1
          }
        ]
      },
      {
        "name": "Annihilation Mode",
        "damage": [
          {
            "type": "Kinetic",
            "val": "1d6"
          }
        ],
        "range": [
          {
            "type": "Range",
            "val": 10
          }
        ],
        "effect": "This mode may only be activated through the Nidhogg's core power.<br>While in this mode:<ul><li>You may choose an additional 3 targets when attacking.</li><li>The target of each attack and all adjacent Characters take 1 Explosive damage even if the attack misses.</li><li>You may not clear Heat by any means other than Overheating.</ul></ul>",
        "on_hit": "Increases the Explosive damage caused by the attack to 3.",
        "tags": [
          {
            "id": "tg_ordnance"
          },
          {
            "id": "tg_ap"
          },
          {
            "id": "tg_reliable",
            "val": 1
          },
          {
            "id": "tg_heat_self",
            "val": 3
          }
        ],
        "actions": [
          {
            "activation": "Free",
            "name": "End Annihilation Mode",
            "detail": "Immediately activates Recon or Fortress mode."
          }
        ]
      }
    ],
    "description": "<i>From below the dragon dark comes forth, Nithhogg flying from Nithafjoll; The bodies of men on his wings he bears.</i>"
  },
  {
    "id": "mw_asg_snjobolti_turret",
    "name": "'Snjobolti' Ball Turret",
    "mount": "Heavy",
    "type": "CQB",
    "profiles": [
      {
        "name": "Automatic Targeting",
        "damage": [
          {
            "type": "Kinetic",
            "val": "1d6"
          }
        ],
        "range": [
          {
            "type": "Range",
            "val": 7
          }
        ],
        "tags": [
          {
            "id": "tg_inaccurate"
          }
        ]
      },
      {
        "name": "Manual Operation",
        "damage": [
          {
            "type": "Kinetic",
            "val": "1d6"
          }
        ],
        "range": [
          {
            "type": "Range",
            "val": 7
          },
          {
            "type": "Threat",
            "val": 5
          }
        ],
        "tags": [
          {
            "id": "tg_reliable",
            "val": 2
          }
        ],
        "actions": [
          {
            "activation": "Reaction",
            "name": "Emergency Exit",
            "trigger": "The gunner or the Mech this weapon is mounted on is damaged or destroyed, or if this weapon is destroyed by other means.",
            "detail": "Perform an emergency eject, allowing the character inside the turret to exit the turret and move to any location within range 3. This weapon is destroyed."
          }
        ],
        "effect": "The gunner may attack with this weapon twice by taking the Barrage or Fight action."
      }
    ],
    "source": "ASG",
    "license": "NIDHOGG",
    "license_level": 2,
    "effect": "While this turret can be rotated and fired using a mech's internal computers, it was designed to accept a gunner to manually aim and fire it. Adjacent, non-Immobilized allied characters can use a Full Action to mount the turret, and a Quick Action to exit the turret from within. The turret has space for a non-Mech character or a character of size no greater than yours minus 1½.<br><br>While inside the turret, the gunner:<ul><li>Cannot attack using their own weapons or systems in any way and cannot use any systems with the Deployable tag unless they were already deployed.</li><li>May use this weapon in its \"Manual Operation\" profile as if it was their own.</li><li>Has hard cover at all times. If their size is at least 2½ less than yours or if they are a non-Mech character, the gunner cannot be targeted by attacks at all.</li></ul><br>While a gunner is inside the turret, you may not use it for attacks, and, for safety reasons, the turret will lock itself and prevent manual operation if there is no pilot physically present in the Mech's cockpit.",
    "description": "ASGARD is not well known for its new and exotic technology, but the decision to model their \"Snjobolti\" turret on a design abandoned before humanity had escaped their home planet raised eyebrows even among those familiar with the company's reputation. Nonetheless, their improvements to the design's safety and effectiveness meant that the turret saved almost as many lives as it took.",
    "sp": 1
  },
  {
    "id": "mw_asg_mini_mjollnir",
    "name": "ASG-N10 Nović-Lovelace Nanite Weapon",
    "mount": "Heavy",
    "source": "ASG",
    "license": "NIDHOGG",
    "license_level": 1,
    "type": "Nexus",
    "range": [
      {
        "type": "Range",
        "val": 50
      }
    ],
    "damage": [
      {
        "type": "Burn",
        "val": 5
      }
    ],
    "effect": "This weapon does not require a valid path to its target to benefit from Seeking.",
    "on_hit": "This weapon deals double Burn to characters that already have any Burn.",
    "description": "This weapon is a miniaturized nanite projector that acts through a very unusual mechanism: rather than moving the nanties through physical space, they are actually sent through a microscopic blinkspace tunnel and near instantly transported to their destination, sight unseen. The technology by which control of the nanites is maintained through blinkspace is closely guarded by ASGARD's technological division.",
    "tags": [
      {
        "id": "tg_ordnance"
      },
      {
        "id": "tg_seeking"
      },
      {
        "id": "tg_smart"
      },
      {
        "id": "tg_guided"
      }
    ]
  },
  {
    "id": "asg_tyr_sword",
    "name": "Wolfstooth",
    "mount": "Auxiliary",
    "type": "Melee",
    "range": [
      {
        "type": "Threat",
        "val": 1
      }
    ],
    "damage": [
      {
        "type": "Kinetic",
        "val": "1d3+2"
      }
    ],
    "effect": "This weapon is not mounted on the mech itself: instead, it is an integrated part of the Tyr Battlesuit and may only be used for attacks as though it were a pilot weapon. However, the Wolfstooth benefits from your talents as though it were a Mech weapon.<br>While Jockeying a hostile Mech, you may attack it with this weapon instead of the standard options. If you do, damage dealt by that attack is Armor-Piercing and deals 4 bonus kinetic damage.",
    "on_attack": "If the Fenrir damaged your target since the start of your previous turn, your attack gains +1 Accuracy.",
    "description": "A sword, designed for the most foolhardy and dangerous mech pilots ever seen on a battlefield."
  },
  {
    "id": "mw_asg_greatsword",
    "name": "Greatsword",
    "mount": "Superheavy",
    "source": "ASG",
    "license": "FENRIR",
    "license_level": 3,
    "type": "Melee",
    "profiles": [
      {
        "name": "Guillotine",
        "on_hit": "The target must attempt a Hull save to avoid being knocked Prone.",
        "damage": [
          {
            "type": "Kinetic",
            "val": "1d6+2"
          }
        ],
        "range": [
          {
            "type": "Line",
            "val": 3
          }
        ],
        "tags": [
          {
            "id": "tg_reliable",
            "val": 2
          }
        ]
      },
      {
        "name": "Full Moon",
        "on_hit": "The target must attempt a Hull save to avoid being knocked Prone.",
        "damage": [
          {
            "type": "Kinetic",
            "val": "1d6+2"
          }
        ],
        "range": [
          {
            "type": "Burst",
            "val": 1
          }
        ],
        "tags": [
          {
            "id": "tg_knockback",
            "val": 2
          }
        ]
      },
      {
        "name": "Slayer",
        "on_hit": "The target must attempt a Hull save to avoid being knocked Prone.",
        "damage": [
          {
            "type": "Kinetic",
            "val": "1d6+2"
          }
        ],
        "range": [
          {
            "type": "Threat",
            "val": 1
          }
        ],
        "tags": [
          {
            "id": "tg_ap"
          },
          {
            "id": "tg_reliable",
            "val": 2
          }
        ]
      }
    ],
    "effect": "This weapon is so large that it requires a mount to brace it, but may be used as though it were a Heavy weapon, instead of Superheavy.",
    "on_attack": "Choose which profile you will attack with. After each attack with this weapon, you gain a cumulative +1 Difficulty on all Attacks and Saves you make until the start of your next turn.",
    "description": "This sword, with its thick blade, is one of the largest of its kind. Highly destructive, if intolerably heavy, it is little more than a heap of raw iron."
  },
  {
    "id": "mw_asg_injectionblade",
    "name": "Reactive Injection Blade",
    "mount": "Main",
    "source": "ASG",
    "license": "FENRIR",
    "license_level": 1,
    "type": "Melee",
    "sp": 1,
    "range": [
      {
        "type": "Threat",
        "val": 1
      }
    ],
    "damage": [
      {
        "type": "Kinetic",
        "val": "1d3"
      }
    ],
    "on_hit": "Until the end of your turn, each time you hit your target with a Melee attack you deal 1d3 bonus Energy damage. This weapon never applies this bonus damage.",
    "description": "Attacks with the Injection Blade leave volatile chemicals on the target's armor, which can be \"encouraged\" into a violent reaction through the application of force.",
    "tags": [
      {
        "id": "tg_unique"
      }
    ]
  },
  {
    "id": "mw_asg_fenrir_claws",
    "name": "Berserker Claws",
    "mount": "Heavy",
    "source": "ASG",
    "license": "FENRIR",
    "license_level": 2,
    "type": "Melee",
    "range": [
      {
        "type": "Threat",
        "val": 1
      }
    ],
    "damage": [
      {
        "type": "Kinetic",
        "val": "1d6+1"
      }
    ],
    "tags": [
      {
        "id": "tg_reliable",
        "val": 1
      },
      {
        "id": "tg_overkill"
      }
    ],
    "on_hit": "1/Turn, you may make another attack with this weapon against the same target as a Free Action",
    "description": "A pair of mech sized shredder claws, to bring out the animal in any pilot."
  },
  {
    "id": "mw_asg_grenade_launcher",
    "name": "Hymir Flexible Grenade Launcher",
    "mount": "Main",
    "source": "ASG",
    "license": "JORMUNGANDR",
    "license_level": 2,
    "type": "Launcher",
    "range": [
      {
        "type": "Range",
        "val": 10
      }
    ],
    "damage": [
      {
        "type": "Kinetic",
        "val": "3"
      },
      {
        "type": "Explosive",
        "val": "1d6"
      }
    ],
    "tags": [
      {
        "id": "tg_limited",
        "val": "4"
      }
    ],
    "on_attack": "You may choose to launch a grenade from another System instead of this weapon's typical ammunition. If you do, expend a charge from a system with the Grenade tag instead of this weapon.",
    "on_hit": "If you chose to fire a grenade from another system, this weapon deals no Explosive damage, but the chosen Grenade's effects trigger at the target's location. The target of the attack automatically fails any saves associated with the Grenade's detonation. Other affected characters still attempt saves as normal.",
    "description": "ASGARD's Hymir-model grenade launcher was adapted to fire most types of mass produced contact charge through the use of a large container that acts somewhat like a sabot. While the flexibility this provides is praiseworthy, the actual projectiles don't fly with any particular grace, limiting their effective range compared to the capabilities of similar launchers."
  },
  {
    "id": "mw_asg_titanium_hook",
    "name": "Titanium Hook",
    "mount": "Auxiliary",
    "source": "ASG",
    "license": "DRAUGR",
    "license_level": 1,
    "type": "Melee",
    "range": [
      {
        "type": "Threat",
        "val": 1
      }
    ],
    "damage": [
      {
        "type": "Kinetic",
        "val": "2"
      }
    ],
    "effect": "This weapon's on hit effect only applies to targets who are adjacent to you when the attack is made. Biological targets take double damage from this weapon.",
    "on_hit": "The hook's blade catches in the target's armor: if adjacency is broken between you and the target before the start of your next turn, the target takes 2 Armor-Piercing Kinetic damage.",
    "description": "<i>It's a hook. A well tempered and competently made one, to be sure, but just a simple hook, nonetheless. The sight of it makes me shiver at the thought of what it might do to flesh.</i>"
  },
  {
    "id": "mw_asg_cats_cradle",
    "name": "Cat's Cradle",
    "mount": "Main",
    "source": "ASG",
    "license": "DRAUGR",
    "license_level": 2,
    "type": "Melee",
    "sp": 1,
    "range": [
      {
        "type": "Threat",
        "val": 1
      }
    ],
    "damage": [
      {
        "type": "Kinetic",
        "val": "1d6"
      }
    ],
    "actions": [
      {
        "activation": "Full",
        "name": "Tighten String",
        "detail": "All characters marked by <i>Hairline Entanglement</i> are pulled up to 5 spaces directly toward you, Shredded, take 6 Kinetic Damage, and have <i>Hairline Entanglement</i> removed from them. Affected characters may attempt a Hull save to halve the damage and prevent being Shredded. Single Human targets affected by this action are instantly killed."
      }
    ],
    "on_hit": "The target becomes unwittingly entangled in nearly invisible wire and marked with <i>Hairline Entanglement</i>. This effect ends if the target moves more than Range 20 away from you at any point.",
    "description": "<i>It looks like armor plating for a mech's hands, but it's actually a weapon that projects a net of thin wire around the target. You can see light reflect off it at the right angle, but otherwise it's nearly impossible to tell it's even there. It's too easy to lose fingers...</i>"
  },
  {
    "id": "mw_asg_innocuous_sword",
    "name": "Prototype No. 161 (Discarded)",
    "mount": "Main",
    "source": "ASG",
    "license": "DRAUGR",
    "license_level": 3,
    "type": "Melee",
    "sp": 1,
    "profiles": [
      {
        "name": "Inactive",
        "damage": [
          {
            "type": "Kinetic",
            "val": "1d6"
          }
        ],
        "range": [
          {
            "type": "Threat",
            "val": 1
          }
        ],
        "effect": "This weapon begins in its Inactive profile and cannot change its profile manually. If any character takes Structure damage or is Destroyed, you gain 1 Heat and this weapon changes to its Bloodstoked profile.",
        "on_hit": "You gain 1 Heat and this weapon changes to its Bloodstoked profile."
      },
      {
        "name": "Bloodstoked",
        "damage": [
          {
            "type": "Kinetic",
            "val": "1d6"
          },
          {
            "type": "Energy",
            "val": "1d6"
          }
        ],
        "range": [
          {
            "type": "Threat",
            "val": 3
          }
        ],
        "tags": [
          {
            "id": "tg_ap"
          },
          {
            "id": "tg_accurate"
          },
          {
            "id": "tg_heat_self",
            "val": 1
          }
        ],
        "effect": "If you begin a turn with this weapon in its Bloodstoked profile, you gain 1 Heat. If you do not attack with this weapon by the end of your turn, you take 5 AP Energy damage and it reverts to its Inactive profile."
      }
    ],
    "description": "<i>It doesn't look like much, does it? But... it draws a lot more power than it seems like it should.</i>"
  },
  {
    "id": "mw_muninn_integrated",
    "name": "GUNGNIR-Class Orbital Pulse Weapon",
    "mount": "Orbital",
    "type": "Spool Weapon",
    "range": [
      {
        "type": "Range",
        "val": 999
      },
      {
        "type": "Blast",
        "val": 2
      }
    ],
    "damage": [
      {
        "type": "Energy",
        "val": "2d6"
      },
      {
        "type": "Heat",
        "val": 4
      }
    ],
    "actions": [
      {
        "activation": "Full Tech",
        "name": "Signal Strike",
        "detail": "Make an attack with GUNGNIR if it is loaded."
      }
    ],
    "effect": "This weapon cannot be reloaded normally, is fired as a Full Tech Action, ignores cover, and does not require line of sight to the target when declaring attacks. After you attack with this weapon, gain a Charge die, 1d6 starting at 2. At the start of each of your turns, reduce the Charge die by 1. When the Charge die would be reduced to 0, you lose the Charge die and this weapon reloads itself automatically.",
    "on_attack": "Gain +2 Accuracy when attacking targets with an unobstructed view of the sky. This weapon's Blast must be centered on a character affected by Lock-On and must consume Lock On on that target.",
    "on_hit": "Drones and NHP controlled mechs are Stunned until the end of their controller's next turn.",
    "description": "GUNGNIR is a weapon installed on every HUGINN class satellite capable of delivering a potent electromagnetic pulse to an area on the planet's surface with guidance from a spotter on the surface, even through solid barriers.",
    "tags": [
      {
        "id": "tg_loading"
      },
      {
        "id": "tg_inaccurate"
      },
      {
        "id": "tg_indestructible"
      }
    ]
  },
  {
    "id": "mw_asg_rolling_thunder",
    "name": "Rolling Thunder",
    "mount": "Superheavy",
    "type": "Cannon",
    "source": "ASG",
    "license": "MUNINN",
    "license_level": 3,
    "range": [
      {
        "type": "Range",
        "val": 30
      }
    ],
    "damage": [
      {
        "type": "Explosive",
        "val": "4d6"
      }
    ],
    "on_attack": "You may choose any number of valid targets when attacking with this weapon, and attacks with this weapon are not affected by cover.",
    "description": "The \"Rolling Thunder\" Siege System was built for the backlines. These paired mortars arrays are expected to be utilized alongside a spotter, as they offer no assistance in target-finding on their own. What they do provide is some of the highest raw explosive power available on the battlefield to date.",
    "tags": [
      {
        "id": "tg_guided"
      },
      {
        "id": "tg_loading"
      },
      {
        "id": "tg_arcing"
      },
      {
        "id": "tg_ordnance"
      },
      {
        "id": "tg_reliable",
        "val": 8
      }
    ]
  },
  {
    "id": "mw_asg_wavegun",
    "name": "Rho-Pattern Wave Gun",
    "mount": "Heavy",
    "type": "Cannon",
    "source": "ASG",
    "license": "MUNINN",
    "license_level": 2,
    "range": [
      {
        "type": "Range",
        "val": 15
      }
    ],
    "damage": [
      {
        "type": "Energy",
        "val": "1d6"
      }
    ],
    "on_hit": "All characters in a Line 15 area from you to the target take 3 AP Energy damage. The primary target takes this damage as Burn, instead.",
    "description": "The initial attack of this weapon fires a tuning probe which allows a wave emitter to trigger a harmonic energy wave between itself and the marked location. Wave guns are typically used for testing the behavior of paracausal anomalies, but this model has proven to have military uses thanks to the physically destructive nature of the 'rho' wave pattern.",
    "tags": [
      {
        "id": "tg_guided"
      },
      {
        "id": "tg_heat_self",
        "val": 3
      }
    ]
  },
  {
    "id": "mw_asg_flourish_rockets",
    "name": "Flourish Rockets",
    "mount": "Main",
    "type": "Launcher",
    "source": "ASG",
    "license": "MUNINN",
    "license_level": 1,
    "range": [
      {
        "type": "Range",
        "val": 15
      }
    ],
    "damage": [
      {
        "type": "Explosive",
        "val": 4
      }
    ],
    "on_hit": "Apply Lock On to the target.",
    "description": "The Flourish Rocket Pod is a semi-autonomous rocket turret built onto a mech's hull. When striking a target, it uses the resulting heat signature on its target to recalculate locks and pass the new lock information to the mech's other weapon platforms.",
    "tags": [
      {
        "id": "tg_guided"
      }
    ]
  },
  {
    "id": "mw_asg_kinetic_spike",
    "name": "Kinetic Spike",
    "mount": "Main",
    "type": "Melee",
    "source": "ASG",
    "license": "FAFNIR",
    "license_level": 1,
    "range": [
      {
        "type": "Threat",
        "val": 1
      }
    ],
    "damage": [
      {
        "type": "Kinetic",
        "val": "1d3"
      }
    ],
    "on_attack": "When attacking immediately after moving, this weapon gains bonuses based on how far you are from where you began the movement:<ul><li>2+ Spaces: Deal an additional 4 Kinetic damage on hit.</li><li>4+ Spaces: Gain +2 Accuracy on your attack.</li><li>7+ Spaces: Your attack becomes Reliable 4 and AP.</li></ul><br/>These bonuses only apply to the attack if it immediately follows a movement action or a standard move. Taking any action, including Free Actions, before attacking with the Kinetic Spike will forfeit any bonuses the attack would have received.",
    "description": "On the outside, this weapon seems like nothing more than a large metal spike mounted to a mech's arm. In reality, it is a large metal spike mounted to a kinetic compensator, which can store a portion of the kinetic energy of a mech's movement, bringing that extra force to bear on its next swing."
  },
  {
    "id": "mw_asg_dragonlance",
    "name": "Drachenlanze",
    "mount": "Superheavy",
    "source": "ASG",
    "license": "FAFNIR",
    "license_level": 3,
    "type": "CQB",
    "sp": 2,
    "profiles": [
      {
        "name": "Heavy Lance",
        "damage": [
          {
            "type": "Kinetic",
            "val": "1d6+2"
          }
        ],
        "range": [
          {
            "type": "Threat",
            "val": 2
          }
        ],
        "effect": "When attacking in this profile, the Drachenlanze is considered a Melee weapon."
      },
      {
        "name": "Revolver Cannon",
        "damage": [
          {
            "type": "Explosive",
            "val": "1d3+2"
          }
        ],
        "range": [
          {
            "type": "Range",
            "val": 2
          },
          {
            "type": "Threat",
            "val": 2
          }
        ],
        "tags": [
          {
            "id": "tg_heat_self",
            "val": 1
          }
        ],
        "on_attack": "You may make an additional attack with this profile against the same target as a Free Action after this attack. Each time you do so, the Heat (Self) rating of this profile doubles until the end of your current turn."
      },
      {
        "name": "Exhaust Blast",
        "range": [
          {
            "type": "Range",
            "val": 2
          }
        ],
        "tags" : [
          {
            "id": "tg_ordnance"
          }
        ],
        "on_attack": "Release a burst of superheated flame from the Drachenlanze to clear up to 1d3+3 Heat.",
        "on_hit": "Inflict 1 Burn on the target for each point of Heat you cleared."
      }
    ],
    "effect": "You may use this weapon with Skirmish and Overwatch in its Heavy Lance and Revolver Cannon profiles. When you Barrage with this weapon, you may make a single attack with it in its Exhaust Blast profile or make two attacks with it in its other profiles. You may choose the same profile twice when attacking this way.",
    "description": "The Drachenlanze weapon system is the epitome of ASGARD design: a massive steel lance fitted with an explosive, revolving-cylinder cannon and a burst flamethrower. By other manufacturer's standards, it is not complex. By ASGARD's standards, it is a joy to use and a force to be reckoned with."
  },
  {
    "id": "mw_lumico_quint_rifle",
    "name": "Quintessence Rifle",
    "mount": "Heavy",
    "source": "LUMICO",
    "license": "VIRTUOSO",
    "license_level": 3,
    "type": "Rifle",
    "range": [
      {
        "type": "Range",
        "val": 15
      }
    ],
    "damage": [
      {
        "type": "Energy",
        "val": "1d6+1"
      }
    ],
    "tags": [
      {
        "id": "tg_accurate"
      },

      {
        "id": "tg_luxury",
        "val": "1"
      }
    ],
    "effect": "If this weapon is fired with at least +4 Accuracy, it automatically hits and deals 1d6+4 bonus Energy damage.",
    "description": "Lumiera Corporation's luxury Quintessence Rifle was not designed for use by the masses, but instead only by experts in the art of war. In the hands of the average user, it is a slightly better than average rifle. In the hands of a master, it will never miss."
  },
  {
    "id": "mw_lumico_breathtaker",
    "name": "Breathtaker Revolver",
    "mount": "Main",
    "source": "LUMICO",
    "license": "VIRTUOSO",
    "license_level": 2,
    "type": "CQB",
    "range": [
      {
        "type": "Range",
        "val": 7
      },
      {
        "type": "Threat",
        "val": 3
      }
    ],
    "damage": [
      {
        "type": "Kinetic",
        "val": "1d3"
      },
      {
        "type": "Energy",
        "val": "1d3"
      },
      {
        "type": "Burn",
        "val": "1"
      }
    ],
    "tags": [
      {
        "id": "tg_luxury",
        "val": "2"
      }
    ],
    "description": "A beautifully engineered revolver, made by hand and inlaid with sustainably sourced gold and pearl in a completely unique pattern designed specifically for the commissioner, to leave your enemies breathless in their final moments."
  },
  {
    "id": "mw_lumico_heartseeker",
    "name": "Heartseeker",
    "mount": "Auxiliary",
    "source": "LUMICO",
    "license": "VIRTUOSO",
    "license_level": 1,
    "type": "Launcher",
    "sp": 1,
    "range": [
      {
        "type": "Range",
        "val": 7
      }
    ],
    "tags": [
      {
        "id": "tg_luxury",
        "val": "1"
      },
      {
        "id": "tg_smart"
      },
      {
        "id": "tg_unique"
      }
    ],
    "effect": "This weapon cannot deal bonus damage for any reason.",
    "on_hit": "Apply Lock On to the target.",
    "description": "A tiny launcher that fires a small tracker that attaches to the target on contact. While not as flashy as some of Lumiera Corporation's other offerings, it is still built to their high standards."
  },
  {
    "id": "mw_lumico_sycamore_axe",
    "name": "Sycamore Axe",
    "mount": "Main",
    "source": "LUMICO",
    "license": "TRAILBLAZER",
    "license_level": 3,
    "type": "Melee",
    "range": [
      {
        "type": "Threat",
        "val": 1
      }
    ],
    "damage": [
      {
        "type": "Kinetic",
        "val": "1d6"
      }
    ],
    "effect": "Kinetic damage dealt by this weapon cannot be reduced in any way.",
    "on_hit": "1/Turn, any bonus damage dealt by this weapon is doubled.",
    "description": "He dropped the axe to the ground in exhaustion, its blade damaged beyond repair, and spoke softly, with pain in his voice but without regret: <i>I didn't want to cut you down, but I had to. I hope you can understand.</i>"
  },
  {
    "id": "mw_lumico_hatchet",
    "name": "Hunter's Hatchet",
    "mount": "Auxiliary",
    "source": "LUMICO",
    "license": "TRAILBLAZER",
    "license_level": 1,
    "type": "Melee",
    "range": [
      {
        "type": "Threat",
        "val": 1
      }
    ],
    "damage": [
      {
        "type": "Kinetic",
        "val": "1d3"
      }
    ],
    "tags": [
      {
        "id": "tg_thrown",
        "val": "5"
      },
      {
        "id": "tg_luxury",
        "val": "1"
      }
    ],
    "effect": "You may Overwatch with this weapon as though it had Threat 5. If the target is not adjacent to you, the Overwatch must be be made as a thrown attack.",
    "description": "A good tool is simple, easy to repair, and serves many purposes. This hatchet was designed to fill such a duty, in peace and in conflict."
  },
  {
    "id": "mw_lumico_teacher",
    "name": "\"Stern Teacher\" Smoothbore Gun",
    "mount": "Main",
    "source": "LUMICO",
    "license": "TRAILBLAZER",
    "license_level": 2,
    "type": "CQB",
    "range": [
      {
        "type": "Range",
        "val": 5
      },
      {
        "type": "Threat",
        "val": 3
      }
    ],
    "damage": [
      {
        "type": "Kinetic",
        "val": "1d6+5"
      }
    ],
    "tags": [
      {
        "id": "tg_inaccurate"
      },
      {
        "id": "tg_ap"
      }
    ],
    "effect": "You may only attack with this weapon 1/Round.",
    "description": "Lumiera Corporation is usually well known for complex and over-designed weapons designed to mitigate any flaw that a human user introduces. The \"Teacher\" does not follow this tradition. It is the simplest kind of gun and offers no fancy tricks, only raw power. It teaches humility, in its form and execution. The only question is who this lesson will reach: the user, or their target."
  },
  {
    "id": "mw_lumico_misericorde",
    "name": "Misericorde",
    "mount": "Auxiliary",
    "source": "LUMICO",
    "license": "SAVANT",
    "license_level": 1,
    "type": "Melee",
    "range": [
      {
        "type": "Threat",
        "val": 1
      }
    ],
    "damage": [
      {
        "type": "Kinetic",
        "val": "1"
      }
    ],
    "tags": [
      {
        "id": "tg_luxury",
        "val": 1
      },
      {
        "id": "tg_thrown",
        "val": 3
      }
    ],
    "on_hit": "This weapon deals 1 Energy damage for each Structure and Stress you are missing.",
    "description": "<i>Misericorde</i> means 'mercy', its name taken from knives of this design being used to deliver final blows to wounded knights on a battlefield. This blade will be with you until the very end."
  },
  {
    "id": "mw_lumico_psi_blade_array",
    "name": "Psi Blade Array",
    "mount": "Main",
    "source": "LUMICO",
    "license": "SAVANT",
    "license_level": 2,
    "type": "Melee",
    "range": [
      {
        "type": "Threat",
        "val": 1
      }
    ],
    "damage": [
      {
        "type": "Energy",
        "val": 3
      }
    ],
    "tags": [
      {
        "id": "tg_smart"
      },
      {
        "id": "tg_luxury",
        "val": 2
      },
      {
        "id": "tg_thrown",
        "val": 5
      }
    ],
    "effect": "You do not need to retrieve this weapon after using it for a Thrown attack to continue using it for attacks. This weapon can only deal Bonus Damage once per turn. Whenever you would make any attack as a free action, you may sacrifice the original attack to make a Thrown attack with this weapon instead.",
    "on_attack": "If you are Barraging, you may choose this weapon for both attacks. After you Barrage, you may attack with this weapon once as a free action for each attack you made with this weapon during the Barrage.",
    "description": "The Psi Blade Array produces blades made of violet hardlight which can be controlled using the brainwaves of the pilot. Though they dissapate on contact with the enemy mech, these projectiles are so light that they can be thrown over and over in quick succession, wearing the enemy down under a hail of blades."
  },
  {
    "id": "mw_lumico_atlasstone",
    "name": "Atlas Stone",
    "mount": "Heavy",
    "source": "LUMICO",
    "license": "SAVANT",
    "license_level": 2,
    "type": "Melee",
    "range": [
      {
        "type": "Threat",
        "val": 3
      }
    ],
    "damage": [
      {
        "type": "Kinetic",
        "val": 3
      }
    ],
    "tags": [
      {
        "id": "tg_thrown",
        "val": 3
      },
      {
        "id": "tg_reliable",
        "val": 3
      },
      {
        "id": "tg_ap"
      }
    ],
    "effect": "You may only make Thrown attacks with this weapon. This weapon cannot be automatically retrieved or have its range increased through the effect of frame traits, talents, or systems, and cannot have mods applied to it.",
    "on_attack": "After your attack resolves, increase this weapon's damage, threat, Reliable rating, and Thrown rating by 3 until the end of the scene.",
    "description": "An atlas stone is an immense and weighty sphere, used by humans to demonstrate their strength beyond normal limits. This weapon is such a stone, a sphere the size of a human being made of hard rock. Supposedly, it was designed to strain a mech's computers and pneumatics to their limits, and to ignite the 'spirit of defiance' within the machine. While there is no scientific evidence for this phenomenon, almost all NHPs introduced to the atlas stone have displayed an unusual degree of hatred and respect for this otherwise innocuous object."
  },
  {
    "id": "mw_lumico_winch_sword",
    "name": "Chain Winch Viceblade",
    "mount": "Heavy",
    "source": "LUMICO",
    "license": "SAVANT",
    "license_level": 3,
    "type": "Melee",
    "sp": 1,
    "profiles": [
      {
        "name": "VICEBLADE",
        "damage": [
          {
            "type": "Kinetic",
            "val": "1d6+2"
          }
        ],
        "range": [
          {
            "type": "Threat",
            "val": 1
          }
        ],
        "effect": "During any turn where you have dealt damage with this weapon's Impalement Chain profile, you may ignore the normal restrictions on duplicate actions when choosing to Skirmish with this profile.",
        "on_attack": "Against Immobilized and Stunned targets, this weapon gains Reliable 6 and treats the target as though they were Shredded."
      },
      {
        "name": "IMPALEMENT CHAIN",
        "damage": [
          {
            "type": "Kinetic",
            "val": "1d6"
          }
        ],
        "range": [
          {
            "type": "Threat",
            "val": 1
          }
        ],
        "tags": [
          {
            "id": "tg_thrown",
            "val": 10
          }
        ],
        "effect": "The Impalement Chain is automatically retracted and retrieved after being thrown.",
        "on_hit": "If the target is the same size as you or smaller, they must pass a Hull Save or be pulled directly to you and Immobilized until the end of the current turn. If your target was larger than you, you are pulled to them, instead."
      }
    ],
    "tags": [
      {
        "id":"tg_luxury",
        "val": 1
      }
    ],
    "description": "This heavy sword's blade opens down the middle like a pair of scissors, exposing a deadly spike chained to a winch just above the sword's hilt. The spike itself is the size of a javelin, and can be thrown in the same manner, or launched directly from the weapon itself. When a target is speared on the spike, the winch begins to turn and retract, reeling the unfortunate victim between the Viceblade's open jaws."
  },
  {
    "id": "mw_savant_integrated",
    "name": "Divine Armory",
    "mount": "Mercurial",
    "type": "Melee",
    "range": [
      {
        "type": "Threat",
        "val": 1
      }
    ],
    "profiles": [
      {
        "name": "I - JERA",
        "damage": [
          {
            "type": "Energy",
            "val": "3"
          }
        ],
        "tags": [
          {
            "id": "tg_thrown",
            "val": 5
          },
          {
            "id": "tg_reliable",
            "val": 3
          }
        ]
      },
      {
        "name": "II - HAGALAZ",
        "damage": [
          {
            "type": "Energy",
            "val": "1d3"
          }
        ],
        "tags": [
          {
            "id": "tg_thrown",
            "val": 5
          }
        ],
        "on_attack": "Choose up to two additional targets for the attack. A single character cannot be damaged by this profile more than once per attack."
      },
      {
        "name": "III - RAIDO",
        "damage": [
          {
            "type": "Energy",
            "val": "1d3"
          }
        ],
        "tags": [
          {
            "id": "tg_thrown",
            "val": 7
          }
        ],
        "on_hit": "You may teleport to a space adjacent to your target."
      },
      {
        "name": "IV - ISAZ",
        "damage": [
          {
            "type": "Energy",
            "val": "1d3 + 2"
          }
        ],
        "tags": [
          {
            "id": "tg_thrown",
            "val": 5
          },
          {
            "id": "tg_ap"
          }
        ]
      },
      {
        "name": "V - ALGIZ",
        "damage": [
          {
            "type": "Energy",
            "val": "1d3"
          }
        ],
        "tags": [
          {
            "id": "tg_thrown",
            "val": 5
          }
        ],
        "on_hit": "You gain 3 Overshield."
      },
      {
        "name": "VI - SOWILO",
        "damage": [
          {
            "type": "Energy",
            "val": "1d3"
          }
        ],
        "tags": [
          {
            "id": "tg_thrown",
            "val": 5
          }
        ],
        "on_crit": "Reroll the Armory Die used to make this attack and immediately make another attack against the same target using the rolled profile."
      }
    ],
    "effect": "<ul><li>This weapon cannot deal bonus damage.</li><li>You may only attack with this weapon through the effect of the Savant's core power. When you attack, choose a profile to attack with. Its number must match one of the Savant's Armory Dice. After attacking, reroll one Armory Die that matched the chosen profile.</li><li>Attacks with this weapon must be made as Thrown attacks. Each time this weapon is used for a thrown attack, a golden phantom weapon is directly materialized into your Mech's hands, which dematerializes after it is thrown. As such, you do not need to retrieve anything to make additional attacks with it, but the thrown weapons cannot be retrieved and used again.</li></ul>",
    "description": ""
  },
  {
    "id": "mw_ice_unity_banner",
    "name": "Banner of Unity",
    "mount": "Heavy",
    "source": "ICE",
    "license": "ICEBREAKER",
    "license_level": 2,
    "type": "Melee",
    "range": [
      {
        "type": "Threat",
        "val": 2
      }
    ],
    "damage": [
      {
        "type": "Kinetic",
        "val": "1d3"
      }
    ],
    "actions": [
      {
        "activation": "Full",
        "name": "Flame of Hope",
        "detail": "You may only take this action while in the Danger Zone.<br/><br/>You activate this system's Aura, granting [ 8 + your Grit ] Overshield to all allies in range. While this system's Aura is active, you gain access to this weapon's On Hit effect, but you cannot attack with any weapons other than this one and, upon clearing enough heat to leave the Danger Zone, you immediately gain Heat until you reach the Danger Zone."
      }
    ],
    "on_hit": "If this weapon's Aura is active: deal 2 Burn to your target and choose an allied Character within this weapon's Aura. The chosen ally gains 4 Overshield and +2 Accuracy on their next attack or save.",
    "tags": [
      {
        "id": "tg_aura",
        "val": 10
      },
      {
        "id": "tg_danger_zone"
      },
      {
        "id": "tg_overshield"
      }
    ],
    "effect": "You can only activate this weapon's Aura via the <i>Flame of Hope</i> action, though you can deactivate it normally.",
    "description": "This polearm has a wide projector near the business end that allows it to project a curtain of superheated plasma, mostly fuelled by the exhaust of an overtaxed reactor. It appears as a banner made of flame, and much like the bannerets of yesteryear, the sight of one's ally proudly carrying the battle standard forward inspires morale in one's heart."
  },
  {
    "id": "mw_ice_nuclear_sword",
    "name": "Fusion Sword",
    "mount": "Main",
    "source": "ICE",
    "license": "ICEBREAKER",
    "license_level": 1,
    "type": "Melee",
    "range": [
      {
        "type": "Threat",
        "val": 1
      }
    ],
    "damage": [
      {
        "type": "Energy",
        "val": "1d3+1"
      }
    ],
    "on_hit": "If you are in the Danger Zone, this weapon's base damage is doubled and you roll 1d6. If you roll a 6, the sword overloads, detonating and destroying the mount it is on. The explosion deals 1d6+6 AP Explosive damage to your target and Stuns them until the end of their next turn, while also Stunning you until the end of your current turn.",
    "description": "\"Get me closer!\" you hear the pilot in the advertisement yell, beaming with pride at the new weapon he carries, \"Get me closer so I can hit them with my nuclear sword!\""
  },
  {
    "id": "mw_ice_swashbuckler",
    "name": "Swashbuckler Gunblade",
    "mount": "Main",
    "source": "ICE",
    "license": "ICEBREAKER",
    "license_level": 2,
    "type": "CQB",
    "profiles": [
      {
        "name": "Gunner Stance",
        "damage": [
          {
            "type": "Kinetic",
            "val": "1d6+2"
          }
        ],
        "range": [
          {
            "type": "Threat",
            "val": 3
          },
          {
            "type": "Range",
            "val": 5
          }
        ],
        "on_hit": "After dealing damage, this weapon changes to its Blade Stance profile.",
        "effect": "Gain +1 Accuracy when making Overwatch attacks."
      },
      {
        "name": "Blade Stance",
        "damage": [
          {
            "type": "Kinetic",
            "val": "1d6"
          }
        ],
        "range": [
          {
            "type": "Threat",
            "val": 1
          }
        ],
        "on_hit": "After dealing damage, this weapon changes to its Gunner Stance profile.",
        "effect": "This weapon is considered a Melee weapon in this profile. Immediately before or after you attack with this weapon, you may move up to 3 Spaces. This movement does not provoke Reactions."
      }
    ],
    "effect": "At the start of your first turn in this scene, choose a profile to begin in. You can only change profiles through this weapon's On Hit effect.",
    "description": "\"Wouldn't it be more practical to just... carry a gun and a sword, separately?\"<br/><i>- A question devised by the terminally uninteresting.</i>"
  },
  {
    "id": "mw_ice_wennsorin",
    "name": "SA 2-580 'WENNSORIN'",
    "mount": "Main",
    "source": "ICE",
    "license": "ANGEL",
    "license_level": 3,
    "type": "Launcher",
    "range": [
      {
        "type": "Range",
        "val": 15
      }
    ],
    "damage": [
      {
        "type": "Energy",
        "val": "1d3+2"
      }
    ],
    
    "tags": [
      {
        "id": "tg_smart"
      },
      {
        "id": "tg_seeking"
      }
    ],
    "on_hit": "The target gains <i>[ 6 - X ]</i> Heat, where X is the amount of damage dealt by this weapon.",
    "description": "<i>ARTIFACT STABILIZATION LOG<br/>RECORD: 2-580<br/><br/>IT KIND OF LOOKS LIKE A GREATBOW WITHOUT A STRING, DOESN'T IT?<br/>WHEN THE MECH DRAWS BACK FROM WHERE THE STRING OUGHT TO BE, AN INVISIBLE PULSE OF ENERGY IS GENERATED:<br/>IN UNDER A NANOSECOND, IT CAROMS AROUND THE TARGET, STRIKING THEM MULTIPLE TIMES.<br/><br/>ONE OF THE ASSISTANTS IGNORED SAFETY PROTOCOLS AND ACCIDENTALLY HIT THEMSELF WITH IT, SOMEHOW.<br/>THEY COLLAPSED, AND AUTOPSY SHOWED GAMMA BURNS IN THEIR BRAIN TISSUE.</i>"
  },
  {
    "id": "mw_ice_spearoflight",
    "name": "SA 1-203 'REVEALING LIGHT'",
    "mount": "Main",
    "source": "ICE",
    "license": "ANGEL",
    "license_level": 2,
    "type": "Melee",
    "range": [
      {
        "type": "Threat",
        "val": 2
      }
    ],
    "damage": [
      {
        "type": "Kinetic",
        "val": "1d3"
      }
    ],
    
    "tags": [
      {
        "id": "tg_smart"
      },
      {
        "id": "tg_thrown",
        "val": 15
      },
      {
        "id": "tg_limited",
        "val": 2
      }
    ],
    "effect": "Charges of this weapon are only used up when making Thrown attacks and it does not need to be retrieved after a Thrown attack to continue to make attacks with it. This weapon cannot be used for Thrown attacks with no charges remaining, but normal melee attacks are still possible.",
    "on_attack" : "When making a Thrown attack, this weapon deals damage to all characters in a Line 15 area toward the primary target of the attack, passing through walls and obstructions and ignoring cover. For every point of Kinetic damage the attack would normally do, it instead inflicts 1 Heat and 1 Burn. Thrown attacks with this weapon do not damage objects.",
    "description": "<i>ARTIFACT STABILIZATION LOG<br/>RECORD: 1-203<br/><br/>WE GAVE THE CODE 'REVEALING LIGHT' TO THIS ARTIFACT, SINCE IT COULD INTERACT WITH OBJECTS THAT IT HAD NO CLEAR LINE OF SIGHT TO.<br/>'THROWING' IT FIRES OFF A LANCE OF LIGHT THAT CAN CAUSE SERIOUS BURNS IN HUMAN TISSUE AND DAMAGE NHPS.<br/>HAS NO EFFECT ON STATIC OBJECTS.<br/>SOMEHOW MECHS ARE DIFFERENT?</i>"
  },
  {
    "id": "mw_ice_leafblade",
    "name": "SA 1-717 'BLADE OF GRASS'",
    "mount": "Main",
    "source": "ICE",
    "license": "GREENHORN",
    "license_level": 2,
    "type": "Melee",
    "profiles": [
      {
        "name": "Honed",
        "damage": [
          {
            "type": "Kinetic",
            "val": "1d6+2"
          }
        ],
        "range": [
          {
            "type": "Threat",
            "val": 1
          }
        ],
        "tags": [
          {
            "id": "tg_accurate",
            "val": 2
          },
          {
            "id": "tg_reliable",
            "val": 2
          }
        ],
        "on_crit": "You deal 1d6 bonus Kinetic damage to your target and all damage from your attack becomes Armor-Piercing, but this weapon changes to its Torn profile."
      },
      {
        "name": "Torn",
        "damage": [
          {
            "type": "Kinetic",
            "val": 1
          }
        ],
        "range": [
          {
            "type": "Threat",
            "val": 1
          }
        ],
        "actions": [
          {
            "activation": "Full",
            "name": "Whetting Growth",
            "detail": "Gain 5 Heat. Rebloom the Blade of Grass, returning it to its Honed profile."
          }
        ]
      }
    ],
    "effect": "This weapon begins in its Honed profile after a Full Repair or a Rest.",
    "description": "<i>ARTIFACT STABILIZATION LOG<br/>RECORD: 1-717<br/><br/>WHO WOULD HAVE KNOWN THAT A SWORD MADE OF PLANT MATERIAL WOULD BE SO SHARP?<br/>IT CLEAVES THROUGH MECH ARMOR LIKE BUTTER.<br/>IT IS A PLANT, THOUGH.<br/>DON'T BE TOO HARD ON IT IF IT BREAKS.</i>"
  },
  {
    "id": "mw_ice_woodhammer",
    "name": "SA 2-635 'WOOD HAMMER'",
    "mount": "Heavy",
    "source": "ICE",
    "license": "GREENHORN",
    "license_level": 3,
    "type": "Melee",
    "range": [
      {
        "type": "Threat",
        "val": 1
      }
    ],
    "damage": [
      {
        "type": "Kinetic",
        "val": "2d6+4"
      }
    ],
    "tags": [
      {
        "id": "tg_overshield"
      }
    ],
    "on_hit": "You take Kinetic damage equal to the damage you dealt with your attack. Then, you gain Overshield equal to the amount of damage you dealt to yourself after reductions from Armor or Resistance.",
    "description": "<i>ARTIFACT STABILIZATION LOG<br/>RECORD: 2-635<br/><br/>THIS THING HAS A <u>LOT</u> OF POWER BEHIND IT, ENOUGH TO REALLY ROCK A MECH'S INTERNALS.<br/>BASICALLY, IT WORKS LIKE A PILE BUNKER: A DETONATION OF ORGANIC CHEMICALS IN THE WEAPON CAUSE A BLAST THAT PROPELS THE HEAD OF THE WEAPON FORWARD, ADDING TO THE SWING FORCE THAT THE MECH PROVIDES. THIS IS REALLY DESTRUCTIVE, AND LEAVES A SLOUGHED OFF SHELL OF DEAD MATTER BEHIND. THE PILOT CAN USE IT TO BLOCK A BIT OF ENEMY FIRE WHILE THE WEAPON REGROWS.</i>"
  },
  {
    "id": "mw_poke_integrated",
    "name": "Big Iron",
    "mount": "Jury-Rigged",
    "type": "Railway Gun",
    "range": [
      {
        "type": "Range",
        "val": 15
      }
    ],
    "damage": [
      {
        "type": "Explosive",
        "val": "5d6+6"
      }
    ],
    "tags": [
      {
        "id": "tg_loading"
      },
      {
        "id": "tg_ap"
      },
      {
        "id": "tg_reliable",
        "val": "20"
      }
    ],
    "effect": "This weapon begins unloaded at the start of each scene and may only be reloaded by the effect of Quickdraw. Damage from this weapon ignores Resistance. If the target of the attack has immunity to Explosive damage, Big Iron deals Kinetic damage instead.",
    "on_hit": "If the target is destroyed, characters adjacent to the target take 1d6 Explosive damage. Affected characters may attempt a Hull Save to halve the damage.",
    "on_attack": "You gain +3 Accuracy when attacking with Big Iron.",
    "actions": [
      {
        "activation": "Full",
        "name": "Fire Big Iron",
        "detail": "You can attack on your turn with Big Iron as a full action if it is loaded, but you may not move or take any other actions on the same turn."
      }
    ],
    "description": "<i>He's here to do some business with the big iron on his hip.</i>"
  },
  {
    "id": "mw_asgard_door",
    "name": "A4 ASGARD Security \"Shield\"",
    "mount": "Main",
    "source": "EXOTIC",
    "type": "Melee",
    "range": [
      {
        "type": "Threat",
        "val": 1
      }
    ],
    "damage": [
      {
        "type": "Kinetic",
        "val": "1d3"
      }
    ],
    "tags": [
      {
        "id": "tg_knockback",
        "val": "2"
      },
      {
        "id": "tg_indestructible"
      },
      {
        "id": "tg_exotic"
      }
    ],
    "actions": [
      {
        "activation": "Protocol",
        "name": "Lockdown",
        "detail": "You choose the an area to <i>Cover</i> immediately, are Immobilized and Impaired until the start of your next turn, and may only target characters within the <i>Covered</i> area for attacks. You gain Immunity to damage and Burn from ranged attacks that originate within the <i>Covered</i> area this Round, instead of Resistance."
      }
    ],
    "effect": "While installed, Mechs of Size 1 or less have their Speed reduced by 2 by this weapon.<br>At the end of your turn, you may Immobilize yourself until the start of your next turn to choose a Cone 30 area to <i>Cover</i>. You have Resistance to all damage and Burn from ranged attacks that originate within the <i>Covered</i> area until the start of your next turn. This effect ends if you move for any reason while it is active.",
    "description": "This is not a weapon, exactly, but a high-end ASGARD security door ripped free of its frame and repurposed as a shield, in a strange effort to harness the ridiculous strength of ASGARD's security doors in combat."
  },
  {
    "id": "mw_orchid",
    "name": "ORCHID",
    "mount": "Main",
    "source": "EXOTIC",
    "type": "Melee",
    "range": [
      {
        "type": "Threat",
        "val": 1
      }
    ],
    "damage": [
      {
        "type": "Kinetic",
        "val": "1d6"
      }
    ],
    "tags": [
      {
        "id": "tg_oneofakind"
      },
      {
        "id": "tg_exotic"
      }
    ],
    "actions": [
      {
        "activation": "Full",
        "name": "Equinox",
        "detail": "Take an offensive stance and ready yourself to execute <i>Solstice,</i> a technique that will deal <u>immense</u> damage to its target. This stance ends if you move, voluntarily or involuntarily, if you are Jammed or Stunned, or if you drop this stance as a free action. Your mech loses 1 Stress and Overheats at the end of each turn that this stance is active, except the turn that this action was taken."
      },
      {
        "activation": "Full",
        "name": "Solstice",
        "detail": "You may only use this action if Equinox is active. Choose an adjacent character and deal 99 Kinetic, Energy, and Explosive damage to them. This damage cannot be reduced or prevented in any way. After dealing damage in this way, all characters within Blast 2 of your target are Stunned. Then, your mech is destroyed."
      }
    ],
    "on_crit": "This weapon deals 1d6 bonus Kinetic damage.",
    "description": "This sword is built with an extremely powerful capacitor which can accept almost the entire power supply of a Mech's reactor. Dumping all of this power into a single attack allows the guaranteed destruction of a single target, albeit destroying the user in the process as well. It would be potentially possible to unleash this attack without the immense backlash, but the tolerances on the attack are so tight that without the aid of a Mech's targeting computers (which would necessarily be disabled by the procedure) such a feat seems wholly impossible. And yet..."
  },
  {
    "id": "mw_bayhound_integrated",
    "name": "Sonic Burst Driver",
    "mount": "Heavy",
    "type": "CQB",
    "profiles": [
      {
        "name": "BARK",
        "damage": [
          {
            "type": "Explosive",
            "val": "1d6+2"
          }
        ],
        "range": [
          {
            "type": "Range",
            "val": 3
          },
          {
            "type": "Threat",
            "val": 3
          }
        ],
        "tags": [
          {
            "id": "tg_accurate"
          },
          {
            "id": "tg_reliable",
            "val": 2
          }
        ],
        "on_crit": "The target is Shredded until the end of the turn."
      },
      {
        "name": "HOWL",
        "damage": [
          {
            "type": "Explosive",
            "val": "1d6+2"
          }
        ],
        "range": [
          {
            "type": "burst",
            "val": 2
          }
        ],
        "tags": [
          {
            "id": "tg_accurate"
          },
          {
            "id": "tg_reliable",
            "val": 2
          }
        ],
        "effect": "This weapon counts as a Superheavy weapon when attacking in this mode.<br>You may choose to add +2 Difficulty to your attack when attacking in this mode to choose which characters are affected.",
        "on_crit": "The target is Shredded until the end of the turn."
      }
    ]
  },
  {
    "id": "mw_dogma_integrated",
    "name": "Fiery Revolving Sword",
    "mount": "Heavy",
    "type": "Melee",
    "damage": [
      {
        "type": "Energy",
        "val": "1d6+1"
      },
      {
        "type": "Burn",
        "val": "4"
      }
    ],
    "range": [
      {
        "type": "Range",
        "val": 5
      },
      {
        "type": "Threat",
        "val": 3
      }
    ],
    "tags": [
      {
        "id": "tg_accurate"
      },
      {
        "id": "tg_heat_self",
        "val": 2
      }
    ],
    "effect": "This weapon may only be used to attack as a part of a Reaction.<br/>If a Mech or Vehicle is destroyed due to damage from this weapon, the Pilot or Crew always survive the Mech or Vehicle's destruction. Human targets take no damage from this weapon and are Jammed instead.",
    "on_crit": "This weapon deals 2 extra Burn and its Energy damage is maximized.",
    "description": "<i>Deep calls to deep in the roar of your waterfalls; all your waves and breakers have swept over me.</i>"
  }
]
